{
  "textbook": {
    "id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
    "file_name": "Class X Health and PE - Ch 00 - National Council of Educational Research and Training.pdf",
    "title": "National Council of Educational Research and Training",
    "grade": 10,
    "subject": "Class X Health and PE",
    "total_pages": 10,
    "file_size_mb": 1.4767961502075195,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:35.498276",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Health and PE/Class X Health and PE - Ch 00 - National Council of Educational Research and Training.pdf"
  },
  "chapters": [
    {
      "id": "57139b60-305b-4667-b7d5-7236b2848208",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 1,
      "title": "1. National Institute of Education (NIE) undertakes",
      "topics": [],
      "start_page": 1,
      "end_page": 2,
      "content": "research and development activities related to \npedagogical aspects of curriculum, instructional \nmaterials and supplementary materials. It prepares \nnational curricular policy documents, develops \ndatabase and various types of materials and organises \nin-service training for different target groups.\nAgencies And AwArds \nPromoting HeAltH, \nsPorts And YogA\n13\nActivity 13.1\nWhere is the headquarter \nof NCERT located?\nChap-13.indd   215 8/24/2020   12:27:35 PM\n2024-25\n\n--- Page 2 ---\nHealtH and PHysical education - class X\n216\nDo You Know?\nCBSE has started \ncompetitive sports for all \nprivate schools affiliated \nto CBSE since 1988-89.\nActivity 13.2\nFind out how many \nclusters are taking part is \nCBSE competitive sport."
    },
    {
      "id": "236466c0-797e-47c8-baa1-ee5e9f39699a",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 2,
      "title": "2. Central Institute of Educational Technology CIET",
      "topics": [],
      "start_page": 2,
      "end_page": 2,
      "content": "is concerned with development of educational \ntechnology, design and production of media software. \nIt holds programmes to build competencies of media \npersonnel and need-based researches. It evaluates \nactivities undertaken and studies carried out to assess \nthe effectiveness of materials and programmes. "
    },
    {
      "id": "9e287927-7332-404a-8f6c-202381b24aac",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 3,
      "title": "3. Pandit Sunderlal Sharma Central Institute of",
      "topics": [],
      "start_page": 2,
      "end_page": 2,
      "content": "Vocational Education (PSSCIVE) is located at Bhopal \nand organises research, development, training and \nextension programmes related to Work education and \nVocational education. "
    },
    {
      "id": "365178d0-883b-485d-af22-1318e4d2a32d",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 4,
      "title": "4. Regional Institutes of Education (RIEs) are located at",
      "topics": [],
      "start_page": 2,
      "end_page": 2,
      "content": "Ajmer, Bhopal, Bhubaneswar and Mysore. The RIEs \ncater to the needs of school education and teacher \neducation (pre-service and in-service education) \nincluding those teachers educators in the States and \nUTs under their respective jurisdictions. Besides \nthese, yet another regional institute, known as North-\nEastern Regional Institute of Education (NERIE) is \nlocated at Shillong."
    },
    {
      "id": "84400963-901d-49d2-8c8a-1b9796f48328",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 5,
      "title": "5. NCERT: Role in Health and Physical Education NCERT",
      "topics": [],
      "start_page": 2,
      "end_page": 6,
      "content": "as an apex body includes functioning of Health and \nPhysical Education like all other subject areas. The \nNational Curriculum Framework (NCF-2005) prepared \nby NCERT considers health and physical education a \ncompulsory subject from Class I to X and optional \nsubject at Classes XI and XII. As a follow up of NCF-\n2005, NCERT has prepared syllabus on health and \nphysical education which has been approved by the \nNational Steering Committee set by the Government \nof India. Health and Physical Education components \nhave also been included in the pre-service training \ncourses running at each RIE’s. It contributes to \nthe policy formulation process of the Central and \nState governments related to Health and Physical \nEducation.\nCBSE\nCentral Board of Secondary Education (CBSE) is the first \nboard of education that was set up in 1921 under jurisdiction \nof Rajputana, Central India and Gwalior. Government of \nIndia decided to set up a Joint Board in 1929 and it was \nnamed as the ‘Board of High School and Intermediate \nEducation. Later in 1952, the constitution of the Board was \namended and it was named as ‘Central Board of Secondary \nEducation’. In 1962 the Board was reconstituted once again \nwith the objectives: (i) to serve the educational institutions \nChap-13.indd   216 8/24/2020   12:27:35 PM\n2024-25\n\n--- Page 3 ---\nAgencies And AwArd Promoting HeAltH, sPorts And YogA\n217\nmore effectively (ii) to be responsive to the educational \nneeds of those students whose parents were employed in \nthe Central Government and had frequently transferable \njobs. The major functions of the CBSE have been to develop \ncurriculum for all the subjects at the secondary and higher \nsecondary levels, to conduct evaluation and examination \nactivities, to organise teacher training workshops, to develop \nresource materials for teachers and students, to publish \nsome text books for secondary and senior secondary classes \nand to monitor various academic projects. The CBSE has \nbeen preparing syllabi on Health and Physical Education, \nconducting competitive sport activities for schools affiliated \nto it and promoting the transaction of Health and Physical \nEducation at secondary and higher secondary levels. It has \nalso been ensuring that the Comprehensive and Continuous \nEvaluation (CCE) is focused on health and physical education \nactivities. \nSchool education agencies in states\nWe have found that there are government agencies at the \nstate level for preparing curriculam, training teachers and \nother functionaries and evaluating the performance of \nstudents. There is a State Council of Educational Research \nand Training (SCERT) in almost all the major States. This \ninstitution is responsible for preparation of syllabi and \ntextbooks for all the classes at primary and upper primary \nstages. In some of the States and Union Territories, the State \nInstitutes of Education (SIE) or the Directorates of Education \nperform these roles. All these institutions at the state level \nperform these roles for the subject area of Health and Physical \nEducation also. Then there are State Boards of Education, \nthat are responsible for preparation of Syllabi and textbooks \nand evaluation of students of all classes at secondary and \nhigher secondary stages. These institutions also conduct \nin-service teacher training for all the subjects including the \nsubject of Health and Physical Education. Under SCERTs \nthere are District Institutes of Education and Training (DIETs) \nthat are responsible for pre-service teacher education at the \nelementary stage (primary and upper primary stages).\nSAI \nSport Authority of India (SAI) was set up by the Government of \nIndia in 1984, aimed to promote sport in India and developing \nexcellence by upgrading the skills of the Indian sport persons. \nSome of the prestigious institutes run by the SAI are:  \n(i) Netaji Subhash National Institute of Sport, (Chandigarh, \nSonipat, Lucknow, Guwahati, Imphal, Bangaluru, Madurai, \nKolkata, Patiala and Gandhinagar), and (ii) Laxmibai National \nCollege of Physical Education (Thiruvananthapuram). \nActivity 13.3\nEducation is a concurrent \nsubject of the state \ngovernment.\nActivity 13.4\nWhere is the head office of \nSAI.\nChap-13.indd   217 8/24/2020   12:27:35 PM\n2024-25\n\n--- Page 4 ---\nHealtH and PHysical education - class X\n218\nThe main objective to establish SAI was to upgrade the skills \nof the budding sport talents in India. In order to attain this \nobjective 23 training centers spread over the entire\n country \nare functioning. \nThrough various schemes formulated for sub-junior, \njunior and senior levels, it ensures that the enthusiasm \nfor sport is widened among different age groups of people. \nSAI has also provided competitive exposures to the talented \nsportpersons. Some of the SAI schemes formulated for the \npromotion of sport in India include National Sport Talent \nContest. The Sport Projects Development Area and the Sport \nHostel Scheme. Besides, the Army Boys Sport Company \n(ABSC) in association with the Indian Army authorities is also \nrun by SAI. SAI provides facilities like sport equipment for \nthe trainees, kit, stipend as well as coaches. Currently, there \nare eight ABSCs all over India. Another scheme proposed by \nSAI is called SAI Training Centers (STC). This Scheme has \nbeen successful to a great extent, in fulfilling SAI’s objective \nof spotting and nurturing sport talents. Another ambicious \nschemes run by SAI are - Special Area Games (SAG), and \nCentre of excellence (COX), producing high level National/\nInternational sport.\nNSNIS\nAfter independence, on May 7, 1961 the National Institute \nof Sport (NIS) was set up by the Government of India for \nthe development of sport at the Motibagh Palace of the then \nMaharaja of Patiala. With the objective of developing sport \nin the country on scientific lines and to train the coaches \nin different sport disciplines. On January 23, 1973, it was \nrenamed as Netaji Subhas National Institute of Sport (NSNIS). \nPresently, NSNIS Patiala is Asia’s one of the best Sport \nInstitute and is popularly known as the “Mecca” of Indian \nSport. It has produced coaches of high caliber and significantly \ncontributed in rendering their expertise and assistance in the \npreparation of the national teams for various International \ncompetitions. The Institute is producing high caliber coaches \nin sport disciplines through its Diploma in Sport Coaching \nand Master Course in Sport Coaching. The Institute is \npresently conducting 6 courses pertaining to sport. (i) Master \nDegree in Sport Coaching (ii) Post Graduate Diploma in Sport \nMedicine (iii) Diploma Course in Sport Coaching (iv) Diploma \nCourse in Sport Coaching (for candidates from North-East \nRegion and Andaman and Nicobar) (v) Refresher Course and \n(vi)Certificate Course in Sport Coaching. (www.nsnis.org)\nOther Government Institutions promoting health, physical \neducation, sport and Yoga are Laxmibai National Institute \nof Physical Education, Gwalior, Indira Gandhi Institute of \nphysical education and Sport Science (University Delhi) New \nChap-13.indd   218 8/24/2020   12:27:35 PM\n2024-25\n\n--- Page 5 ---\nAgencies And AwArd Promoting HeAltH, sPorts And YogA\n219\nDelhi, Government College of Physical Education, Patiala etc. \nBesides these there are many other colleges, Faculties and \nDepartments of Physical Education and Sport under various \nstate and central Universities, which promotes sport, games \nand physical education. Further, a detailed information on \nvarious institutions conducting Bachelor’s Degree, Post- \ngraduate Degree, Master of Philosophy in Physical Education \nand Doctorate degree programs could be obtained from their \nrespective websites.\nSport schools\nAnother important agency is Motilal Nehru School of Sport, RAI \nwhich was founded in July 1973 by the Government of Haryana \nto provide excellent educational facilities with extra emphasis \non sport to deserving students. It is a fully residential and co-\neducation school. Besides this there are other sport schools \nsuch as: G.V.Raja Sport School, Trivandrum; Maharana \nPratap Sport College, Dehradun, Sport College, Lucknow, \nSport School Jalandhar etc. that cater to the development of \nsport in the school education sector. There are also provisions \nfor sport scholarships and sport hostels which prospective \nstudents can avail. The information can be obtained from \nconcerned institutions or through internet. \nYoga institutions \nThere are a number of institutions devoted to promotion of \nyoga, providing everything from in depth courses to flexible \ndrop-in classes. As the style of yoga and approach to teaching \nvaries at each center, it is important to give proper thought \nto your needs before approaching the Institute. Some of the \nInstitutes that offer yoga education are as follows:"
    },
    {
      "id": "0a582477-5a1e-47cc-ba3b-2228c41b87f6",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 10,
      "title": "5. Kaivalyadham Shriram Mahadevji Yoga Samiti,",
      "topics": [],
      "start_page": 6,
      "end_page": 6,
      "content": "Lonavala, Pune"
    },
    {
      "id": "66cb69ea-4339-493d-81ff-527dc96beece",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 12,
      "title": "7.  Swami Vivekananda Yoga Anusandhan Samsthana",
      "topics": [],
      "start_page": 6,
      "end_page": 6,
      "content": "(SVYASA), Bengaluru"
    },
    {
      "id": "79b80390-8acd-491c-b9f5-33fe6c4bbd16",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 15,
      "title": "10. Uttarakhand University of Sanskrit and Yogic",
      "topics": [],
      "start_page": 6,
      "end_page": 6,
      "content": "Sciences, Haridwar\nAdditional information about above Yoga institutions \ncould be obtained from their respective websites.\nChap-13.indd   219 8/24/2020   12:27:35 PM\n2024-25\n\n--- Page 6 ---\nHealtH and PHysical education - class X\n220\nAwArds in sport\nSport awards in India are presented by the Government of \nIndia to honour the players who have performed very well in \ntheir field of sport. It is bestowed to various sport personalities \nin different fields for their accomplishments and outstanding \nperformances and to enhance the enthusiasm of players and \nrecognise their skills and achievements. All the 7 awards are \ngiven to the proud recipient on National Sport Day every year \ni.e. 29 August to mark and celebrate the birthday of hockey \nMaestro Major Dhyanchand. These awards include the  \nTrophy Rajiv Gandhi Khel Ratna Award, Arjuna Award, the \nMaulana Abul Kalam Azad (MAKA) Award, the, the \nDronacharya Awards and the Dhyan Chand Award. Very \nrecently the sport category also has been added in the list of \nareas for which Bharat Ratna is conferred.\nRajiv Gandhi Khel Ratna Award\nThe Rajiv Gandhi Khel Ratna award \nwas instituted in the year 1991-"
    },
    {
      "id": "5f7e37b9-ae3a-4a21-a666-cb4591ee7e59",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 16,
      "title": "92. It is India’s highest honour",
      "topics": [],
      "start_page": 6,
      "end_page": 9,
      "content": "given for achievement in sport.  \nThe words “Khel Ratna” literally mean \n“Sport Gem” in Hindi. The award is \nnamed after the late Rajiv Gandhi, \nformer Prime Minister of India. It \ncarries a medal, a scroll of honour \nand a cash component of ` 7,50,000. \nThe Khel Ratna was devised to be an \noverarching honour, conferred for \noutstanding sporting performance, \nwhether by an individual or a team, \nacross all sporting disciplines in a \ngiven year. \nDronacharya Award\nDronacharya Award was instituted in \n1985 to honour eminent coaches who have \ndone ‘outstanding and meritorious’ work \nconsistently with a singularity of purpose for \nraising the standards of sportpersons to highest \nperformance in National and International \nevents. As the best sportperson award is \nnamed Arjuna Award, it is appropriate that the \ncoaching award is named after Dronacharya, \nas he was the Guru of Arjuna. The award \ncomprises a plaque (bronze statuette of \nDronacharya), a scroll of honour and a cash \nprize of ` 5,00,000 (Rupees five lakh).\nFig. 13.1: Rajiv Gandhi \nKhel Ratna\nFig. 13.2: Dronacharya \naward\nActivity 13.5\nGather information \nregarding\n the benefits \nyou can get from different \ninstitutions/agencies \nworking in the areas of \ngames and sport, health \nand physical education \nand sport training from \ndifferent sources, such as \nby discussing with your \nteachers, sport teachers, \nand relevant publications \nor through internet. \nIdentify the types of help \nyou can get from each one \nof them to promote your \nabilities in games and \nsport.\nChap-13.indd   220 8/24/2020   12:27:36 PM\n2024-25\n\n--- Page 7 ---\nAgencies And AwArd Promoting HeAltH, sPorts And YogA\n221\nArjuna Award \nThe Arjuna Award was instituted in 1961 by the Government \nof India to recognise outstanding achievement in games \nand sport. The award carries a cash prize of ` 500,000 a \nbronze statuette of Arjuna and a scroll. Over the years the \nscope of the award has been expanded and a large number \nof sportpersons who belonged to the pre-Arjuna Award \nera were also included in the list. Further, the number of \ndisciplines for which the award is given was increased to \ninclude indigenous games and the differently abled category.\nThe Government has recently revised the scheme for the \nArjuna Award. According to the revised guidelines, to be \neligible for the Award, a sportperson should not only have \nhad good performance consistently for the previous three \nyears at the international level with excellence for the year \nfor which the Award is recommended, but should also have \nshown qualities of leadership, sportpersonship and a sense \nof discipline.\nFrom the year 2001, the award is given only in disciplines \nfalling under the following categories:\n • Olympic Games/Asian Games/Commonwealth Games /\nWorld Cup/World Championship Disciplines and Cricket\n • Indigenous Games\n • Sport for the Physically Challenged\nDhyan Chand Award\nThe Dhyan Chand Award is a Life Time Achievement given to \nthe veteran sportpersons of India for their achievements in \ntheir respective fields of sport. It is named after Dhyan Chand \nthe legendary Indian hockey player. This is a new award \ninstituted by the Government of India in the year 2002. The \naward carries a cash prize of ` 5,00,000/- (Rupees five lakh), \na statuette and scroll of honour. The main objective of the \naward is to bestow honour on those sportpersons who have \ncontributed a lot to their respective sport by their performance \nand who still continue to contribute to the promotion of sport \nafter their retirement from the active sporting career.\nMaulana Abul Kalam Azad (MAKA) Trophy \nGovernment instituted MAKA Trophy in 1956-57 as a tool \nfor promo\nting the competitive sport amongst colleges and \nUniversities.  The top overall performing University in the Inter-\nUniversity tournaments in India is given the MAKA Trophy, \nwhich is a rolling trophy along with cash prize. The cash prize \nhas also been recently enhanced to Rs.10 lakh, Rs. 5 lakh and \nRs.3 lakh for the Universities securing first, second and third \nposition respectively in Inter-University tournaments. \nFig. 13.3: Arjuna award\nFig. 13.4: Dhyan Chand \naward\nFig. 13.5: Maka trophy\nChap-13.indd   221 8/24/2020   12:27:36 PM\n2024-25\n\n--- Page 8 ---\nHealtH and PHysical education - class X\n222\nRashtriya Khel Protsahan Puraskar\nThe RKPP award was instituted in 2009 by the Govt. of \nIndia to recognise the contribution in sport by entities other \nthan sport persons and coaches. The objective of the award \nis to encourage and promote corporate involvement in the \npromotion and development of sport. The award carries a \ncitation and a trophy in each categories, like "
    },
    {
      "id": "1da57cbb-6c76-4190-bcb2-975d52fb0799",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 17,
      "title": "1. The community sport identification and nurturing of",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "budding young talent"
    },
    {
      "id": "568bae89-9269-481c-a30b-9e8123250919",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 19,
      "title": "3. Establishment and management of sport academics",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "of excellence."
    },
    {
      "id": "fc1620f5-b27b-45ff-8965-2a7cce613bd7",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 20,
      "title": "4. Employment of sport persons and sport welfare",
      "topics": [],
      "start_page": 9,
      "end_page": 10,
      "content": "measure.\nTenzing Norgay National Adventure Award\nThe TNNAA was instituted in 1993 by the Govt. of India. It \nis named after Tenzing Norgay, who is one of the first two \nindividual to reach the summit of Mount Everest in 1953 \nalong with Sir Edmund Percival Hillary. The award is given \nto individual for Excelling Adventure Activities on land, Sea \nand Air. It carries a statuette, Certificate and a cash prize of \n5 Lakhs.\nOther sports awards in India\nApart from the awards that have been discussed so far, \nthere are some other special awards that are given by the \nGovernment of India to the medal winners in the international \nsport events. Some State governments also confer these \nawards. Generally, the Governments give away some cash \nawards for winning medals or cups in the international \nchampionships, Olympic Games, the World cup or World \nChampionships, the Asian and Commonwealth Games \nor Championships. The players who become victorious in \nthe game of Chess and Billiards or Snooker as well as the \njunior sportpersons who win medals in the World, Asian \nand Commonwealth Championships, are also given these \nawards.\nFig. 13.7: TNNA Award\nFig. 13.6: Rashtriya \nKhel Protsahan \nPuraskar\nDo You Know?\nTenzing Norgay was the \nfirst person from India to \nclimb Mount Everest in \n29, May 1953.\nActivity 13.5\nGather information of \nthe current year’s award \nwinners in the field of \nGames.\nChap-13.indd   222 8/24/2020   12:27:37 PM\n2024-25\n\n--- Page 9 ---\nAgencies And AwArd Promoting HeAltH, sPorts And YogA\n223\nAssessment\n I. Answer the following Questions"
    },
    {
      "id": "cd554411-669c-491f-bdf2-90f225e6c56e",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 21,
      "title": "1. Explain the role of agencies at the national level that work for",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "Health and Physical Education in schools."
    },
    {
      "id": "016e9502-9c95-4385-bdec-8f8f847b9c01",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 22,
      "title": "2. Which are the State level government agencies responsible for",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "Health and Physical Education in schools? What roles do they \nplay for the promotion of this subject area?"
    },
    {
      "id": "a902ca99-5393-4e20-91c2-c411d683e1e4",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 23,
      "title": "3. Write brief Notes on the following:",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "  a) Sports Authority of India (SAI), \n  b) Netaji Subhas National Institute of Sports (NSNIS), \n  c) Sports Schools\n  d) Yoga Institutions"
    },
    {
      "id": "0e82e89f-d157-4013-9b7b-01b07ff0caaf",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 24,
      "title": "4. Which are the national awards that are given to sportpersons in",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "India? What are the criteria for conferring those awards?"
    },
    {
      "id": "323b7143-4dcc-4cd4-8f50-65aaf7c3486d",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 25,
      "title": "5. What awards are given to coaches and senior and retired sport",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "persons? What are the bases of giving those awards?"
    },
    {
      "id": "2d399a1b-f947-4206-90e3-1504570b5a7a",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 26,
      "title": "6. Identify those educational and sport agencies that can help you",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "in promoting your abilities and skills in games and sport and \nexplain what kinds of contributions they can make."
    },
    {
      "id": "4e8d8bdf-bfb6-4c4c-a62d-e191d051ceb8",
      "textbook_id": "e4d2eb63-4faa-44a6-9991-16397eec21ce",
      "chapter_number": 27,
      "title": "7. Write the full forms of MAKA, RGKR, TNNAA.",
      "topics": [],
      "start_page": 10,
      "end_page": 11,
      "content": " II. Reference\n  cbse.nic.in \n  mnssrai.com \n  ncert.nic.in\n  performerawards.com\n  sportauthorityofindia.nic.in\n  sportforschools.com\n  www.nsnis.org\nChap-13.indd   223 8/24/2020   12:27:37 PM\n2024-25\n\n--- Page 10 ---\nMinistry of Health & Family Welfare\nGovenment of India\nnovel coronAvirus (covid-19)\nschool Advisory\n • Schools are advised to avoid any large gathering of students during \nthe course of the day in the school.\n • Any student/staff with travel history to any COVID-19 affected \ncountry or in contect with such persons i n last 28 days, should be \nmonitored and home quarantined for 14 days.\n • Class teachers should be alert to any child with signs and symptoms \ni.e. fever, cough and difficulty in breathing, and should immediately \ninform the parents to have the child tested.\n • Ask parents not to send child back to school till advised so by the \ntreating doctor.\n • Teachers, school staff and students should also be advised about \nsimple public health measures of hand and respiratory hygiene.\n Hand hygiene\n ○ Wash hands frequently and thoroughly with soap & water or use \nalcohol based hand sanitizer, even when hands are visibly clean.\n Respiratory hygiene\n ○ Everyone should cover their mouth with a tissue/handkerchief \n(or their sleeve if there are no tissues available) when they cough or \nsneeze and wash their hands afterwards.\n ○ Do not touch your eyes, nose and mouth.\n ○ Everyone should throw away used tissues in a bin and wash their \nhands after contect with coughing/sneezing.\n • Frequently touched surfaces - door knobs, switches, desk tops, hand \nrailing etc. should be disinfected.\n • Provide alcohol based hand cleaners/sanitizers in frequented spots \nof the school.\n • Ensure availability of soap and water in rest rooms at all times.\n • Foot operated pedal bins lines with plastic bag should be provided \nin each classroom & rest room.\n • In hostels, health status of students as well as the other ancillary staff, \nshould be monitored on regular basis. In case there are suspected cases, \nthe authorised local medical authority should be called for examination.\n • Anybody with signs & symptoms (cough, fever or difficulty in \nbreathing) should call state/UT helpline number or Ministry of Health \n& Family Welfare’s 24×7 helpline at 011-23978046 or visit public \nhealth facility with a mask or mouth covered.\nFor Further information: Call at Ministry of Health, Govt. of India’s \n24×7 control room number +91-11-23978046\nEmail at ncov2019@gmail.com\nChap-13.indd   224 8/24/2020   12:27:37 PM\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "bd28d943-3999-47f7-b234-6eaa884ec315",
      "chapter_id": "57139b60-305b-4667-b7d5-7236b2848208",
      "chunk_index": 0,
      "content": "research and development activities related to \npedagogical aspects of curriculum, instructional \nmaterials and supplementary materials. It prepares \nnational curricular policy documents, develops \ndatabase and various types of materials and organises \nin-service training for different target groups.\nAgencies And AwArds \nPromoting HeAltH, \nsPorts And YogA\n13\nActivity 13.1\nWhere is the headquarter \nof NCERT located?\nChap-13.indd   215 8/24/2020   12:27:35 PM\n2024-25\n\n--- Page 2 ---\nHealtH and PHysical education - class X\n216\nDo You Know?\nCBSE has started \ncompetitive sports for all \nprivate schools affiliated \nto CBSE since 1988-89.\nActivity 13.2\nFind out how many \nclusters are taking part is \nCBSE competitive sport.",
      "content_type": "text",
      "token_count": 181,
      "page_number": 2
    },
    {
      "id": "3678bff6-f29c-4680-82f1-ccc242051640",
      "chapter_id": "236466c0-797e-47c8-baa1-ee5e9f39699a",
      "chunk_index": 0,
      "content": "is concerned with development of educational \ntechnology, design and production of media software. \nIt holds programmes to build competencies of media \npersonnel and need-based researches. It evaluates \nactivities undertaken and studies carried out to assess \nthe effectiveness of materials and programmes.",
      "content_type": "text",
      "token_count": 76,
      "page_number": 2
    },
    {
      "id": "b302f226-892e-4ffb-be8a-23433e4bff7a",
      "chapter_id": "9e287927-7332-404a-8f6c-202381b24aac",
      "chunk_index": 0,
      "content": "Vocational Education (PSSCIVE) is located at Bhopal \nand organises research, development, training and \nextension programmes related to Work education and \nVocational education.",
      "content_type": "text",
      "token_count": 44,
      "page_number": 2
    },
    {
      "id": "d01e26d2-e43e-4898-8aee-9d0968c317f2",
      "chapter_id": "365178d0-883b-485d-af22-1318e4d2a32d",
      "chunk_index": 0,
      "content": "Ajmer, Bhopal, Bhubaneswar and Mysore. The RIEs \ncater to the needs of school education and teacher \neducation (pre-service and in-service education) \nincluding those teachers educators in the States and \nUTs under their respective jurisdictions. Besides \nthese, yet another regional institute, known as North-\nEastern Regional Institute of Education (NERIE) is \nlocated at Shillong.",
      "content_type": "text",
      "token_count": 95,
      "page_number": 2
    },
    {
      "id": "00dbb9d6-51ce-4b8c-829a-5e87c5d200e3",
      "chapter_id": "84400963-901d-49d2-8c8a-1b9796f48328",
      "chunk_index": 0,
      "content": "as an apex body includes functioning of Health and \nPhysical Education like all other subject areas. The \nNational Curriculum Framework (NCF-2005) prepared \nby NCERT considers health and physical education a \ncompulsory subject from Class I to X and optional \nsubject at Classes XI and XII. As a follow up of NCF-\n2005, NCERT has prepared syllabus on health and \nphysical education which has been approved by the \nNational Steering Committee set by the Government \nof India. Health and Physical Education components \nhave also been included in the pre-service training \ncourses running at each RIE’s. It contributes to \nthe policy formulation process of the Central and \nState governments related to Health and Physical \nEducation.\nCBSE\nCentral Board of Secondary Education (CBSE) is the first \nboard of education that was set up in 1921 under jurisdiction \nof Rajputana, Central India and Gwalior. Government of \nIndia decided to set up a Joint Board in 1929 and it was \nnamed as the ‘Board of High School and Intermediate \nEducation. Later in 1952, the constitution of the Board was \namended and it was named as ‘Central Board of Secondary \nEducation’. In 1962 the Board was reconstituted once again \nwith the objectives: (i) to serve the educational institutions \nChap-13.indd   216 8/24/2020   12:27:35 PM\n2024-25",
      "content_type": "text",
      "token_count": 329,
      "page_number": 2
    },
    {
      "id": "447a94e1-4dd2-4cae-8dc8-8f897f7e702a",
      "chapter_id": "84400963-901d-49d2-8c8a-1b9796f48328",
      "chunk_index": 1,
      "content": "--- Page 3 ---\nAgencies And AwArd Promoting HeAltH, sPorts And YogA\n217\nmore effectively (ii) to be responsive to the educational \nneeds of those students whose parents were employed in \nthe Central Government and had frequently transferable \njobs. The major functions of the CBSE have been to develop \ncurriculum for all the subjects at the secondary and higher \nsecondary levels, to conduct evaluation and examination \nactivities, to organise teacher training workshops, to develop \nresource materials for teachers and students, to publish \nsome text books for secondary and senior secondary classes \nand to monitor various academic projects. The CBSE has \nbeen preparing syllabi on Health and Physical Education, \nconducting competitive sport activities for schools affiliated \nto it and promoting the transaction of Health and Physical \nEducation at secondary and higher secondary levels. It has \nalso been ensuring that the Comprehensive and Continuous \nEvaluation (CCE) is focused on health and physical education \nactivities. \nSchool education agencies in states\nWe have found that there are government agencies at the \nstate level for preparing curriculam, training teachers and \nother functionaries and evaluating the performance of \nstudents. There is a State Council of Educational Research \nand Training (SCERT) in almost all the major States. This \ninstitution is responsible for preparation of syllabi and \ntextbooks for all the classes at primary and upper primary \nstages. In some of the States and Union Territories, the State \nInstitutes of Education (SIE) or the Directorates of Education \nperform these roles. All these institutions at the state level \nperform these roles for the subject area of Health and Physical \nEducation also. Then there are State Boards of Education, \nthat are responsible for preparation of Syllabi and textbooks \nand evaluation of students of all classes at secondary and \nhigher secondary stages. These institutions also conduct \nin-service teacher training for all the subjects including the \nsubject of Health and Physical Education. Under SCERTs \nthere are District Institutes of Education and Training (DIETs) \nthat are responsible for pre-service teacher education at the \nelementary stage (primary and upper primary stages).\nSAI \nSport Authority of India (SAI) was set up by the Government of \nIndia in 1984, aimed to promote sport in India and developing \nexcellence by upgrading the skills of the Indian sport persons. \nSome of the prestigious institutes run by the SAI are:  \n(i) Netaji Subhash National Institute of Sport, (Chandigarh, \nSonipat, Lucknow, Guwahati, Imphal, Bangaluru, Madurai, \nKolkata, Patiala and Gandhinagar), and (ii) Laxmibai National \nCollege of Physical Education (Thiruvananthapuram). \nActivity 13.3\nEducation is a concurrent \nsubject of the state \ngovernment.\nActivity 13.4\nWhere is the head office of \nSAI.\nChap-13.indd   217 8/24/2020   12:27:35 PM\n2024-25",
      "content_type": "text",
      "token_count": 735,
      "page_number": 2
    },
    {
      "id": "d891ebef-8863-4649-80e2-be51fd6da92b",
      "chapter_id": "84400963-901d-49d2-8c8a-1b9796f48328",
      "chunk_index": 2,
      "content": "--- Page 4 ---\nHealtH and PHysical education - class X\n218\nThe main objective to establish SAI was to upgrade the skills \nof the budding sport talents in India. In order to attain this \nobjective 23 training centers spread over the entire\n country \nare functioning. \nThrough various schemes formulated for sub-junior, \njunior and senior levels, it ensures that the enthusiasm \nfor sport is widened among different age groups of people. \nSAI has also provided competitive exposures to the talented \nsportpersons. Some of the SAI schemes formulated for the \npromotion of sport in India include National Sport Talent \nContest. The Sport Projects Development Area and the Sport \nHostel Scheme. Besides, the Army Boys Sport Company \n(ABSC) in association with the Indian Army authorities is also \nrun by SAI. SAI provides facilities like sport equipment for \nthe trainees, kit, stipend as well as coaches. Currently, there \nare eight ABSCs all over India. Another scheme proposed by \nSAI is called SAI Training Centers (STC). This Scheme has \nbeen successful to a great extent, in fulfilling SAI’s objective \nof spotting and nurturing sport talents. Another ambicious \nschemes run by SAI are - Special Area Games (SAG), and \nCentre of excellence (COX), producing high level National/\nInternational sport.\nNSNIS\nAfter independence, on May 7, 1961 the National Institute \nof Sport (NIS) was set up by the Government of India for \nthe development of sport at the Motibagh Palace of the then \nMaharaja of Patiala. With the objective of developing sport \nin the country on scientific lines and to train the coaches \nin different sport disciplines. On January 23, 1973, it was \nrenamed as Netaji Subhas National Institute of Sport (NSNIS). \nPresently, NSNIS Patiala is Asia’s one of the best Sport \nInstitute and is popularly known as the “Mecca” of Indian \nSport. It has produced coaches of high caliber and significantly \ncontributed in rendering their expertise and assistance in the \npreparation of the national teams for various International \ncompetitions. The Institute is producing high caliber coaches \nin sport disciplines through its Diploma in Sport Coaching \nand Master Course in Sport Coaching. The Institute is \npresently conducting 6 courses pertaining to sport. (i) Master \nDegree in Sport Coaching (ii) Post Graduate Diploma in Sport \nMedicine (iii) Diploma Course in Sport Coaching (iv) Diploma \nCourse in Sport Coaching (for candidates from North-East \nRegion and Andaman and Nicobar) (v) Refresher Course and \n(vi)Certificate Course in Sport Coaching. (www.nsnis.org)\nOther Government Institutions promoting health, physical \neducation, sport and Yoga are Laxmibai National Institute \nof Physical Education, Gwalior, Indira Gandhi Institute of \nphysical education and Sport Science (University Delhi) New \nChap-13.indd   218 8/24/2020   12:27:35 PM\n2024-25",
      "content_type": "text",
      "token_count": 716,
      "page_number": 2
    },
    {
      "id": "47bf0148-44cc-4335-8b62-9cc91c5bae37",
      "chapter_id": "84400963-901d-49d2-8c8a-1b9796f48328",
      "chunk_index": 3,
      "content": "--- Page 5 ---\nAgencies And AwArd Promoting HeAltH, sPorts And YogA\n219\nDelhi, Government College of Physical Education, Patiala etc. \nBesides these there are many other colleges, Faculties and \nDepartments of Physical Education and Sport under various \nstate and central Universities, which promotes sport, games \nand physical education. Further, a detailed information on \nvarious institutions conducting Bachelor’s Degree, Post- \ngraduate Degree, Master of Philosophy in Physical Education \nand Doctorate degree programs could be obtained from their \nrespective websites.\nSport schools\nAnother important agency is Motilal Nehru School of Sport, RAI \nwhich was founded in July 1973 by the Government of Haryana \nto provide excellent educational facilities with extra emphasis \non sport to deserving students. It is a fully residential and co-\neducation school. Besides this there are other sport schools \nsuch as: G.V.Raja Sport School, Trivandrum; Maharana \nPratap Sport College, Dehradun, Sport College, Lucknow, \nSport School Jalandhar etc. that cater to the development of \nsport in the school education sector. There are also provisions \nfor sport scholarships and sport hostels which prospective \nstudents can avail. The information can be obtained from \nconcerned institutions or through internet. \nYoga institutions \nThere are a number of institutions devoted to promotion of \nyoga, providing everything from in depth courses to flexible \ndrop-in classes. As the style of yoga and approach to teaching \nvaries at each center, it is important to give proper thought \nto your needs before approaching the Institute. Some of the \nInstitutes that offer yoga education are as follows:",
      "content_type": "text",
      "token_count": 422,
      "page_number": 6
    },
    {
      "id": "4fd0a4c8-0c29-4a93-bfa0-accfacb3229e",
      "chapter_id": "0a582477-5a1e-47cc-ba3b-2228c41b87f6",
      "chunk_index": 0,
      "content": "Lonavala, Pune",
      "content_type": "text",
      "token_count": 3,
      "page_number": 6
    },
    {
      "id": "96d77076-b48d-4fb2-9d2b-f032988a8008",
      "chapter_id": "66cb69ea-4339-493d-81ff-527dc96beece",
      "chunk_index": 0,
      "content": "(SVYASA), Bengaluru",
      "content_type": "text",
      "token_count": 4,
      "page_number": 6
    },
    {
      "id": "bf326368-4044-479a-8e55-0670acd6cbae",
      "chapter_id": "79b80390-8acd-491c-b9f5-33fe6c4bbd16",
      "chunk_index": 0,
      "content": "Sciences, Haridwar\nAdditional information about above Yoga institutions \ncould be obtained from their respective websites.\nChap-13.indd   219 8/24/2020   12:27:35 PM\n2024-25\n\n--- Page 6 ---\nHealtH and PHysical education - class X\n220\nAwArds in sport\nSport awards in India are presented by the Government of \nIndia to honour the players who have performed very well in \ntheir field of sport. It is bestowed to various sport personalities \nin different fields for their accomplishments and outstanding \nperformances and to enhance the enthusiasm of players and \nrecognise their skills and achievements. All the 7 awards are \ngiven to the proud recipient on National Sport Day every year \ni.e. 29 August to mark and celebrate the birthday of hockey \nMaestro Major Dhyanchand. These awards include the  \nTrophy Rajiv Gandhi Khel Ratna Award, Arjuna Award, the \nMaulana Abul Kalam Azad (MAKA) Award, the, the \nDronacharya Awards and the Dhyan Chand Award. Very \nrecently the sport category also has been added in the list of \nareas for which Bharat Ratna is conferred.\nRajiv Gandhi Khel Ratna Award\nThe Rajiv Gandhi Khel Ratna award \nwas instituted in the year 1991-",
      "content_type": "text",
      "token_count": 290,
      "page_number": 6
    },
    {
      "id": "71752d0a-024f-4b73-b535-87207b7594b4",
      "chapter_id": "5f7e37b9-ae3a-4a21-a666-cb4591ee7e59",
      "chunk_index": 0,
      "content": "given for achievement in sport.  \nThe words “Khel Ratna” literally mean \n“Sport Gem” in Hindi. The award is \nnamed after the late Rajiv Gandhi, \nformer Prime Minister of India. It \ncarries a medal, a scroll of honour \nand a cash component of ` 7,50,000. \nThe Khel Ratna was devised to be an \noverarching honour, conferred for \noutstanding sporting performance, \nwhether by an individual or a team, \nacross all sporting disciplines in a \ngiven year. \nDronacharya Award\nDronacharya Award was instituted in \n1985 to honour eminent coaches who have \ndone ‘outstanding and meritorious’ work \nconsistently with a singularity of purpose for \nraising the standards of sportpersons to highest \nperformance in National and International \nevents. As the best sportperson award is \nnamed Arjuna Award, it is appropriate that the \ncoaching award is named after Dronacharya, \nas he was the Guru of Arjuna. The award \ncomprises a plaque (bronze statuette of \nDronacharya), a scroll of honour and a cash \nprize of ` 5,00,000 (Rupees five lakh).\nFig. 13.1: Rajiv Gandhi \nKhel Ratna\nFig. 13.2: Dronacharya \naward\nActivity 13.5\nGather information \nregarding\n the benefits \nyou can get from different \ninstitutions/agencies \nworking in the areas of \ngames and sport, health \nand physical education \nand sport training from \ndifferent sources, such as \nby discussing with your \nteachers, sport teachers, \nand relevant publications \nor through internet. \nIdentify the types of help \nyou can get from each one \nof them to promote your \nabilities in games and \nsport.\nChap-13.indd   220 8/24/2020   12:27:36 PM\n2024-25",
      "content_type": "text",
      "token_count": 398,
      "page_number": 6
    },
    {
      "id": "8477adfd-2868-4e8e-ab1a-8901c932be89",
      "chapter_id": "5f7e37b9-ae3a-4a21-a666-cb4591ee7e59",
      "chunk_index": 1,
      "content": "--- Page 7 ---\nAgencies And AwArd Promoting HeAltH, sPorts And YogA\n221\nArjuna Award \nThe Arjuna Award was instituted in 1961 by the Government \nof India to recognise outstanding achievement in games \nand sport. The award carries a cash prize of ` 500,000 a \nbronze statuette of Arjuna and a scroll. Over the years the \nscope of the award has been expanded and a large number \nof sportpersons who belonged to the pre-Arjuna Award \nera were also included in the list. Further, the number of \ndisciplines for which the award is given was increased to \ninclude indigenous games and the differently abled category.\nThe Government has recently revised the scheme for the \nArjuna Award. According to the revised guidelines, to be \neligible for the Award, a sportperson should not only have \nhad good performance consistently for the previous three \nyears at the international level with excellence for the year \nfor which the Award is recommended, but should also have \nshown qualities of leadership, sportpersonship and a sense \nof discipline.\nFrom the year 2001, the award is given only in disciplines \nfalling under the following categories:\n • Olympic Games/Asian Games/Commonwealth Games /\nWorld Cup/World Championship Disciplines and Cricket\n • Indigenous Games\n • Sport for the Physically Challenged\nDhyan Chand Award\nThe Dhyan Chand Award is a Life Time Achievement given to \nthe veteran sportpersons of India for their achievements in \ntheir respective fields of sport. It is named after Dhyan Chand \nthe legendary Indian hockey player. This is a new award \ninstituted by the Government of India in the year 2002. The \naward carries a cash prize of ` 5,00,000/- (Rupees five lakh), \na statuette and scroll of honour. The main objective of the \naward is to bestow honour on those sportpersons who have \ncontributed a lot to their respective sport by their performance \nand who still continue to contribute to the promotion of sport \nafter their retirement from the active sporting career.\nMaulana Abul Kalam Azad (MAKA) Trophy \nGovernment instituted MAKA Trophy in 1956-57 as a tool \nfor promo\nting the competitive sport amongst colleges and \nUniversities.  The top overall performing University in the Inter-\nUniversity tournaments in India is given the MAKA Trophy, \nwhich is a rolling trophy along with cash prize. The cash prize \nhas also been recently enhanced to Rs.10 lakh, Rs. 5 lakh and \nRs.3 lakh for the Universities securing first, second and third \nposition respectively in Inter-University tournaments. \nFig. 13.3: Arjuna award\nFig. 13.4: Dhyan Chand \naward\nFig. 13.5: Maka trophy\nChap-13.indd   221 8/24/2020   12:27:36 PM\n2024-25",
      "content_type": "text",
      "token_count": 661,
      "page_number": 6
    },
    {
      "id": "928c7ce7-6b2b-43b4-b60b-4437dccfd34b",
      "chapter_id": "5f7e37b9-ae3a-4a21-a666-cb4591ee7e59",
      "chunk_index": 2,
      "content": "--- Page 8 ---\nHealtH and PHysical education - class X\n222\nRashtriya Khel Protsahan Puraskar\nThe RKPP award was instituted in 2009 by the Govt. of \nIndia to recognise the contribution in sport by entities other \nthan sport persons and coaches. The objective of the award \nis to encourage and promote corporate involvement in the \npromotion and development of sport. The award carries a \ncitation and a trophy in each categories, like",
      "content_type": "text",
      "token_count": 108,
      "page_number": 9
    },
    {
      "id": "ff133f0c-c461-400e-bf01-a07f290b43d9",
      "chapter_id": "1da57cbb-6c76-4190-bcb2-975d52fb0799",
      "chunk_index": 0,
      "content": "budding young talent",
      "content_type": "text",
      "token_count": 5,
      "page_number": 9
    },
    {
      "id": "5a8129cb-f652-4557-b036-dfdc1e5f6706",
      "chapter_id": "568bae89-9269-481c-a30b-9e8123250919",
      "chunk_index": 0,
      "content": "of excellence.",
      "content_type": "text",
      "token_count": 3,
      "page_number": 9
    },
    {
      "id": "4a64a032-a117-45ec-95d1-b58fc9b854de",
      "chapter_id": "fc1620f5-b27b-45ff-8965-2a7cce613bd7",
      "chunk_index": 0,
      "content": "measure.\nTenzing Norgay National Adventure Award\nThe TNNAA was instituted in 1993 by the Govt. of India. It \nis named after Tenzing Norgay, who is one of the first two \nindividual to reach the summit of Mount Everest in 1953 \nalong with Sir Edmund Percival Hillary. The award is given \nto individual for Excelling Adventure Activities on land, Sea \nand Air. It carries a statuette, Certificate and a cash prize of \n5 Lakhs.\nOther sports awards in India\nApart from the awards that have been discussed so far, \nthere are some other special awards that are given by the \nGovernment of India to the medal winners in the international \nsport events. Some State governments also confer these \nawards. Generally, the Governments give away some cash \nawards for winning medals or cups in the international \nchampionships, Olympic Games, the World cup or World \nChampionships, the Asian and Commonwealth Games \nor Championships. The players who become victorious in \nthe game of Chess and Billiards or Snooker as well as the \njunior sportpersons who win medals in the World, Asian \nand Commonwealth Championships, are also given these \nawards.\nFig. 13.7: TNNA Award\nFig. 13.6: Rashtriya \nKhel Protsahan \nPuraskar\nDo You Know?\nTenzing Norgay was the \nfirst person from India to \nclimb Mount Everest in \n29, May 1953.\nActivity 13.5\nGather information of \nthe current year’s award \nwinners in the field of \nGames.\nChap-13.indd   222 8/24/2020   12:27:37 PM\n2024-25\n\n--- Page 9 ---\nAgencies And AwArd Promoting HeAltH, sPorts And YogA\n223\nAssessment\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 392,
      "page_number": 10
    },
    {
      "id": "a3f2c87f-d95b-4b1c-b1b9-8385269ed600",
      "chapter_id": "cd554411-669c-491f-bdf2-90f225e6c56e",
      "chunk_index": 0,
      "content": "Health and Physical Education in schools.",
      "content_type": "text",
      "token_count": 10,
      "page_number": 10
    },
    {
      "id": "cd183c45-bb9e-4c5e-ad3a-3c1ae956757f",
      "chapter_id": "016e9502-9c95-4385-bdec-8f8f847b9c01",
      "chunk_index": 0,
      "content": "Health and Physical Education in schools? What roles do they \nplay for the promotion of this subject area?",
      "content_type": "text",
      "token_count": 26,
      "page_number": 10
    },
    {
      "id": "dd832c5c-b3e0-4149-a43d-878058c1e20e",
      "chapter_id": "a902ca99-5393-4e20-91c2-c411d683e1e4",
      "chunk_index": 0,
      "content": "a) Sports Authority of India (SAI), \n  b) Netaji Subhas National Institute of Sports (NSNIS), \n  c) Sports Schools\n  d) Yoga Institutions",
      "content_type": "text",
      "token_count": 34,
      "page_number": 10
    },
    {
      "id": "5ce2e145-3928-4c46-a38f-59a3aab5c61c",
      "chapter_id": "0e82e89f-d157-4013-9b7b-01b07ff0caaf",
      "chunk_index": 0,
      "content": "India? What are the criteria for conferring those awards?",
      "content_type": "text",
      "token_count": 14,
      "page_number": 10
    },
    {
      "id": "ac6e74be-09be-4539-a98b-bd06d17f9c5a",
      "chapter_id": "323b7143-4dcc-4cd4-8f50-65aaf7c3486d",
      "chunk_index": 0,
      "content": "persons? What are the bases of giving those awards?",
      "content_type": "text",
      "token_count": 12,
      "page_number": 10
    },
    {
      "id": "f7546463-4b6a-4cca-ba05-ef9625af64b6",
      "chapter_id": "2d399a1b-f947-4206-90e3-1504570b5a7a",
      "chunk_index": 0,
      "content": "in promoting your abilities and skills in games and sport and \nexplain what kinds of contributions they can make.",
      "content_type": "text",
      "token_count": 28,
      "page_number": 10
    },
    {
      "id": "70601faa-fa86-4b99-abae-7ae75d335d7c",
      "chapter_id": "4e8d8bdf-bfb6-4c4c-a62d-e191d051ceb8",
      "chunk_index": 0,
      "content": "II. Reference\n  cbse.nic.in \n  mnssrai.com \n  ncert.nic.in\n  performerawards.com\n  sportauthorityofindia.nic.in\n  sportforschools.com\n  www.nsnis.org\nChap-13.indd   223 8/24/2020   12:27:37 PM\n2024-25\n\n--- Page 10 ---\nMinistry of Health & Family Welfare\nGovenment of India\nnovel coronAvirus (covid-19)\nschool Advisory\n • Schools are advised to avoid any large gathering of students during \nthe course of the day in the school.\n • Any student/staff with travel history to any COVID-19 affected \ncountry or in contect with such persons i n last 28 days, should be \nmonitored and home quarantined for 14 days.\n • Class teachers should be alert to any child with signs and symptoms \ni.e. fever, cough and difficulty in breathing, and should immediately \ninform the parents to have the child tested.\n • Ask parents not to send child back to school till advised so by the \ntreating doctor.\n • Teachers, school staff and students should also be advised about \nsimple public health measures of hand and respiratory hygiene.\n Hand hygiene\n ○ Wash hands frequently and thoroughly with soap & water or use \nalcohol based hand sanitizer, even when hands are visibly clean.\n Respiratory hygiene\n ○ Everyone should cover their mouth with a tissue/handkerchief \n(or their sleeve if there are no tissues available) when they cough or \nsneeze and wash their hands afterwards.\n ○ Do not touch your eyes, nose and mouth.\n ○ Everyone should throw away used tissues in a bin and wash their \nhands after contect with coughing/sneezing.\n • Frequently touched surfaces - door knobs, switches, desk tops, hand \nrailing etc. should be disinfected.\n • Provide alcohol based hand cleaners/sanitizers in frequented spots \nof the school.\n • Ensure availability of soap and water in rest rooms at all times.\n • Foot operated pedal bins lines with plastic bag should be provided \nin each classroom & rest room.\n • In hostels, health status of students as well as the other ancillary staff, \nshould be monitored on regular basis. In case there are suspected cases, \nthe authorised local medical authority should be called for examination.\n • Anybody with signs & symptoms (cough, fever or difficulty in \nbreathing) should call state/UT helpline number or Ministry of Health \n& Family Welfare’s 24×7 helpline at 011-23978046 or visit public \nhealth facility with a mask or mouth covered.\nFor Further information: Call at Ministry of Health, Govt. of India’s \n24×7 control room number +91-11-23978046\nEmail at ncov2019@gmail.com\nChap-13.indd   224 8/24/2020   12:27:37 PM\n2024-25",
      "content_type": "text",
      "token_count": 636,
      "page_number": 11
    }
  ]
}