{
  "textbook": {
    "id": "664a5856-ff25-45de-acbd-09499a7a41c8",
    "file_name": "Class X Science NCERT - Ch 00 - 6CHAPTER.pdf",
    "title": "6CHAPTER",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 13,
    "file_size_mb": 1.6225109100341797,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:10.887249",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 00 - 6CHAPTER.pdf"
  },
  "chapters": [
    {
      "id": "1fc23214-f97a-410d-b3fe-d5136abb3344",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 5,
      "title": "5. What is the role of the brain in reflex action?",
      "topics": [],
      "start_page": 5,
      "end_page": 8,
      "content": "6.2 COORDINA6.2 COORDINA6.2 COORDINA6.2 COORDINA6.2 COORDINA TION IN PLTION IN PLTION IN PLTION IN PLTION IN PL ANTSANTSANTS\nANTSANTS\nAnimals have a nervous system for controlling and coordinating the\nactivities of the body. But plants have neither a nervous system nor\nmuscles. So, how do they respond to stimuli? When we touch the leaves\nof a chhui-mui  (the ‘sensitive’ or ‘touch-me-not’ plant of the Mimosa\nfamily), they begin to fold up and droop. When a seed germinates, the\nroot goes down, the stem comes up into the air. What happens? Firstly,\nthe leaves of the sensitive plant move very quickly in response to touch.\n2024-25\n\n--- Page 7 ---\nScience106\nThere is no growth involved in this movement. On the other hand, the\ndirectional movement of a seedling is caused by growth. If it is prevented\nfrom growing, it will not show any movement. So plants show two different\ntypes of movement – one dependent on growth and the other independent\nof growth.\n6.2.1 Immediate Response to Stimulus\nLet us think about the first kind of movement, such as that of the sensitive\nplant. Since no growth is involved, the plant must actually move its leaves\nin response to touch. But there is no nervous tissue, nor any muscle\ntissue. How does the plant detect the touch, and how do the leaves move\nin response?\nFigure 6.4Figure 6.4Figure 6.4Figure 6.4Figure 6.4  The sensitive plant\nIf we think about where exactly the plant is touched, and what part\nof the plant actually moves, it is apparent that movement happens at a\npoint different from the point of touch. So, information that a touch has\noccurred must be communicated. The plants also use electrical-chemical\nmeans to convey this information from cell to cell, but unlike in animals,\nthere is no specialised tissue in plants for the conduction of information.\nFinally, again as in animals, some cells must change shape in order for\nmovement to happen. Instead of the specialised proteins found in animal\nmuscle cells, plant cells change shape by changing the amount of water\nin them, resulting in swelling or shrinking, and therefore in changing\nshapes (Fig. 6.4).\n6.2.2 Movement Due to Growth\nSome plants like the pea plant climb up other plants or fences by means\nof tendrils. These tendrils are sensitive to touch. When they come in\ncontact with any support, the part of the tendril in contact with the object\ndoes not grow as rapidly as the part of the tendril away from the object.\nThis causes the tendril to circle around the object and thus cling to it.\nMore commonly, plants respond to stimuli slowly by growing in a\nparticular direction. Because this growth is directional, it appears as if\nthe plant is moving. Let us understand this type of movement with the\nhelp of an example.\n2024-25\n\n--- Page 8 ---\nControl and Coordination 107\nEnvironmental triggers such as light, or gravity\nwill change the directions that plant parts grow in.\nThese directional, or tropic, movements can be either\ntowards the stimulus, or away from it. So, in two\ndifferent kinds of phototropic movement, shoots\nrespond by bending towards light while roots\nrespond by bending away from it. How does this help\nthe plant?\nPlants show tropism in response to other stimuli as well. The roots\nof a plant always grow downwards while the shoots usually grow\nupwards and away from the earth. This upward and downward growth\nof shoots and roots, respectively, in response to the pull of earth or gravity\nis, obviously, geotropism (Fig. 6.6). If ‘hydro’ means water and ‘chemo’\nrefers to chemicals, what would ‘hydrotropism’ and ‘chemotropism’\nmean? Can we think of examples of these kinds of directional growth\nmovements? One example of chemotropism is the growth of pollen tubes\ntowards ovules, about which we will learn more when we examine the\nreproductive processes of living organisms.\nLet us now once again think about how information is communicated\nin the bodies of multicellular organisms. The movement of the\nsensitive plant in response to touch is very quick. The movement of\nsunflowers in response to day or night, on the other hand, is quite slow.\nGrowth-related movement of plants will be even slower.\nEven in animal bodies, there are carefully controlled directions to\ngrowth. Our arms and fingers grow in certain directions, not haphazardly.\nSo controlled movements can be either slow or fast. If fast responses to\nstimuli are to be made, information transfer must happen very quickly.\nFor this, the medium of transmission must be able to move rapidly.\nActivity 6.2Activity 6.2Activity 6.2Activity 6.2Activity 6.2\n/square6Fill a conical flask with water .\n/square6Cover the neck of the flask with a wire mesh.\n/square6Keep two or three freshly germinated bean\nseeds on the wire mesh.\n/square6Take a cardboard box which is open from one\nside.\n/square6Keep the flask in the box in such a manner\nthat the open side of the box faces light coming\nfrom a window (Fig. 6.5).\n/square6After two or three days, you will notice that\nthe shoots bend towards light and roots away\nfrom light.\n/square6Now turn the flask so that the shoots are away\nfrom light and the roots towards light. Leave it\nundisturbed in this condition for a few days.\n/square6Have the old parts of the shoot and root\nchanged direction?\n/square6Are there differences in the direction of the new\ngrowth?\n/square6What can we conclude from this activity?\nFigure 6.5Figure 6.5Figure 6.5Figure 6.5Figure 6.5\nResponse of the plant to the direction of light\nFigure 6.6 Figure 6.6 Figure 6.6 Figure 6.6 Figure 6.6 Plant showing geotropism\n2024-25\n\n--- Page 9 ---\nScience108\nElectrical impulses are an excellent means for this. But there are\nlimitations to the use of electrical impulses. Firstly, they will reach only\nthose cells that are connected by nervous tissue, not each and every cell\nin the animal body. Secondly, once an electrical impulse is generated in\na cell and transmitted, the cell will take some time to reset its mechanisms\nbefore it can generate and transmit a new impulse. In other words, cells\ncannot continually create and transmit electrical impulses. It is thus no\nwonder that most multicellular organisms use another means of\ncommunication between cells, namely, chemical communication.\nIf, instead of generating an electrical impulse, stimulated cells release\na chemical compound, this compound would diffuse all around the\noriginal cell. If other cells around have the means to detect this compound\nusing special molecules on their surfaces, then they would be able to\nrecognise information, and even transmit it. This will be slower, of course,\nbut it can potentially reach all cells of the body, regardless of nervous\nconnections, and it can be done steadily and persistently. These\ncompounds, or hormones used by multicellular organisms for control\nand coordination show a great deal of diversity, as we would expect.\nDifferent plant hormones help to coordinate growth, development and\nresponses to the environment. They are synthesised at places away from\nwhere they act and simply diffuse to the area of action.\nLet us take an example that we have worked with earlier [Activity 6.2].\nWhen growing plants detect light, a hormone called auxin, synthesised\nat the shoot tip, helps the cells to grow longer. When light is coming from\none side of the plant, auxin diffuses towards the shady side of the shoot.\nThis concentration of auxin stimulates the cells to grow longer on the\nside of the shoot which is away from light. Thus, the plant appears to\nbend towards light.\nAnother example of plant hormones are gibberellins which, like\nauxins, help in the growth of the stem. Cytokinins promote cell division,\nand it is natural then that they are present in greater concentration in\nareas of rapid cell division, such as in fruits and seeds. These are examples\nof plant hormones that help in promoting growth. But plants also need\nsignals to stop growing. Abscisic acid is one example of a hormone which\ninhibits growth. Its effects include wilting of leaves.\nQUESTIONS\n?"
    },
    {
      "id": "32e06569-4ebd-4939-8dca-74863f1c959c",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 7,
      "title": "2. How is the movement of leaves of the sensitive plant different from the",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "movement of a shoot towards light?"
    },
    {
      "id": "226106fb-8a8f-4bff-8f0a-f51a06d120e0",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 10,
      "title": "5. Design an experiment to demonstrate hydrotropism.",
      "topics": [],
      "start_page": 8,
      "end_page": 11,
      "content": "2024-25\n\n--- Page 10 ---\nControl and Coordination 109\n6.3 HORMONES IN ANIMALS6.3 HORMONES IN ANIMALS6.3 HORMONES IN ANIMALS6.3 HORMONES IN ANIMALS6.3 HORMONES IN ANIMALS\nHow are such chemical, or hormonal, means of information transmission\nused in animals? What do some animals, for instance squirrels,\nexperience when they are in a scary situation? Their bodies have to\nprepare for either fighting or running away. Both are very complicated\nactivities that will use a great deal of energy in controlled ways. Many\ndifferent tissue types will be used and their activities integrated together\nin these actions. However, the two alternate activities, fighting or running,\nare also quite different! So here is a situation in which some common\npreparations can be usefully made in the body. These preparations\nshould ideally make it easier to do either activity in the near future. How\nwould this be achieved?\nIf the body design in the squirrel relied only on electrical impulses\nvia nerve cells, the range of tissues instructed to prepare for the coming\nactivity would be limited. On the other hand, if a chemical signal were to\nbe sent as well, it would reach all cells of the body and provide the wide-\nranging changes needed. This is done in many animals, including human\nbeings, using a hormone called adrenaline that is secreted from the\nadrenal glands. Look at Fig. 6.7 to locate these glands.\nAdrenaline is secreted directly into the blood and carried to different\nparts of the body. The target organs or the specific tissues on which it\nacts include the heart. As a result, the heart beats faster, resulting in\nsupply of more oxygen to our muscles. The blood to the digestive system\nand skin is reduced due to contraction of muscles around small arteries\nin these organs. This diverts the blood to our skeletal muscles. The\nbreathing rate also increases because of the contractions of the\ndiaphragm and the rib muscles. All these responses together enable the\nanimal body to be ready to deal with the situation. Such animal hormones\nare part of the endocrine system which constitutes a second way of control\nand coordination in our body.\nActivity 6.3Activity 6.3Activity 6.3Activity 6.3Activity 6.3\n/square6Look at Fig. 6.7.\n/square6Identify the endocrine glands mentioned in the figure.\n/square6Some of these glands have been listed in Table 6.1 and discussed\nin the text. Consult books in the library and discuss with your\nteachers to find out about other glands.\nRemember that plants have hormones that control their directional\ngrowth. What functions do animal hormones perform? On the face of it,\nwe cannot imagine their role in directional growth. We have never seen\nan animal growing more in one dir ection or the other, depending on\nlight or gravity! But if we think about it a bit more, it will become evident\nthat, even in animal bodies, growth happens in carefully controlled places.\nPlants will grow leaves in many places on the plant body, for example.\nBut we do not grow fingers on our faces. The design of the body is carefully\nmaintained even during the growth of children.\n2024-25\n\n--- Page 11 ---\nScience110\nLet us examine some examples to understand how hormones help\nin coordinated growth. We have all seen salt packets which say ‘iodised\nsalt’ or ‘enriched with iodine’. Why is it important for us to have iodised\nsalt in our diet? Iodine is necessary for the thyroid gland to make\nthyroxin hormone. Thyroxin regulates carbohydrate, protein and fat\nmetabolism in the body so as to provide the best balance for growth.\nIodine is essential for the synthesis of thyroxin. In case iodine is deficient\nin our diet, there is a possibility that we might suffer from goitre. One\nof the symptoms in this disease is a swollen neck. Can you correlate\nthis with the position of the thyroid gland in Fig. 6.7?\nSometimes we come across people who are either very short (dwarfs)\nor extremely tall (giants). Have you ever wondered how this happens?\nGrowth hormone is one of the hormones secreted by the pituitary. As\nits name indicates, growth hormone regulates growth and development\nof the body. If there is a deficiency of this hormone in childhood, it\nleads to dwarfism.\nYou must have noticed many dramatic changes in your appearance\nas well as that of your friends as you approached 10–12 years of age.\nThese changes associated with puberty are because of the secretion of\ntestosterone in males and oestrogen in females.\nDo you know anyone in your family or friends who has been advised\nby the doctor to take less sugar in their diet because they are suffering\nfrom diabetes? As a treatment, they might be taking injections of insulin.\nThis is a hormone which is produced by the pancreas and helps in\nregulating blood sugar levels. If it is not secreted in proper amounts,\nthe sugar level in the blood rises causing many harmful effects.\nFigure 6.7 Endocrine glands in human beings (a) male, (b) female\n(a) (b)\nDo You Know?\nHypothalamus plays\nan important role in\nthe release of many\nhormones. For\nexample, when the\nlevel of growth\nhormone is low, the\nhypothalamus\nreleases growth\nhormone releasing\nfactor which\nstimulates the\npituitary gland to\nrelease growth\nhormone.\n2024-25\n\n--- Page 12 ---\nControl and Coordination 111\nIf it is so important that hormones should be secreted in precise\nquantities, we need a mechanism through which this is done. The timing\nand amount of hormone released are regulated by feedback mechanisms.\nFor example, if the sugar levels in blood rise, they are detected by the\ncells of the pancreas which respond by producing more insulin. As the\nblood sugar level falls, insulin secretion is reduced.\nTable 6.1 : Some important hormones and their functions\nActivity 6.4Activity 6.4Activity 6.4Activity 6.4Activity 6.4\n/square6  Hormones are secreted by endocrine glands and have specific functions. Complete\nTable 6.1 based on the hormone, the endocrine gland or the functions provided.\nQUESTIONS"
    },
    {
      "id": "e85f82d8-60d5-4e12-92f3-21d1d08b9653",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 14,
      "title": "4. Why are some patients of diabetes treated by giving injections of insulin?",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "What you have learnt\n?\n/square6Control and coordination are the functions of the nervous system and hormones\nin our bodies.\n/square6The responses of the nervous system can be classified as reflex action, voluntary\naction or involuntary action.\n/square6The nervous system uses electrical impulses to transmit messages.\n/square6The nervous system gets information from our sense organs and acts through our\nmuscles.\n/square6Chemical coordination is seen in both plants and animals.\n/square6Hormones produced in one part of an organism move to another part to achieve\nthe desired effect.\n/square6A feedback mechanism regulates the action of the hormones.\nS.No. Hormone Endocrine Gland Functions"
    },
    {
      "id": "58397a8c-b4ff-4043-b5fe-fdc02062721e",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 19,
      "title": "5. Ovaries Development of female sex organs,",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "regulates menstrual cycle, etc."
    },
    {
      "id": "fae53bc3-2cf0-4c52-8215-c9365361c07c",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 21,
      "title": "7. Releasing Stimulates pituitary gland to release",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "hormones hormones\n2024-25\n\n--- Page 13 ---\nScience112\nEXERCISES"
    },
    {
      "id": "0091c69e-faa7-416d-8cda-f6bb9624d712",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 22,
      "title": "1. Which of the following is a plant hormone?",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "(a) Insulin\n(b) Thyroxin\n(c) Oestrogen\n(d) Cytokinin."
    },
    {
      "id": "4bb49c9a-f828-430e-bb5e-fddec38d02b2",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 23,
      "title": "2. The gap between two neurons is called a",
      "topics": [],
      "start_page": 11,
      "end_page": 12,
      "content": "(a) dendrite.\n(b) synapse.\n(c) axon.\n(d) impulse."
    },
    {
      "id": "a08731b2-fed9-4f8d-bb7b-25a51ea7c9d8",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 24,
      "title": "3. The brain is responsible for",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "(a) thinking.\n(b) regulating the heart beat.\n(c) balancing the body.\n(d) all of the above."
    },
    {
      "id": "70f482e0-3ecb-4eab-9ea2-b08f9a0b8f28",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 25,
      "title": "4. What is the function of receptors in our body? Think of situations where receptors",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "do not work properly. What problems are likely to arise?"
    },
    {
      "id": "975348b5-bcba-46ad-b1d0-2374cf8b2a3c",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 32,
      "title": "11. Compare and contrast nervous and hormonal mechanisms for control and",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "coordination in animals."
    },
    {
      "id": "d9491dc1-72ae-40d4-87fe-bb84db245131",
      "textbook_id": "664a5856-ff25-45de-acbd-09499a7a41c8",
      "chapter_number": 33,
      "title": "12. What is the difference between the manner in which movement takes place in a",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "sensitive plant and the movement in our legs?\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "7d5ead82-1c85-4661-af94-4c69af285140",
      "chapter_id": "1fc23214-f97a-410d-b3fe-d5136abb3344",
      "chunk_index": 0,
      "content": "6.2 COORDINA6.2 COORDINA6.2 COORDINA6.2 COORDINA6.2 COORDINA TION IN PLTION IN PLTION IN PLTION IN PLTION IN PL ANTSANTSANTS\nANTSANTS\nAnimals have a nervous system for controlling and coordinating the\nactivities of the body. But plants have neither a nervous system nor\nmuscles. So, how do they respond to stimuli? When we touch the leaves\nof a chhui-mui  (the ‘sensitive’ or ‘touch-me-not’ plant of the Mimosa\nfamily), they begin to fold up and droop. When a seed germinates, the\nroot goes down, the stem comes up into the air. What happens? Firstly,\nthe leaves of the sensitive plant move very quickly in response to touch.\n2024-25\n\n--- Page 7 ---\nScience106\nThere is no growth involved in this movement. On the other hand, the\ndirectional movement of a seedling is caused by growth. If it is prevented\nfrom growing, it will not show any movement. So plants show two different\ntypes of movement – one dependent on growth and the other independent\nof growth.\n6.2.1 Immediate Response to Stimulus\nLet us think about the first kind of movement, such as that of the sensitive\nplant. Since no growth is involved, the plant must actually move its leaves\nin response to touch. But there is no nervous tissue, nor any muscle\ntissue. How does the plant detect the touch, and how do the leaves move\nin response?\nFigure 6.4Figure 6.4Figure 6.4Figure 6.4Figure 6.4  The sensitive plant\nIf we think about where exactly the plant is touched, and what part\nof the plant actually moves, it is apparent that movement happens at a\npoint different from the point of touch. So, information that a touch has\noccurred must be communicated. The plants also use electrical-chemical\nmeans to convey this information from cell to cell, but unlike in animals,\nthere is no specialised tissue in plants for the conduction of information.\nFinally, again as in animals, some cells must change shape in order for\nmovement to happen. Instead of the specialised proteins found in animal\nmuscle cells, plant cells change shape by changing the amount of water\nin them, resulting in swelling or shrinking, and therefore in changing\nshapes (Fig. 6.4).\n6.2.2 Movement Due to Growth\nSome plants like the pea plant climb up other plants or fences by means\nof tendrils. These tendrils are sensitive to touch. When they come in\ncontact with any support, the part of the tendril in contact with the object\ndoes not grow as rapidly as the part of the tendril away from the object.\nThis causes the tendril to circle around the object and thus cling to it.\nMore commonly, plants respond to stimuli slowly by growing in a\nparticular direction. Because this growth is directional, it appears as if\nthe plant is moving. Let us understand this type of movement with the\nhelp of an example.\n2024-25",
      "content_type": "example",
      "token_count": 687,
      "page_number": 5
    },
    {
      "id": "89981af6-2438-4ead-a113-b1d40a8f730e",
      "chapter_id": "1fc23214-f97a-410d-b3fe-d5136abb3344",
      "chunk_index": 1,
      "content": "--- Page 8 ---\nControl and Coordination 107\nEnvironmental triggers such as light, or gravity\nwill change the directions that plant parts grow in.\nThese directional, or tropic, movements can be either\ntowards the stimulus, or away from it. So, in two\ndifferent kinds of phototropic movement, shoots\nrespond by bending towards light while roots\nrespond by bending away from it. How does this help\nthe plant?\nPlants show tropism in response to other stimuli as well. The roots\nof a plant always grow downwards while the shoots usually grow\nupwards and away from the earth. This upward and downward growth\nof shoots and roots, respectively, in response to the pull of earth or gravity\nis, obviously, geotropism (Fig. 6.6). If ‘hydro’ means water and ‘chemo’\nrefers to chemicals, what would ‘hydrotropism’ and ‘chemotropism’\nmean? Can we think of examples of these kinds of directional growth\nmovements? One example of chemotropism is the growth of pollen tubes\ntowards ovules, about which we will learn more when we examine the\nreproductive processes of living organisms.\nLet us now once again think about how information is communicated\nin the bodies of multicellular organisms. The movement of the\nsensitive plant in response to touch is very quick. The movement of\nsunflowers in response to day or night, on the other hand, is quite slow.\nGrowth-related movement of plants will be even slower.\nEven in animal bodies, there are carefully controlled directions to\ngrowth. Our arms and fingers grow in certain directions, not haphazardly.\nSo controlled movements can be either slow or fast. If fast responses to\nstimuli are to be made, information transfer must happen very quickly.\nFor this, the medium of transmission must be able to move rapidly.\nActivity 6.2Activity 6.2Activity 6.2Activity 6.2Activity 6.2\n/square6Fill a conical flask with water .\n/square6Cover the neck of the flask with a wire mesh.\n/square6Keep two or three freshly germinated bean\nseeds on the wire mesh.\n/square6Take a cardboard box which is open from one\nside.\n/square6Keep the flask in the box in such a manner\nthat the open side of the box faces light coming\nfrom a window (Fig. 6.5).\n/square6After two or three days, you will notice that\nthe shoots bend towards light and roots away\nfrom light.\n/square6Now turn the flask so that the shoots are away\nfrom light and the roots towards light. Leave it\nundisturbed in this condition for a few days.\n/square6Have the old parts of the shoot and root\nchanged direction?\n/square6Are there differences in the direction of the new\ngrowth?\n/square6What can we conclude from this activity?\nFigure 6.5Figure 6.5Figure 6.5Figure 6.5Figure 6.5\nResponse of the plant to the direction of light\nFigure 6.6 Figure 6.6 Figure 6.6 Figure 6.6 Figure 6.6 Plant showing geotropism\n2024-25",
      "content_type": "example",
      "token_count": 697,
      "page_number": 5
    },
    {
      "id": "7cb3ed2f-b6a5-41e2-a15a-7723228e1d5e",
      "chapter_id": "1fc23214-f97a-410d-b3fe-d5136abb3344",
      "chunk_index": 2,
      "content": "--- Page 9 ---\nScience108\nElectrical impulses are an excellent means for this. But there are\nlimitations to the use of electrical impulses. Firstly, they will reach only\nthose cells that are connected by nervous tissue, not each and every cell\nin the animal body. Secondly, once an electrical impulse is generated in\na cell and transmitted, the cell will take some time to reset its mechanisms\nbefore it can generate and transmit a new impulse. In other words, cells\ncannot continually create and transmit electrical impulses. It is thus no\nwonder that most multicellular organisms use another means of\ncommunication between cells, namely, chemical communication.\nIf, instead of generating an electrical impulse, stimulated cells release\na chemical compound, this compound would diffuse all around the\noriginal cell. If other cells around have the means to detect this compound\nusing special molecules on their surfaces, then they would be able to\nrecognise information, and even transmit it. This will be slower, of course,\nbut it can potentially reach all cells of the body, regardless of nervous\nconnections, and it can be done steadily and persistently. These\ncompounds, or hormones used by multicellular organisms for control\nand coordination show a great deal of diversity, as we would expect.\nDifferent plant hormones help to coordinate growth, development and\nresponses to the environment. They are synthesised at places away from\nwhere they act and simply diffuse to the area of action.\nLet us take an example that we have worked with earlier [Activity 6.2].\nWhen growing plants detect light, a hormone called auxin, synthesised\nat the shoot tip, helps the cells to grow longer. When light is coming from\none side of the plant, auxin diffuses towards the shady side of the shoot.\nThis concentration of auxin stimulates the cells to grow longer on the\nside of the shoot which is away from light. Thus, the plant appears to\nbend towards light.\nAnother example of plant hormones are gibberellins which, like\nauxins, help in the growth of the stem. Cytokinins promote cell division,\nand it is natural then that they are present in greater concentration in\nareas of rapid cell division, such as in fruits and seeds. These are examples\nof plant hormones that help in promoting growth. But plants also need\nsignals to stop growing. Abscisic acid is one example of a hormone which\ninhibits growth. Its effects include wilting of leaves.\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 612,
      "page_number": 8
    },
    {
      "id": "34b33176-69d1-4f00-b70e-587947830b78",
      "chapter_id": "32e06569-4ebd-4939-8dca-74863f1c959c",
      "chunk_index": 0,
      "content": "movement of a shoot towards light?",
      "content_type": "text",
      "token_count": 8,
      "page_number": 8
    },
    {
      "id": "8107eba0-2526-46d0-b8f8-2c8c83c421df",
      "chapter_id": "226106fb-8a8f-4bff-8f0a-f51a06d120e0",
      "chunk_index": 0,
      "content": "2024-25",
      "content_type": "text",
      "token_count": 1,
      "page_number": 8
    },
    {
      "id": "25c4d104-bc49-45ae-89bb-d2fecec775c1",
      "chapter_id": "226106fb-8a8f-4bff-8f0a-f51a06d120e0",
      "chunk_index": 1,
      "content": "--- Page 10 ---\nControl and Coordination 109\n6.3 HORMONES IN ANIMALS6.3 HORMONES IN ANIMALS6.3 HORMONES IN ANIMALS6.3 HORMONES IN ANIMALS6.3 HORMONES IN ANIMALS\nHow are such chemical, or hormonal, means of information transmission\nused in animals? What do some animals, for instance squirrels,\nexperience when they are in a scary situation? Their bodies have to\nprepare for either fighting or running away. Both are very complicated\nactivities that will use a great deal of energy in controlled ways. Many\ndifferent tissue types will be used and their activities integrated together\nin these actions. However, the two alternate activities, fighting or running,\nare also quite different! So here is a situation in which some common\npreparations can be usefully made in the body. These preparations\nshould ideally make it easier to do either activity in the near future. How\nwould this be achieved?\nIf the body design in the squirrel relied only on electrical impulses\nvia nerve cells, the range of tissues instructed to prepare for the coming\nactivity would be limited. On the other hand, if a chemical signal were to\nbe sent as well, it would reach all cells of the body and provide the wide-\nranging changes needed. This is done in many animals, including human\nbeings, using a hormone called adrenaline that is secreted from the\nadrenal glands. Look at Fig. 6.7 to locate these glands.\nAdrenaline is secreted directly into the blood and carried to different\nparts of the body. The target organs or the specific tissues on which it\nacts include the heart. As a result, the heart beats faster, resulting in\nsupply of more oxygen to our muscles. The blood to the digestive system\nand skin is reduced due to contraction of muscles around small arteries\nin these organs. This diverts the blood to our skeletal muscles. The\nbreathing rate also increases because of the contractions of the\ndiaphragm and the rib muscles. All these responses together enable the\nanimal body to be ready to deal with the situation. Such animal hormones\nare part of the endocrine system which constitutes a second way of control\nand coordination in our body.\nActivity 6.3Activity 6.3Activity 6.3Activity 6.3Activity 6.3\n/square6Look at Fig. 6.7.\n/square6Identify the endocrine glands mentioned in the figure.\n/square6Some of these glands have been listed in Table 6.1 and discussed\nin the text. Consult books in the library and discuss with your\nteachers to find out about other glands.\nRemember that plants have hormones that control their directional\ngrowth. What functions do animal hormones perform? On the face of it,\nwe cannot imagine their role in directional growth. We have never seen\nan animal growing more in one dir ection or the other, depending on\nlight or gravity! But if we think about it a bit more, it will become evident\nthat, even in animal bodies, growth happens in carefully controlled places.\nPlants will grow leaves in many places on the plant body, for example.\nBut we do not grow fingers on our faces. The design of the body is carefully\nmaintained even during the growth of children.\n2024-25",
      "content_type": "example",
      "token_count": 773,
      "page_number": 8
    },
    {
      "id": "611ea7f2-1286-4774-82ca-f149139effa3",
      "chapter_id": "226106fb-8a8f-4bff-8f0a-f51a06d120e0",
      "chunk_index": 2,
      "content": "--- Page 11 ---\nScience110\nLet us examine some examples to understand how hormones help\nin coordinated growth. We have all seen salt packets which say ‘iodised\nsalt’ or ‘enriched with iodine’. Why is it important for us to have iodised\nsalt in our diet? Iodine is necessary for the thyroid gland to make\nthyroxin hormone. Thyroxin regulates carbohydrate, protein and fat\nmetabolism in the body so as to provide the best balance for growth.\nIodine is essential for the synthesis of thyroxin. In case iodine is deficient\nin our diet, there is a possibility that we might suffer from goitre. One\nof the symptoms in this disease is a swollen neck. Can you correlate\nthis with the position of the thyroid gland in Fig. 6.7?\nSometimes we come across people who are either very short (dwarfs)\nor extremely tall (giants). Have you ever wondered how this happens?\nGrowth hormone is one of the hormones secreted by the pituitary. As\nits name indicates, growth hormone regulates growth and development\nof the body. If there is a deficiency of this hormone in childhood, it\nleads to dwarfism.\nYou must have noticed many dramatic changes in your appearance\nas well as that of your friends as you approached 10–12 years of age.\nThese changes associated with puberty are because of the secretion of\ntestosterone in males and oestrogen in females.\nDo you know anyone in your family or friends who has been advised\nby the doctor to take less sugar in their diet because they are suffering\nfrom diabetes? As a treatment, they might be taking injections of insulin.\nThis is a hormone which is produced by the pancreas and helps in\nregulating blood sugar levels. If it is not secreted in proper amounts,\nthe sugar level in the blood rises causing many harmful effects.\nFigure 6.7 Endocrine glands in human beings (a) male, (b) female\n(a) (b)\nDo You Know?\nHypothalamus plays\nan important role in\nthe release of many\nhormones. For\nexample, when the\nlevel of growth\nhormone is low, the\nhypothalamus\nreleases growth\nhormone releasing\nfactor which\nstimulates the\npituitary gland to\nrelease growth\nhormone.\n2024-25\n\n--- Page 12 ---\nControl and Coordination 111\nIf it is so important that hormones should be secreted in precise\nquantities, we need a mechanism through which this is done. The timing\nand amount of hormone released are regulated by feedback mechanisms.\nFor example, if the sugar levels in blood rise, they are detected by the\ncells of the pancreas which respond by producing more insulin. As the\nblood sugar level falls, insulin secretion is reduced.\nTable 6.1 : Some important hormones and their functions\nActivity 6.4Activity 6.4Activity 6.4Activity 6.4Activity 6.4\n/square6  Hormones are secreted by endocrine glands and have specific functions. Complete\nTable 6.1 based on the hormone, the endocrine gland or the functions provided.\nQUESTIONS",
      "content_type": "example",
      "token_count": 708,
      "page_number": 11
    },
    {
      "id": "0e53a9d3-028a-43eb-9f0a-f95869854b7e",
      "chapter_id": "e85f82d8-60d5-4e12-92f3-21d1d08b9653",
      "chunk_index": 0,
      "content": "What you have learnt\n?\n/square6Control and coordination are the functions of the nervous system and hormones\nin our bodies.\n/square6The responses of the nervous system can be classified as reflex action, voluntary\naction or involuntary action.\n/square6The nervous system uses electrical impulses to transmit messages.\n/square6The nervous system gets information from our sense organs and acts through our\nmuscles.\n/square6Chemical coordination is seen in both plants and animals.\n/square6Hormones produced in one part of an organism move to another part to achieve\nthe desired effect.\n/square6A feedback mechanism regulates the action of the hormones.\nS.No. Hormone Endocrine Gland Functions",
      "content_type": "text",
      "token_count": 172,
      "page_number": 11
    },
    {
      "id": "c576d78b-a963-47d2-a488-d5eac94a8a9b",
      "chapter_id": "58397a8c-b4ff-4043-b5fe-fdc02062721e",
      "chunk_index": 0,
      "content": "regulates menstrual cycle, etc.",
      "content_type": "text",
      "token_count": 7,
      "page_number": 11
    },
    {
      "id": "8fcca230-7bc1-4ab2-b271-66de7a25615a",
      "chapter_id": "fae53bc3-2cf0-4c52-8215-c9365361c07c",
      "chunk_index": 0,
      "content": "hormones hormones\n2024-25\n\n--- Page 13 ---\nScience112\nEXERCISES",
      "content_type": "exercise",
      "token_count": 15,
      "page_number": 11
    },
    {
      "id": "8e0896a3-0d60-4746-8c4f-bcea896f1c54",
      "chapter_id": "0091c69e-faa7-416d-8cda-f6bb9624d712",
      "chunk_index": 0,
      "content": "(a) Insulin\n(b) Thyroxin\n(c) Oestrogen\n(d) Cytokinin.",
      "content_type": "text",
      "token_count": 13,
      "page_number": 11
    },
    {
      "id": "5fd4a3f0-0df2-4d48-8d2a-5d2ebd69dd75",
      "chapter_id": "4bb49c9a-f828-430e-bb5e-fddec38d02b2",
      "chunk_index": 0,
      "content": "(a) dendrite.\n(b) synapse.\n(c) axon.\n(d) impulse.",
      "content_type": "text",
      "token_count": 12,
      "page_number": 12
    },
    {
      "id": "5fd77d48-2d35-435d-8a49-ad1777abe0e1",
      "chapter_id": "a08731b2-fed9-4f8d-bb7b-25a51ea7c9d8",
      "chunk_index": 0,
      "content": "(a) thinking.\n(b) regulating the heart beat.\n(c) balancing the body.\n(d) all of the above.",
      "content_type": "text",
      "token_count": 22,
      "page_number": 12
    },
    {
      "id": "adb8da1a-f7b8-4d09-9255-ca3228970482",
      "chapter_id": "70f482e0-3ecb-4eab-9ea2-b08f9a0b8f28",
      "chunk_index": 0,
      "content": "do not work properly. What problems are likely to arise?",
      "content_type": "exercise",
      "token_count": 14,
      "page_number": 12
    },
    {
      "id": "13f23c33-4c84-4c26-a28d-fedca283ad1a",
      "chapter_id": "975348b5-bcba-46ad-b1d0-2374cf8b2a3c",
      "chunk_index": 0,
      "content": "coordination in animals.",
      "content_type": "text",
      "token_count": 6,
      "page_number": 12
    },
    {
      "id": "9a12f411-695a-4709-a65f-88f8401c7758",
      "chapter_id": "d9491dc1-72ae-40d4-87fe-bb84db245131",
      "chunk_index": 0,
      "content": "sensitive plant and the movement in our legs?\n2024-25",
      "content_type": "text",
      "token_count": 13,
      "page_number": 12
    }
  ]
}