{
  "textbook": {
    "id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
    "file_name": "Class X Health and PE - Ch 00 - Social HealtH.pdf",
    "title": "Social HealtH",
    "grade": 10,
    "subject": "Class X Health and PE",
    "total_pages": 10,
    "file_size_mb": 1.438486099243164,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:34.535304",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Health and PE/Class X Health and PE - Ch 00 - Social HealtH.pdf"
  },
  "chapters": [
    {
      "id": "12a13ee6-9369-402c-b2e4-d9d5df97cbdb",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 2,
      "title": "2. State situations that made Ravi think his grandfather",
      "topics": [],
      "start_page": 2,
      "end_page": 2,
      "content": "was alienating others."
    },
    {
      "id": "412cc61e-6b61-4746-99ab-30269735fc4c",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 3,
      "title": "3. Say yes or no",
      "topics": [],
      "start_page": 2,
      "end_page": 5,
      "content": "  (a) Do you agree that physical, mental and social health \nare interrelated? \n  (b) Living with others harmoniously \nrequires a person \nto be socially healthy. State the reason for your \nchoice.\nActivity 12.2\n • You are in a tricky situation. Your best friend had a fight with \nanother friend and you have seen that your best friend is at \nfault. You are asked to intervene to \nbring back peace. Will you \nannounce that the cause of the fight was your best friend? \nThis may become a source of annoyance to your best friend \nbut if you did, that is Justice.\n • If you help, the two boys become friends again, that is \nfraternity.Chap-12.indd   206 8/24/2020   11:46:39 AM\n2024-25\n\n--- Page 3 ---\nSocial HealtH\n207\n • Your friend Arun noticed that food was being distributed free \nof charge on the footpath. A boy wearing tattered dirty clothes \nwas repeatedly being sent to the end of the queue. Arun held \nthe boy’s hand and insisted that the boy be given the food \npacket then and there and not at the end. Arun believed in \nEquality of opportunity for all.\n • If you listen carefully to others opinions on a subject even \nif they do not match yours and try to understand others’ \nviewpoints, you believe in liberty.\nRead the preamble to the constitution of India given at the \nbeginning of all NCERT text books. It is reprinted here for \nyou. (photocopy of preamble of constitution).\nFig. 12.1: Preamble to the Constitution of India\nChap-12.indd   207 8/24/2020   11:46:39 AM\n2024-25\n\n--- Page 4 ---\nHealtH and PHysical education - class X\n208\nEveryone is a member of a social group and everyone \nis part of their peer group, family and kin, community, \ncity, region and country, as well as the physical and \nbiological environment. Would you agree that the country’s \nconstitution provides for Justice, Liberty, Equality and \nFraternity which should be adopted in life for living happily \nand having consideration for all others in the group? Let us \nunderstand these four terms of our constitution which are \ndirectly related to “social health of a person or a country”, \nand then try to define social health. In other words, if one is \nsocially healthy, than will be able to develop interpersonal \nrelations, through maintaining equality, fraternity and \njustice.\nLet us now try and define social health.\nDefinition  of ‘social health’\nSocial health may be defined as the ability to form satisfying \ninterpersonal relationships with others.  One who is able to \nmake positive relationships and acquires the ability to adapt \nin different social situations and act appropriately as per \nthe situation concerned, and can be called a socially healthy \nperson. \nNeed for developing social health\nPrimitive humans were hunter-gatherers, who lived in small \ngroups or clusters and spent their lives at individual levels. \nAround 10,000 years ago, they moved near rivers to grow \ntheir own food and began to live together. With the passage \nof time, they started to live in a society and developed a \nlanguage for interaction with each other. As ‘human society’ \nprogressed, an individual became part of many social groups \nfor example a member of a peer group, a family and kin, a class \nin school, a native of a region and a citizen of one’s country. \nSocial changes occur from time to time and many societies \nlay down norms and values for group living. Urbanisation \nhas brought about many changes which are different from \ntraditional rural societies.\nSocial attributes, of people however, remain the same \nas they are based on interrelationship between members of \nany society and necessary for accomplishing tasks requiring \nteamwork. School is one of the platforms for learning social \nskills.\nRole of vaRious institutions\nPromotion of social health among children requires collective \nefforts and appropriate skills. All people in the field of \neducation have to think about this.\nChap-12.indd   208 8/24/2020   11:46:39 AM\n2024-25\n\n--- Page 5 ---\nSocial HealtH\n209\nRole of teacher training institutes and other \norganisations\nSchool teachers need a degree, diploma or certificates from a \nteacher training institute. There are a number of organisation \nconcerned with school education. The syllabus of teacher \ntraining courses should include the topics of important \nissues for children of which health should be one. \nOrganisations such as NCERT, SCERT, DIET should \nperiodically organise workshops, publish journals and \nprovide inservice training programmes on health issues \nincluding social health.\nRole of schools in promoting social health\nSchools have a very significant role to play in the promotion \nof health and safety of children. They spend a lot of time \nin school in early years. School environment forms ideal \nsetting for acquiring knowledge of healthy choices of food. It \nis in school that they participate in physical activity through \nsports, games, yoga, gymnastics, exercise and gain benefits \nof each. School helps children to learn social skills which \nassist in establishing lifelong healthy behavior. Children \nlearn team spirit and training in rules and regulations of \nsocial wellbeing just as in the defense services, which are \ninbuilt in training of defense service personnel, so they work \ntogether as a team to protect our nation.\nIn order to promote social health, the school should \nhave a positive environment where children mingle with \nteachers, peer group and non-teaching staff without fear and \napprehensions. Teacher have a significant role in this regard.\nRole of teachers\nIt is well known that teachers are the mentors and therefore, \nthe teacher training institutes should make training in \nleadership and mentorship a part of teacher training. Also well \nknown saying that ‘example in better than precept’ Students \neasily learn to be socially healthy if the teacher herself or \nhimself sets an example rather than lecture on social health. \nA good teacher ensures that students grow up into physically, \nmentally and socially healthy individuals. In doing this the \nteacher has to make efforts to ensure that students —\n (i) eat a proper diet and perform regular exercise and \nphysical activity which are requirements of good \nphysical health. \n (ii) inculcate friendship between classmates, indulge \nin amicable behavior with others in school so that \nstudents develop a helpful nature. These are necessary \nfor mental and emotional health. \nChap-12.indd   209 8/24/2020   11:46:40 AM\n2024-25\n\n--- Page 6 ---\nHealtH and PHysical education - class X\n210"
    },
    {
      "id": "62a07f75-04b7-4f4c-a7ec-1f70f2bf6b37",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 4,
      "title": "3. Teachers should train students in learning life skills",
      "topics": [],
      "start_page": 5,
      "end_page": 7,
      "content": "like — \n a) empathy and self awareness\n b) effective communication so that they develop \nhealthy Interpersonal relationships\n c) problem-solving and decision-making to learn to \nbe stress free\n d) creative and critical thinking\n e) coping with stress and emotion.\nThe above are absolutely essential for developing social \nskills in order to be socially healthy.\nSocial skills help a student to have a desirable self image \nand self esteem and also self confidence. This makes children \nacquire ability to live harmoniously in the society.\nRole of technology in building social health\nTechnology has made communication convenient through \nMobiles, Skype, Facebook, Twitter, Instagram and E-mail \nmessages. Knowledge about different media can help to \ndevelop the skills to access the appropriate media for \naccurate information on a specific topic or issues. More \nso, because media brings awareness, and provides access \nto global knowledge and learning. But refrain from using \nmobiles and viewing the T.V. for long periods as that tends \nto be counter-productive and reduce interaction time with \nothers. This makes us socially withdrawn. Although media is \na source of information, all of it may not be true or reliable. \nIt is advisable to seek guidenes from a trusted adult while \naccessing media and internet. Moreover, there is a need to \nunderstand about real and fake news or information as these \naffects our attitude and behavior.\nRole of students in building habits of social health\nSocial health comes from social skills. A few important \nguidelines for promoting social skills are outlined below.\n (i) Building self awareness is an important skill: Practice \nself-care by developing habits of cleanliness and \nhygiene, keeping away from substance abuse, \nengaging in physical activity and regularly consuming \na balanced diet.\n (ii) Do not be blameful and judgmental: Remember when \nyou point a finger at others, three fingers of yours \npoint towards you. Hence indulge in knowing yourself \nbetter. It helps to discriminate between a good \nand a bad act of yours and helps to make friends. \nEmpathy and self awareness go hand in hand.  \nWhen you seea child hitting an animal, tell that \nChap-12.indd   210 8/24/2020   11:46:40 AM\n2024-25\n\n--- Page 7 ---\nSocial HealtH\n211\nchild that if they were hit, they would feel the same \npain. That is empathy for others and leads to self  \nawareness.\n (iii) Learn to identify your own mistakes: There is no harm \nin saying sorry for a mistake and rectifying it. People \nwill have faith in you if you did so.\n (iv) Make an effort to reconnect with old relationships and \nfriendships: The socially healthy person makes an \neffort to contact and meet old friends, to remember \nenjoyable periods of childhood which can be a good \nway to beat stress and spend leisure time. \n (v) Appreciate yourself and others: But never let your ego \nrule your behaviour which can sometimes drive you \nto lose a relationship.\n (vi) Try and be respectful, positive and supportive towards \nthe needy, the physically and mentally challenged, the \ndowntrodden and those belonging to faith and cultures \nother than yours. Lend an ear to others opinion. It \nteaches tolerance. Tolerance and appreciation are \nvirtues in socially healthy individuals. \nRole of family in inculcating social skills in young \nfamily members\nThe importance of family in inculcating social skills among, \nchildren is paramount. Guardians or parents are the prime \nteachers and caretakers who feed them healthy food and are \nalso their play mates. They have to be aware themselves to \nbe role model and make children appreciate as they grow.  \nThe benefits of enjoying nutritious food and being aware \nof a balanced diet is of paramount importance. Watching \nof television for longer duration is bad for students. \nParents themselves have to be cautious in what they do \nin front of children and how long they are in front of the \nTV. However, at the same time good TV programmes are \nan avenue for learning. Encourage them to indulge in \nphysical activity to build their muscles and bones. Fit body \nand fitness depends primarily on proper diet and healthy \nbody and mind. The parents and elder family members \nneed to guide them in social skills. Parents and elders \nhave to be accessible to children for necessary guidance.  \nThey  form a “safety network’. They are to guide adolescents \nthrough advice, answer their queries and occupy them \nthrough activities to keep them away from involvement \nin addictive substances like tobacco, drugs and alcohol \nwhich they might believe are helpful in tiding over stress. \nHowever, these substances have deleterious effects on the  \ngrowing body.\nChap-12.indd   211 8/24/2020   11:46:40 AM\n2024-25\n\n--- Page 8 ---\nHealtH and PHysical education - class X\n212\nWhat aRe life skills ?\nThese are —\n • Empathy: Is the ability to understand another’s feelings \nin a particular situation.\n • Self Awareness: Is the recognition of one’s character, \nstrengths, areas of growth, beliefs and values.\n • Effective Communication: Is having skills of \ncommunication that facilitate interaction with people \nin positive ways.\n • Interpersonal Relationships: Building relationships of \nfriendship and goodwill with all others.\n • Problem solving: Is the ability to resolve challenges.\n • Decision Making: Is the quality of analyzing problem to \nfind and act to reach an appropriate solution.\n • Creative thinking: Is the ability to do something in a \nnovel manner.\n • Critical Thinking: Is the capacity to analyse multiple \nperspectives and objectively evaluate the same.\n • Coping with Stress and emotional distress: These refer \nto management and regulation of one’s emotions and \nmoments of stress.\nAll these life skills help to develop desirable social health \nand live happily in a society. "
    },
    {
      "id": "a2f0a51b-8a13-462d-b819-4d2a0db3d7b8",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 5,
      "title": "1. The teacher needs to play an active role in discouraging",
      "topics": [],
      "start_page": 7,
      "end_page": 8,
      "content": "her students from engaging in socially unhealthy \npractices such as vindictive attitudes, selfishness, \njealousy and culture of hatred. For this, teacher has \nto sacrifice time and energy. It is however, necessary \nfor a teacher and school authorities to understand \nthat more than finishing the syllabus and passing \nexams, it is the teacher’s responsibility to build good \nhuman beings. Home has a large role to play but \nit has been the mission of teachers to contribute \ntowards grooming students into socially healthy \nadults"
    },
    {
      "id": "a94be6c4-4ddf-4e0b-9940-0434449ad2d5",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 6,
      "title": "2. Another role of a teacher in inculcating ‘social health’",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "is to have a friendly, stress-free atmosphere in class. \nThis can happen if students are engaged in ‘group \nactivities’, especially activities for ‘experiential \nlearning’. Members of groups are reshuffled from \ntime to time for team activities so that students \nmay understand that it takes all kinds of people to \nmake the world and the socially healthy groups can \nlive in harmony despite differing in opinions. Group \nactivities build team spirit and remove boredom. \nChap-12.indd   212 8/24/2020   11:46:40 AM\n2024-25\n\n--- Page 9 ---\nSocial HealtH\n213\niDeas foR PRomoting  social health of \nstuDents"
    },
    {
      "id": "c6733bd7-a643-4208-b2b7-1daa285e4dce",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 7,
      "title": "1. If there is a canteen, permit sale of healthy food",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "like fruits or fruit juices. School authorities should \nbe aware as to what is being sold for consumption \nimmediately outside school and permit only those \nselling healthy eatables or low fat and healthy \nsnacks."
    },
    {
      "id": "3436c173-52d2-4394-b505-b994afdde08c",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 9,
      "title": "3. Provide for examination and treatment of students",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "with poor health conditions, bad teeth and weak \nvision. Organise health checks for them."
    },
    {
      "id": "437f61b9-b0cb-4dda-83eb-d4585d0e4b14",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 10,
      "title": "4. Organise variety of co-curricular activities, and ensure",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "participation of maximum number of students, and \ntraining them leadership as well as team spirit."
    },
    {
      "id": "c15b1a22-437a-4a56-a90a-05e8756b6c0d",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 11,
      "title": "5. Organise interclass sport and games competitions",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "and finally, a sport day and prize distribution for \nencouragement."
    },
    {
      "id": "2223e1d7-813a-4f73-a72f-b8c734d08e34",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 12,
      "title": "6. Include a games period every working day in the time",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "table."
    },
    {
      "id": "65d6229d-a5fd-49c1-8f35-9cdb074b3dc9",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 13,
      "title": "7. Seek and insist on cooperation of parents so that",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "even guardians who have not learnt social skills \nand have unhealthy habits may learn through their \nparticipation. It shall be community service by \nthe school and a means to encourage everyone to \nundertake healthy living."
    },
    {
      "id": "19705617-871d-41da-82e2-1398f3431e22",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 14,
      "title": "8. Have events for teaching and non teaching staff and",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "allow voluntary participation in games using school \nequipment."
    },
    {
      "id": "72b7f790-cecc-43bd-aa6b-a3df7627c525",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 15,
      "title": "9. Have experts for teaching Yoga, Taekwondo, Judo and",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "Karate for self-defense and utilise school premises for \nthe same."
    },
    {
      "id": "26fe15e5-7ec7-46be-83a9-16920d554b05",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 16,
      "title": "10. Schools can have activities involving children to",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "learn to love and respect all living beings, plants and \nanimals."
    },
    {
      "id": "100febb2-5e08-4a8f-ae4e-9e65e54b4cfe",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 17,
      "title": "11. Encourage team games, ‘House system’ should",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "be adopted, which helps children to interact with \nstudents of other classes too."
    },
    {
      "id": "387ca175-4ca4-453c-b907-87c821d2d258",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 18,
      "title": "12. Organise periodic slide shows or movies with valuable",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "messages.\nIn this manner students, teachers, parents and community \nwill realise the benefits of being physically, mentally and \nsocially healthy. And what a great way it will be to build a \nhealthy nation!\nChap-12.indd   213 8/24/2020   11:46:40 AM\n2024-25\n\n--- Page 10 ---\nHealtH and PHysical education - class X\n214\nassessment\n I. Answer the following Questions"
    },
    {
      "id": "392ee17b-e6ae-422d-b45b-efad48d68fa9",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 19,
      "title": "1. Define",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "  a) Health\n  b) Mental health\n  c) Social health"
    },
    {
      "id": "c9589e09-4e14-4487-af72-08c9c008aad5",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 22,
      "title": "4. Suggest three ways in which social health can be promoted in",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "children by each of the following —\n  a) School\n  b) Teachers\n  c) Family"
    },
    {
      "id": "40c3b57b-922f-45ff-be91-ebe0d5f4f9fa",
      "textbook_id": "3d6acdbe-37e8-4c1f-a276-bf86331e2c5f",
      "chapter_number": 24,
      "title": "6. What kind of society do you envisage if majority of its members",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "are socially healthy?\nChap-12.indd   214 8/24/2020   11:46:40 AM\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "d467b91b-b742-42b0-bcfd-9c09572b3f25",
      "chapter_id": "12a13ee6-9369-402c-b2e4-d9d5df97cbdb",
      "chunk_index": 0,
      "content": "was alienating others.",
      "content_type": "text",
      "token_count": 5,
      "page_number": 2
    },
    {
      "id": "86207fce-c893-468b-a885-9580457d8692",
      "chapter_id": "412cc61e-6b61-4746-99ab-30269735fc4c",
      "chunk_index": 0,
      "content": "(a) Do you agree that physical, mental and social health \nare interrelated? \n  (b) Living with others harmoniously \nrequires a person \nto be socially healthy. State the reason for your \nchoice.\nActivity 12.2\n • You are in a tricky situation. Your best friend had a fight with \nanother friend and you have seen that your best friend is at \nfault. You are asked to intervene to \nbring back peace. Will you \nannounce that the cause of the fight was your best friend? \nThis may become a source of annoyance to your best friend \nbut if you did, that is Justice.\n • If you help, the two boys become friends again, that is \nfraternity.Chap-12.indd   206 8/24/2020   11:46:39 AM\n2024-25\n\n--- Page 3 ---\nSocial HealtH\n207\n • Your friend Arun noticed that food was being distributed free \nof charge on the footpath. A boy wearing tattered dirty clothes \nwas repeatedly being sent to the end of the queue. Arun held \nthe boy’s hand and insisted that the boy be given the food \npacket then and there and not at the end. Arun believed in \nEquality of opportunity for all.\n • If you listen carefully to others opinions on a subject even \nif they do not match yours and try to understand others’ \nviewpoints, you believe in liberty.\nRead the preamble to the constitution of India given at the \nbeginning of all NCERT text books. It is reprinted here for \nyou. (photocopy of preamble of constitution).\nFig. 12.1: Preamble to the Constitution of India\nChap-12.indd   207 8/24/2020   11:46:39 AM\n2024-25",
      "content_type": "text",
      "token_count": 371,
      "page_number": 2
    },
    {
      "id": "8c9263ec-e955-476b-9064-cd72902d39c4",
      "chapter_id": "412cc61e-6b61-4746-99ab-30269735fc4c",
      "chunk_index": 1,
      "content": "--- Page 4 ---\nHealtH and PHysical education - class X\n208\nEveryone is a member of a social group and everyone \nis part of their peer group, family and kin, community, \ncity, region and country, as well as the physical and \nbiological environment. Would you agree that the country’s \nconstitution provides for Justice, Liberty, Equality and \nFraternity which should be adopted in life for living happily \nand having consideration for all others in the group? Let us \nunderstand these four terms of our constitution which are \ndirectly related to “social health of a person or a country”, \nand then try to define social health. In other words, if one is \nsocially healthy, than will be able to develop interpersonal \nrelations, through maintaining equality, fraternity and \njustice.\nLet us now try and define social health.\nDefinition  of ‘social health’\nSocial health may be defined as the ability to form satisfying \ninterpersonal relationships with others.  One who is able to \nmake positive relationships and acquires the ability to adapt \nin different social situations and act appropriately as per \nthe situation concerned, and can be called a socially healthy \nperson. \nNeed for developing social health\nPrimitive humans were hunter-gatherers, who lived in small \ngroups or clusters and spent their lives at individual levels. \nAround 10,000 years ago, they moved near rivers to grow \ntheir own food and began to live together. With the passage \nof time, they started to live in a society and developed a \nlanguage for interaction with each other. As ‘human society’ \nprogressed, an individual became part of many social groups \nfor example a member of a peer group, a family and kin, a class \nin school, a native of a region and a citizen of one’s country. \nSocial changes occur from time to time and many societies \nlay down norms and values for group living. Urbanisation \nhas brought about many changes which are different from \ntraditional rural societies.\nSocial attributes, of people however, remain the same \nas they are based on interrelationship between members of \nany society and necessary for accomplishing tasks requiring \nteamwork. School is one of the platforms for learning social \nskills.\nRole of vaRious institutions\nPromotion of social health among children requires collective \nefforts and appropriate skills. All people in the field of \neducation have to think about this.\nChap-12.indd   208 8/24/2020   11:46:39 AM\n2024-25",
      "content_type": "example",
      "token_count": 612,
      "page_number": 2
    },
    {
      "id": "27daf6ee-34a8-452a-9dc7-2567665cf26d",
      "chapter_id": "412cc61e-6b61-4746-99ab-30269735fc4c",
      "chunk_index": 2,
      "content": "--- Page 5 ---\nSocial HealtH\n209\nRole of teacher training institutes and other \norganisations\nSchool teachers need a degree, diploma or certificates from a \nteacher training institute. There are a number of organisation \nconcerned with school education. The syllabus of teacher \ntraining courses should include the topics of important \nissues for children of which health should be one. \nOrganisations such as NCERT, SCERT, DIET should \nperiodically organise workshops, publish journals and \nprovide inservice training programmes on health issues \nincluding social health.\nRole of schools in promoting social health\nSchools have a very significant role to play in the promotion \nof health and safety of children. They spend a lot of time \nin school in early years. School environment forms ideal \nsetting for acquiring knowledge of healthy choices of food. It \nis in school that they participate in physical activity through \nsports, games, yoga, gymnastics, exercise and gain benefits \nof each. School helps children to learn social skills which \nassist in establishing lifelong healthy behavior. Children \nlearn team spirit and training in rules and regulations of \nsocial wellbeing just as in the defense services, which are \ninbuilt in training of defense service personnel, so they work \ntogether as a team to protect our nation.\nIn order to promote social health, the school should \nhave a positive environment where children mingle with \nteachers, peer group and non-teaching staff without fear and \napprehensions. Teacher have a significant role in this regard.\nRole of teachers\nIt is well known that teachers are the mentors and therefore, \nthe teacher training institutes should make training in \nleadership and mentorship a part of teacher training. Also well \nknown saying that ‘example in better than precept’ Students \neasily learn to be socially healthy if the teacher herself or \nhimself sets an example rather than lecture on social health. \nA good teacher ensures that students grow up into physically, \nmentally and socially healthy individuals. In doing this the \nteacher has to make efforts to ensure that students —\n (i) eat a proper diet and perform regular exercise and \nphysical activity which are requirements of good \nphysical health. \n (ii) inculcate friendship between classmates, indulge \nin amicable behavior with others in school so that \nstudents develop a helpful nature. These are necessary \nfor mental and emotional health. \nChap-12.indd   209 8/24/2020   11:46:40 AM\n2024-25\n\n--- Page 6 ---\nHealtH and PHysical education - class X\n210",
      "content_type": "example",
      "token_count": 642,
      "page_number": 5
    },
    {
      "id": "bbb270cf-7e76-4c82-b217-02b9752c86f6",
      "chapter_id": "62a07f75-04b7-4f4c-a7ec-1f70f2bf6b37",
      "chunk_index": 0,
      "content": "like — \n a) empathy and self awareness\n b) effective communication so that they develop \nhealthy Interpersonal relationships\n c) problem-solving and decision-making to learn to \nbe stress free\n d) creative and critical thinking\n e) coping with stress and emotion.\nThe above are absolutely essential for developing social \nskills in order to be socially healthy.\nSocial skills help a student to have a desirable self image \nand self esteem and also self confidence. This makes children \nacquire ability to live harmoniously in the society.\nRole of technology in building social health\nTechnology has made communication convenient through \nMobiles, Skype, Facebook, Twitter, Instagram and E-mail \nmessages. Knowledge about different media can help to \ndevelop the skills to access the appropriate media for \naccurate information on a specific topic or issues. More \nso, because media brings awareness, and provides access \nto global knowledge and learning. But refrain from using \nmobiles and viewing the T.V. for long periods as that tends \nto be counter-productive and reduce interaction time with \nothers. This makes us socially withdrawn. Although media is \na source of information, all of it may not be true or reliable. \nIt is advisable to seek guidenes from a trusted adult while \naccessing media and internet. Moreover, there is a need to \nunderstand about real and fake news or information as these \naffects our attitude and behavior.\nRole of students in building habits of social health\nSocial health comes from social skills. A few important \nguidelines for promoting social skills are outlined below.\n (i) Building self awareness is an important skill: Practice \nself-care by developing habits of cleanliness and \nhygiene, keeping away from substance abuse, \nengaging in physical activity and regularly consuming \na balanced diet.\n (ii) Do not be blameful and judgmental: Remember when \nyou point a finger at others, three fingers of yours \npoint towards you. Hence indulge in knowing yourself \nbetter. It helps to discriminate between a good \nand a bad act of yours and helps to make friends. \nEmpathy and self awareness go hand in hand.  \nWhen you seea child hitting an animal, tell that \nChap-12.indd   210 8/24/2020   11:46:40 AM\n2024-25",
      "content_type": "exercise",
      "token_count": 562,
      "page_number": 5
    },
    {
      "id": "df6a43ae-f0d2-4d1a-b020-02eee55d41be",
      "chapter_id": "62a07f75-04b7-4f4c-a7ec-1f70f2bf6b37",
      "chunk_index": 1,
      "content": "--- Page 7 ---\nSocial HealtH\n211\nchild that if they were hit, they would feel the same \npain. That is empathy for others and leads to self  \nawareness.\n (iii) Learn to identify your own mistakes: There is no harm \nin saying sorry for a mistake and rectifying it. People \nwill have faith in you if you did so.\n (iv) Make an effort to reconnect with old relationships and \nfriendships: The socially healthy person makes an \neffort to contact and meet old friends, to remember \nenjoyable periods of childhood which can be a good \nway to beat stress and spend leisure time. \n (v) Appreciate yourself and others: But never let your ego \nrule your behaviour which can sometimes drive you \nto lose a relationship.\n (vi) Try and be respectful, positive and supportive towards \nthe needy, the physically and mentally challenged, the \ndowntrodden and those belonging to faith and cultures \nother than yours. Lend an ear to others opinion. It \nteaches tolerance. Tolerance and appreciation are \nvirtues in socially healthy individuals. \nRole of family in inculcating social skills in young \nfamily members\nThe importance of family in inculcating social skills among, \nchildren is paramount. Guardians or parents are the prime \nteachers and caretakers who feed them healthy food and are \nalso their play mates. They have to be aware themselves to \nbe role model and make children appreciate as they grow.  \nThe benefits of enjoying nutritious food and being aware \nof a balanced diet is of paramount importance. Watching \nof television for longer duration is bad for students. \nParents themselves have to be cautious in what they do \nin front of children and how long they are in front of the \nTV. However, at the same time good TV programmes are \nan avenue for learning. Encourage them to indulge in \nphysical activity to build their muscles and bones. Fit body \nand fitness depends primarily on proper diet and healthy \nbody and mind. The parents and elder family members \nneed to guide them in social skills. Parents and elders \nhave to be accessible to children for necessary guidance.  \nThey  form a “safety network’. They are to guide adolescents \nthrough advice, answer their queries and occupy them \nthrough activities to keep them away from involvement \nin addictive substances like tobacco, drugs and alcohol \nwhich they might believe are helpful in tiding over stress. \nHowever, these substances have deleterious effects on the  \ngrowing body.\nChap-12.indd   211 8/24/2020   11:46:40 AM\n2024-25",
      "content_type": "text",
      "token_count": 623,
      "page_number": 5
    },
    {
      "id": "ad332259-6234-41c8-90f2-d8f7fc1aa766",
      "chapter_id": "62a07f75-04b7-4f4c-a7ec-1f70f2bf6b37",
      "chunk_index": 2,
      "content": "--- Page 8 ---\nHealtH and PHysical education - class X\n212\nWhat aRe life skills ?\nThese are —\n • Empathy: Is the ability to understand another’s feelings \nin a particular situation.\n • Self Awareness: Is the recognition of one’s character, \nstrengths, areas of growth, beliefs and values.\n • Effective Communication: Is having skills of \ncommunication that facilitate interaction with people \nin positive ways.\n • Interpersonal Relationships: Building relationships of \nfriendship and goodwill with all others.\n • Problem solving: Is the ability to resolve challenges.\n • Decision Making: Is the quality of analyzing problem to \nfind and act to reach an appropriate solution.\n • Creative thinking: Is the ability to do something in a \nnovel manner.\n • Critical Thinking: Is the capacity to analyse multiple \nperspectives and objectively evaluate the same.\n • Coping with Stress and emotional distress: These refer \nto management and regulation of one’s emotions and \nmoments of stress.\nAll these life skills help to develop desirable social health \nand live happily in a society.",
      "content_type": "exercise",
      "token_count": 269,
      "page_number": 7
    },
    {
      "id": "a9fc8694-5fac-440d-9aea-f755e39337a5",
      "chapter_id": "a2f0a51b-8a13-462d-b819-4d2a0db3d7b8",
      "chunk_index": 0,
      "content": "her students from engaging in socially unhealthy \npractices such as vindictive attitudes, selfishness, \njealousy and culture of hatred. For this, teacher has \nto sacrifice time and energy. It is however, necessary \nfor a teacher and school authorities to understand \nthat more than finishing the syllabus and passing \nexams, it is the teacher’s responsibility to build good \nhuman beings. Home has a large role to play but \nit has been the mission of teachers to contribute \ntowards grooming students into socially healthy \nadults",
      "content_type": "text",
      "token_count": 132,
      "page_number": 8
    },
    {
      "id": "e80c3293-e7c8-4beb-b928-af5c51e2a54b",
      "chapter_id": "a94be6c4-4ddf-4e0b-9940-0434449ad2d5",
      "chunk_index": 0,
      "content": "is to have a friendly, stress-free atmosphere in class. \nThis can happen if students are engaged in ‘group \nactivities’, especially activities for ‘experiential \nlearning’. Members of groups are reshuffled from \ntime to time for team activities so that students \nmay understand that it takes all kinds of people to \nmake the world and the socially healthy groups can \nlive in harmony despite differing in opinions. Group \nactivities build team spirit and remove boredom. \nChap-12.indd   212 8/24/2020   11:46:40 AM\n2024-25\n\n--- Page 9 ---\nSocial HealtH\n213\niDeas foR PRomoting  social health of \nstuDents",
      "content_type": "text",
      "token_count": 151,
      "page_number": 8
    },
    {
      "id": "f1c1ca16-b34b-4123-b451-8e0e3c91fa1d",
      "chapter_id": "c6733bd7-a643-4208-b2b7-1daa285e4dce",
      "chunk_index": 0,
      "content": "like fruits or fruit juices. School authorities should \nbe aware as to what is being sold for consumption \nimmediately outside school and permit only those \nselling healthy eatables or low fat and healthy \nsnacks.",
      "content_type": "text",
      "token_count": 53,
      "page_number": 8
    },
    {
      "id": "f269ceef-9d68-4169-a0e9-e7e92d0df46d",
      "chapter_id": "3436c173-52d2-4394-b505-b994afdde08c",
      "chunk_index": 0,
      "content": "with poor health conditions, bad teeth and weak \nvision. Organise health checks for them.",
      "content_type": "text",
      "token_count": 22,
      "page_number": 8
    },
    {
      "id": "65fbc931-9185-41a9-adee-cbbe9d9e5697",
      "chapter_id": "437f61b9-b0cb-4dda-83eb-d4585d0e4b14",
      "chunk_index": 0,
      "content": "participation of maximum number of students, and \ntraining them leadership as well as team spirit.",
      "content_type": "text",
      "token_count": 24,
      "page_number": 8
    },
    {
      "id": "2a6f8e86-af48-4c26-847f-f879d89c0e35",
      "chapter_id": "c15b1a22-437a-4a56-a90a-05e8756b6c0d",
      "chunk_index": 0,
      "content": "and finally, a sport day and prize distribution for \nencouragement.",
      "content_type": "text",
      "token_count": 16,
      "page_number": 8
    },
    {
      "id": "1000fa08-770f-44b3-8799-811b326f397b",
      "chapter_id": "2223e1d7-813a-4f73-a72f-b8c734d08e34",
      "chunk_index": 0,
      "content": "table.",
      "content_type": "text",
      "token_count": 1,
      "page_number": 8
    },
    {
      "id": "b7eee3c5-85f3-4e3a-9e17-90bbb1427ccb",
      "chapter_id": "65d6229d-a5fd-49c1-8f35-9cdb074b3dc9",
      "chunk_index": 0,
      "content": "even guardians who have not learnt social skills \nand have unhealthy habits may learn through their \nparticipation. It shall be community service by \nthe school and a means to encourage everyone to \nundertake healthy living.",
      "content_type": "text",
      "token_count": 56,
      "page_number": 8
    },
    {
      "id": "f6c6f61f-7311-40d4-b788-b0f5f52352a0",
      "chapter_id": "19705617-871d-41da-82e2-1398f3431e22",
      "chunk_index": 0,
      "content": "allow voluntary participation in games using school \nequipment.",
      "content_type": "text",
      "token_count": 15,
      "page_number": 9
    },
    {
      "id": "4de08a62-4c18-4e51-b2df-e7fbb4382119",
      "chapter_id": "72b7f790-cecc-43bd-aa6b-a3df7627c525",
      "chunk_index": 0,
      "content": "Karate for self-defense and utilise school premises for \nthe same.",
      "content_type": "text",
      "token_count": 16,
      "page_number": 9
    },
    {
      "id": "21b0a968-06f3-4f9e-8b7f-4268554f6cc0",
      "chapter_id": "26fe15e5-7ec7-46be-83a9-16920d554b05",
      "chunk_index": 0,
      "content": "learn to love and respect all living beings, plants and \nanimals.",
      "content_type": "text",
      "token_count": 16,
      "page_number": 9
    },
    {
      "id": "686a1365-8c38-4149-8556-ac94715b2c37",
      "chapter_id": "100febb2-5e08-4a8f-ae4e-9e65e54b4cfe",
      "chunk_index": 0,
      "content": "be adopted, which helps children to interact with \nstudents of other classes too.",
      "content_type": "text",
      "token_count": 20,
      "page_number": 9
    },
    {
      "id": "c70b6885-5885-4ebb-9e79-f6d79c9365e8",
      "chapter_id": "387ca175-4ca4-453c-b907-87c821d2d258",
      "chunk_index": 0,
      "content": "messages.\nIn this manner students, teachers, parents and community \nwill realise the benefits of being physically, mentally and \nsocially healthy. And what a great way it will be to build a \nhealthy nation!\nChap-12.indd   213 8/24/2020   11:46:40 AM\n2024-25\n\n--- Page 10 ---\nHealtH and PHysical education - class X\n214\nassessment\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 91,
      "page_number": 9
    },
    {
      "id": "0d2d9fdf-e7df-467b-964a-b9601155af99",
      "chapter_id": "392ee17b-e6ae-422d-b45b-efad48d68fa9",
      "chunk_index": 0,
      "content": "a) Health\n  b) Mental health\n  c) Social health",
      "content_type": "text",
      "token_count": 11,
      "page_number": 9
    },
    {
      "id": "297037d7-6fb4-4d90-813f-a630940a2ed8",
      "chapter_id": "c9589e09-4e14-4487-af72-08c9c008aad5",
      "chunk_index": 0,
      "content": "children by each of the following —\n  a) School\n  b) Teachers\n  c) Family",
      "content_type": "text",
      "token_count": 18,
      "page_number": 9
    },
    {
      "id": "bdf4ff1e-440d-49c8-aed8-7d2ccb58854e",
      "chapter_id": "40c3b57b-922f-45ff-be91-ebe0d5f4f9fa",
      "chunk_index": 0,
      "content": "are socially healthy?\nChap-12.indd   214 8/24/2020   11:46:40 AM\n2024-25",
      "content_type": "text",
      "token_count": 18,
      "page_number": 9
    }
  ]
}