{
  "textbook": {
    "id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
    "file_name": "Class X Health and PE - Ch 00 - GrowinG up durinG Adolescence.pdf",
    "title": "GrowinG up durinG Adolescence",
    "grade": 10,
    "subject": "Class X Health and PE",
    "total_pages": 12,
    "file_size_mb": 1.5086336135864258,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:39.515206",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Health and PE/Class X Health and PE - Ch 00 - GrowinG up durinG Adolescence.pdf"
  },
  "chapters": [
    {
      "id": "5555ab15-5715-4822-867c-ca8366b8956d",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 1,
      "title": "1. Increase in height",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "and weight"
    },
    {
      "id": "de5e017d-4587-48fc-ac67-ddbc942517ed",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 4,
      "title": "4. Growth of hair on",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "private parts"
    },
    {
      "id": "fcbe4088-e154-46d9-a89b-e19ad61bce11",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 5,
      "title": "5. Widening of",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "shoulders"
    },
    {
      "id": "d274199b-0a01-4440-85e5-a80e1ee4dece",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 7,
      "title": "7. Development of",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "breasts"
    },
    {
      "id": "31a106f2-d068-4130-ae54-c1e00158f670",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 8,
      "title": "8. Sweat and oil glands",
      "topics": [],
      "start_page": 4,
      "end_page": 9,
      "content": "become active\nwet dreAms\nWet dreams are a normal and natural physiological process \nwhich starts during adolescence among boys. It usually \noccurs during sleep. Wet dreams is a discharge of semen \n(seminal fluid) containing sperms. Many adolescent boys are \nusually not aware of this phenomenon and get worried when \nthey face this situation first time.\nSemen is the fluid formed by glands associated with male \nreproductive system. Semen carries mature sperms formed \nin the testes.\nRead the following case studies which confirm the \nuniqueness of every individual with regard to time of \noccurrence of changes during adolescence.\nCASE 1: My father calls me ‘Sher’\nRakesh and Dibang, students of Class IX, are walking home \ntogether from school. Rakesh begins to tease Dibang, saying \nthat he speaks in a girl’s voice. He also laughs at the fact \nthat Dibang has got no hair on his upper lip. “Look at me,” \nRakesh says, “I am a real man. My voice is strong and my \nface is manly - I have so much facial hair. My father calls me \nsher.” Dibang wonders what is wrong with him. He recalls \nthat his mother still calls him ‘my sweet boy’. He decides \nto go home and ask his mother why he is so different from \nRakesh and whether something is wrong with him.\nPoints for Discussion\n a) What do you think Dibang felt with Rakesh’s remarks?\n b) Do you think that there is something wrong with \nDibang? Why?\nChap-3.indd   26 8/24/2020   4:15:39 PM\n2024-25\n\n--- Page 5 ---\nGrowth and development durinG adolescence\n27\n c) What should Dibang’s mother tell him?\n d) Do you think it is important to prepare children \nregarding the  changes likely to occur in them? Why?\nCASE 2: Each one is unique\nPooja, Sujatha, Abida and Radha are good friends. All of \nthem are 13 years old and love to spend time with one \nanother. They have so much to talk about, a new film, a \nnew dress, home work, the boys in the class and just about \neverything.\nYesterday, Radha seemed uncomfortable. She was \nhaving her periods and was concerned about staining her \nuniform. Last month, Sujatha’s family had organised a big \ncelebration in her honour as she had started her periods. \nPooja recalled that three months ago, Abida had started her \nperiods in school and had to borrow a sanitary napkin from \nher older cousin. Except Pooja, all her friends have started \ntheir periods. Is there something wrong with her?\nPoints for Discussion\n a) What do you think Pooja felt when she realised that \nshe is the only one who had not started her periods?\n b) Do you think there is something wrong with Pooja?\n c) If Pooja came to you for advice, what would you tell \nher as a peer?\n d) Do you think it is important to prepare children \nregarding the changes likely to occur in them? Why?\nCASE 3: Puberty in boys\nSuresh heard from someone that wet dream (nocturnal \nemission) causes weakness. When Naresh who is Suresh’s \nbest friend first experienced wet dream, he confided in \nSuresh. Suresh encouraged Naresh to visit the nearest \nHealth Centre to have a discussion about wet dream with \nthe doctor.\nPoints for Discussion\n a) Do you think something is wrong with Naresh?\n b) According to you, the advice given by Suresh is \ncorrect or not?\n c) What are the myths associated with wet dream?\n d) What advice was given by the doctor to Naresh?\n • Adolescence is a period of physical and emotional \nchanges which are triggered by a set of hormones. \nThese changes are part of growing up.\n • These changes occur at different times for different \nindividuals.\nChap-3.indd   27 8/24/2020   4:15:39 PM\n2024-25\n\n--- Page 6 ---\nHealtH and PHysical education - class X\n28\n • You should not compare your physical changes with \nothers – the pace at which changes take place differ \nfrom person to person.\n • It is natural to feel awkward or conscious of the changes \nthat occur but try to support each other by accepting \nthese as part of a natural process and don’t let these \ndecrease your self-confidence.\n • If you have any doubts or concerns about changes that \nare occurring to you reach out to a trusted adult or \nyou can talk to a counsellor in the adolescent friendly \nHealth Clinic near where you live.\n • Many young boys due to feeling of shame visit quacks \nand waste lot of time and money. It is best to visit the \ndoctor or the health centre. One can discuss the myths \nrelated to growing up with a trusted person (teacher, \nparents, friends).\n • There is a myth that wet dream causes weakness among \nthe males because semen is lost from the body. However \nit is not so, semen and sperms are continuously made \nin the testes and semen lost during wet dream gets \nreplaced very soon.\nmenstru Ation\nThe first menstruation is termed as menarche. In India, age \nof menarche is 12-13 years but may vary from individual to \nindividual. Menstruation generally stops between the age of \n45 and 55 years and is termed as menopause. Menopausal age \nvaries in different individuals. Age of menarche has decreased \ndue to various lifestyle changes. Menstruation hygiene and \ncleanliness is very important. Points to remember —\n • Regular bath and washing self properly are important \nfor avoiding infections, especially during menstruation.\n • Change undergarment regularly (at least once a day) \nand avoid synthetic cloth.\n • During menstruation, cloth, cloth pads or napkins should \nbe changed after every four to six hours to avoid infection.\n • One can also use sanitary napkins to manage \nmenstrual hygiene. Many girls and women also make \nsanitary napkins at home with old cloth and cotton. If \none makes a sanitary napkin at home, use only clean, \nsoft cotton cloth. Do not use old cloth that may have \nany metal or plastic parts in it like glitter, gota or hooks \nand buttons. This may hurt or cause infection.\n • If a cloth is used again as pad, it should be washed \nthoroughly with soap and dried in sun before next use \nas sunlight is an excellent disinfectant. Do not use dirty \nor damp cloth as it causes infections.\nChap-3.indd   28 8/24/2020   4:15:39 PM\n2024-25\n\n--- Page 7 ---\nGrowth and development durinG adolescence\n29\n • Child With Special Need (CWSN) should be shown the \nprocess of maintaining hygiene or explained in detail  \nif necessary. \n • Sanitary pads should be wrapped in paper and disposed \nin trash bins or buried deep in a pit. Some schools have \nIncinerators which offer another safe way to dispose \nsanitary pads. There should be no shame attached in \nthe process of disposing sanitary pads.\nGovernment is supporting schemes for promoting menstrual \nhygiene among adolescent girls (10-19 years). Sanitary \nnapkins are made available in schools or by ASHAs at a  \nsubsidised rate.\npsychosoci Al chAnGes durinG Adolescence\nPsychosocial changes mean changes in thoughts, mood, \nattractions and friendships. The word ‘social’ is associated \nwith the word ‘society’. As adolescence sets in, a boy or girl \nbecomes psychologically aware of self and society. As a result, \nthe adolescents build their own image and personality. This \ngives confidence to the adolescent to move in the society.\nAdolescence is a transitional phase between childhood and \nadulthood. During this transitional period the adolescents \nget confused regarding their emerging role in the family \nand society at large. The physical changes in adolescents \nare accompanied by psychosocial changes. Adolescents get \nattracted towards opposite sex or become part of a peer \ngroup. Such changes tend to make them more dependent on \nthe peer group in neighborhood, among classmates, etc. This \noften creates stressful relationships with parents, teachers \nand elders. Sometimes these developments may make them \ninsecure about future. Adolescents who become aware of \nthese changes, overcome this phase comfortably. \nThe social changes are reflected in the behavior of \nadolescents with peers and parents. They differ from parents \non many issues and develop the confidence to express \ntheir own opinion emphatically if parents are friendly and \nunderstanding.  Adolescents are more friendly with their \npeer group. However belonging to a vulnerable age group, \nadolescents may feel pressurised under the influence of \npeers.  Everyone feels the need to have friends but during \nadolescence the need for friendship is more pronounced.  \nThe friendship may be with a peer or relative of one’s own \nage and someone of own sex or the other sex. It is, therefore, \nimportant for them to identify with whom they can share \ntheir ideas and identify ‘safety net’ in friends, parents and \nteachers. \nActivity 3.2\nSome psychological \nchanges that occur in an \nadolescent are mentioned \nhere. Write one or two \nsentences regarding them \nfrom your own experience. \nYou may quote incidents \ninvolving others of your \nage.\n • Developing a sense of \nidentity. \n • Distancing from parents.\n • Closeness with peers.\n • Curiosity for gaining \nknowledge.\n • Experimentation\nChap-3.indd   29 8/24/2020   4:15:39 PM\n2024-25\n\n--- Page 8 ---\nHealtH and PHysical education - class X\n30\nAdolescent  or teenAGe preGnAncy\nAn adolescent is capable of reproduction. However, the \nreproductive maturity is reached only when a teenager is fully \ndeveloped physically and physiologically. In India, because \nof early marriage, there are large number of adolescents or \nteenage pregnancies. If pregnancy occurs before reaching \ncomplete reproductive maturity, girls may risk their own \nhealth and that of the fetus (developing embryo).\nRisks involved in adolescent pregnancy are mentioned  \nbelow —\n • An adolescent mother is not mentally prepared for \nmotherhood.\n • An adolescent mother is likely to be anemic. \n • An adolescent mother is more prone towards maternal \ndeath while giving birth.\n • Infant death are more among teenage mothers.\n • There is likelihood of developing complications during \ngiving birth.\n • The baby born from teenage mother requires greater \ncare which the teenage mother may not be able to give.\n • The reproductive tract may be damaged during \nchildbirth.\n • Early pregnancy and motherhood delays development \nof education and career of adolescent mother.\n • There may be economic problems and also problems \ndue to psychological immaturity of the adolescent \nmother. This may hamper proper care of the infant.\nActivity 3.3\nRead the case study given below. Think and answer the questions \nthat follow. \nRahul’s grandmother and Sangeeta’s grandmother were great \nfriends. When Rahul grew up, his grandmother would often ask \nhim to drop Sangeeta at her home. As a result Rahul and Sangeeta \ndeveloped a liking for each other. When Sangeeta turned sixteen, \nthe grandmothers insisted that Rahul and Sangeeta be married \noff as they were developing a relationship and that people would \ntalk about it. Rahul was in college and Sangeeta had yet to \nfinish school when they got married. After six months Sangeeta \ndiscovered that she was pregnant. Sangeeta was sad as she had \ndreams of pursuing higher studies and a career.\n1.\n Were Rahul and Sangeeta right in agreeing \nto get married? \nGive reasons for your answer."
    },
    {
      "id": "d7cad5f2-b386-467b-8536-c7e4153ed91d",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 9,
      "title": "2. Do you think the adverse consequence of teenage marriage",
      "topics": [],
      "start_page": 9,
      "end_page": 13,
      "content": "was greater on Sangeeta than on Rahul? Give reasons for your \nanswer.\n3.\n What would you have done, if you were in Rahul or Sangeeta’s \nsituation?\nChap-3.indd   30 8/24/2020   4:15:39 PM\n2024-25\n\n--- Page 9 ---\nGrowth and development durinG adolescence\n31\nVitAl stAtistics  And Functions  oF the Body\nAs you grow in years, you grow in size with increased length \nand circumference of body parts till you are a full-fledged \nadult of age 19. While you must maintain hygiene of all \nexternal parts, the internal organs also have to function \nnormally. You know that certain vital functions of the body \nfor enjoying good health are maintenance of blood pressure, \npulse rate, respiratory rate, etc. Some ways of assessing \nthe vital functions and statistics of human beings are  \ngiven below. \nBlood pressure (BP) and its measurement\nPressure exerted \nby blood on the \nwall of the arteries \nis called blood \npressure. When \nthe heart \ncontracts, blood \nsurges through \naorta, BP is \nhighest (Systolic \nPressure) \npressure \nof blood on the arterial wall recorded when ventricles relax is \nlowest (Diastolic Pressure).\nThe pressure wave \nalong the arteries with \neach heartbeat can be \nfelt at the pulse. Blood \npressure is measured \nby the instrument \ncalled “Sphygmoma-\nnometer”. Diastolic \nand Systolic pressure \nis measured and in a \nnormal healthy young \nadult it is 110/75, \nwhich means 110 \nmm Hg systolic and \n75 mm Hg diastolic. \nSphygmomanometer \nconsists of cuff with \nan inflatable bladder which is wrapped around a person’s up-\nper arm and a rubber bulb inflates the bladder. An attached \ndevice indicates the blood pressure. There is now a digital de -\nvice which is also used for measuring the BP. BP increases \nwith age to about 130/90mm Hg. Abnormally high BP is called \nhypertension. \nFig. 3.1: Checking blood pressure\nFig. 3.3: Sphygmomanometer\nActivity 3.4\nMeasuring mid-arm \nCircumference\nBiceps is the muscle of  \nmid arm.\nPlace the beginning of the \ntapes in the middle of the \nbiceps (midway between \nshoulder and elbow joint) \ntake the reading and \nrecord it. When you do \nthis in a group, record the \ncircumference of all the \nstudents of the group and \nobserve the variation.\nFig. 3.2: Measuring mid-arm \ncircumference\nChap-3.indd   31 8/24/2020   4:15:40 PM\n2024-25\n\n--- Page 10 ---\nHealtH and PHysical education - class X\n32\nCalculate your Body Mass Index (BMI)\nBMI can be calculated by adopting the following formula. \nDivide your weight by square of your height.\nBMI =\nweight (kg)\nheight (m)\n2\n • If you measured your weight in kg then measure height \nin meters. \n • Normal BMI Range = 18 to 25.\n • Overweight = more than 25 and less then 29.\n • Obese = more than 30.\nExamination of conjunction \nThe conjunction is a transparent membrane over the eye.  \nA smooth shiny moist conjunction is normal. If red or thick or \ncovered by a secretion or foreign body, it requires immediate \nmedical attention or consultation of a eye doctor. \nTongue examination\nNutritional deficiencies, infections, dysfunction of nerves or \neven cancer can be detected by examining the tongue.\nSome key characteristic features of a tongue in normal \ncondition can be noted by physical examination. These are —\n (i) Colour: Pink red on both upper and lower surface. On \nlower surface blood vessels may be seen.\n (ii) Texture: Rough on upper surface due to presence of \npapillae or taste buds. Hair, farrows or ulceration \nindicates dysfunction.\n (iii) Size: If not swollen, tongue will fit comfortably inside \nthe mouth. The tongue can be examined by the \nfollowing steps —\n • Make tip of tongue touch roof of mouth to inspect \nventral surface.\n • When protruded out, colour and texture can be \nnoted for any deviation.\n • Use gauze to hold protruded tongue (wearing \ngloves) between tongue and index figure and fill \nthe fender areas.\nExamining nail bed\nNail bed also needs direct physical examination. Nail plate \nsurface discolouration, abnormal cuticle, nail fold or nail \nshape require inspection. Loss of nails and lesions around \nnails, need medical attention.\nActivity 3.6\nAt the exit gate of Nehru \nPlace Metro Station in \nNew Delhi, there is a \nprovision for measuring \nheight and weight and \nalso to calculate BMI for \n10 rupees. Find out where \nelse measurement of BMI \nis available. Do you have \nthis in your school?\n • My Height =\n • My Weight =\n • My BMI=\nNormal, Overweight, obese. \nTick whichever is relevant\nActivity 3.5\nMeasuring height\n • Take your own height \nat intervals as you \ngrow. You have learnt \nthat your height at \nage 19 is almost the \nmaximum height that \nyou shall attain. Do \nthis with your friends \nand try to figure out the \nreasons for variations. \nYou need only an inch \ntape for this.\n • Go to a clinic or any \nmedical practitioner \nand see the working \nof the Sphygmoma-\nnometer. Collect data \nfrom persons where \nBP is checked. Analyse \nthe variations and the  \nreasons.\nChap-3.indd   32 8/24/2020   4:15:40 PM\n2024-25\n\n--- Page 11 ---\nGrowth and development durinG adolescence\n33\nPharmacology and its impact on the body\nPharmacology deals with biological effects of drugs. Drugs \nare chemical substances used for healing, curing diseases, \nslowing them or preventing diseases.\nEffects\nTherapeutic desired actions for cure are —\n • Stimulating or inhibited cell function \n • Blocking biochemical of tissues\n • Anti histamicric  (anti allergic)\n • Laxative (reasoning constipation)\nUnwanted effects\nSide effects are —\n • Dry mouth or dangerous effects on tissues\n • Damage or toxicity or excessive bleeding  are some \neffects of drugs used as medicine \nPrevention\nNever buy medicines over the counter (OTC) without Doctor’s \nprescription with dosage and instruction written.\n • Unusual responses are reasons for harmful effects of \ndrugs \n • Medication error or overdose\nChap-3.indd   33 8/24/2020   4:15:40 PM\n2024-25\n\n--- Page 12 ---\nHealtH and PHysical education - class X \n34\nAssessment\n I. Fill in the Blanks "
    },
    {
      "id": "9580b17c-0d6e-42b9-8f08-577c04c77925",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 12,
      "title": "3. Five changes occuring in boys and girls during adolescence are",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "____________, ___________, ______________, _____________ and \n____________.\n II. Choose the Correct Option"
    },
    {
      "id": "14c1f12f-85e1-4931-896a-4b69ff01d23b",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 13,
      "title": "1. Proper hygiene should be practised during adolescence.",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": " (Yes/No/Don’t know)"
    },
    {
      "id": "b1eba4e4-b205-46f8-8d00-cc269d1f0872",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 15,
      "title": "3. Government is supporting schemes for promoting menstrual",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "hygiene among adolescent girls. (Yes/No/Don’t know)"
    },
    {
      "id": "9ece277b-0471-458f-a086-ed1c05556fdf",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 16,
      "title": "4. The adolescents begin to be extremely conscious of their physical",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "appearance once secondary sexual characteristics begin to \ndevelop. (Yes/No/Don’t know)"
    },
    {
      "id": "0881922c-735a-415f-8e8f-7199577b00b8",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 17,
      "title": "5. The adolescents begin to develop a strong sense of identity due to",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "increased mental development. (Yes/No/Don’t know)"
    },
    {
      "id": "94d610e6-fe2f-4637-85a5-8f41e4ee57c0",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 18,
      "title": "6. Early pregnancy may end in damaged reproductive tract in girls.",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "  (Yes/No/Don’t know)"
    },
    {
      "id": "cd8aebbe-c17f-4b8a-bbf8-483c35f7faa4",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 19,
      "title": "7. Physical growth spurt during adolescence is embarrassing.",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": " (Yes/No/Don’t know)"
    },
    {
      "id": "dc23e3fb-fbf1-40fb-8011-f0528ec3332a",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 20,
      "title": "8. Change of voice in boys is a sign of adolescence.",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": " (Yes/No/Don’t know)\n III. Answer the following Questions"
    },
    {
      "id": "7a71a78d-7a14-44f6-949b-6da9f2d71f08",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 21,
      "title": "1. What are the health and educational implications of adolescent",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "pregnancy?"
    },
    {
      "id": "378aba58-2a7f-4993-8bd5-89f1ecaf3474",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 22,
      "title": "2. Write down the process of the —",
      "topics": [],
      "start_page": 13,
      "end_page": 14,
      "content": " (i) mid-arm circumference.\n (ii) measurement of height.\n (iii) body mass index.\n (iv) tongue examination.\n (v) examination the nail beds. "
    },
    {
      "id": "a40eb6b4-ced3-4bbb-8568-e4a23082ef50",
      "textbook_id": "4f499798-ad1e-40f2-8fd6-5bb12e3f4a95",
      "chapter_number": 23,
      "title": "3. Write a short note on pharmacology.",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "Chap-3.indd   34 8/24/2020   4:15:40 PM\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "4174d0d6-5271-421f-9ca7-ade5e7e3711a",
      "chapter_id": "5555ab15-5715-4822-867c-ca8366b8956d",
      "chunk_index": 0,
      "content": "and weight",
      "content_type": "text",
      "token_count": 2,
      "page_number": 4
    },
    {
      "id": "e382fc96-f12c-4e61-b213-b648a101488e",
      "chapter_id": "de5e017d-4587-48fc-ac67-ddbc942517ed",
      "chunk_index": 0,
      "content": "private parts",
      "content_type": "text",
      "token_count": 3,
      "page_number": 4
    },
    {
      "id": "117c071e-f10c-460b-b9bc-9a0136bb04a8",
      "chapter_id": "fcbe4088-e154-46d9-a89b-e19ad61bce11",
      "chunk_index": 0,
      "content": "shoulders",
      "content_type": "text",
      "token_count": 2,
      "page_number": 4
    },
    {
      "id": "8ad0ce9a-cd23-4e5d-8c44-3464781fc7eb",
      "chapter_id": "d274199b-0a01-4440-85e5-a80e1ee4dece",
      "chunk_index": 0,
      "content": "breasts",
      "content_type": "text",
      "token_count": 1,
      "page_number": 4
    },
    {
      "id": "97ba6b9c-2331-4f90-adfc-5bd64fae8740",
      "chapter_id": "31a106f2-d068-4130-ae54-c1e00158f670",
      "chunk_index": 0,
      "content": "become active\nwet dreAms\nWet dreams are a normal and natural physiological process \nwhich starts during adolescence among boys. It usually \noccurs during sleep. Wet dreams is a discharge of semen \n(seminal fluid) containing sperms. Many adolescent boys are \nusually not aware of this phenomenon and get worried when \nthey face this situation first time.\nSemen is the fluid formed by glands associated with male \nreproductive system. Semen carries mature sperms formed \nin the testes.\nRead the following case studies which confirm the \nuniqueness of every individual with regard to time of \noccurrence of changes during adolescence.\nCASE 1: My father calls me ‘Sher’\nRakesh and Dibang, students of Class IX, are walking home \ntogether from school. Rakesh begins to tease Dibang, saying \nthat he speaks in a girl’s voice. He also laughs at the fact \nthat Dibang has got no hair on his upper lip. “Look at me,” \nRakesh says, “I am a real man. My voice is strong and my \nface is manly - I have so much facial hair. My father calls me \nsher.” Dibang wonders what is wrong with him. He recalls \nthat his mother still calls him ‘my sweet boy’. He decides \nto go home and ask his mother why he is so different from \nRakesh and whether something is wrong with him.\nPoints for Discussion\n a) What do you think Dibang felt with Rakesh’s remarks?\n b) Do you think that there is something wrong with \nDibang? Why?\nChap-3.indd   26 8/24/2020   4:15:39 PM\n2024-25",
      "content_type": "text",
      "token_count": 362,
      "page_number": 4
    },
    {
      "id": "274b6b77-a6b6-4612-a47b-f325e3bbe263",
      "chapter_id": "31a106f2-d068-4130-ae54-c1e00158f670",
      "chunk_index": 1,
      "content": "--- Page 5 ---\nGrowth and development durinG adolescence\n27\n c) What should Dibang’s mother tell him?\n d) Do you think it is important to prepare children \nregarding the  changes likely to occur in them? Why?\nCASE 2: Each one is unique\nPooja, Sujatha, Abida and Radha are good friends. All of \nthem are 13 years old and love to spend time with one \nanother. They have so much to talk about, a new film, a \nnew dress, home work, the boys in the class and just about \neverything.\nYesterday, Radha seemed uncomfortable. She was \nhaving her periods and was concerned about staining her \nuniform. Last month, Sujatha’s family had organised a big \ncelebration in her honour as she had started her periods. \nPooja recalled that three months ago, Abida had started her \nperiods in school and had to borrow a sanitary napkin from \nher older cousin. Except Pooja, all her friends have started \ntheir periods. Is there something wrong with her?\nPoints for Discussion\n a) What do you think Pooja felt when she realised that \nshe is the only one who had not started her periods?\n b) Do you think there is something wrong with Pooja?\n c) If Pooja came to you for advice, what would you tell \nher as a peer?\n d) Do you think it is important to prepare children \nregarding the changes likely to occur in them? Why?\nCASE 3: Puberty in boys\nSuresh heard from someone that wet dream (nocturnal \nemission) causes weakness. When Naresh who is Suresh’s \nbest friend first experienced wet dream, he confided in \nSuresh. Suresh encouraged Naresh to visit the nearest \nHealth Centre to have a discussion about wet dream with \nthe doctor.\nPoints for Discussion\n a) Do you think something is wrong with Naresh?\n b) According to you, the advice given by Suresh is \ncorrect or not?\n c) What are the myths associated with wet dream?\n d) What advice was given by the doctor to Naresh?\n • Adolescence is a period of physical and emotional \nchanges which are triggered by a set of hormones. \nThese changes are part of growing up.\n • These changes occur at different times for different \nindividuals.\nChap-3.indd   27 8/24/2020   4:15:39 PM\n2024-25",
      "content_type": "text",
      "token_count": 528,
      "page_number": 4
    },
    {
      "id": "dc4e10d8-ef55-4f21-9f92-32fd48f5cb7b",
      "chapter_id": "31a106f2-d068-4130-ae54-c1e00158f670",
      "chunk_index": 2,
      "content": "--- Page 6 ---\nHealtH and PHysical education - class X\n28\n • You should not compare your physical changes with \nothers – the pace at which changes take place differ \nfrom person to person.\n • It is natural to feel awkward or conscious of the changes \nthat occur but try to support each other by accepting \nthese as part of a natural process and don’t let these \ndecrease your self-confidence.\n • If you have any doubts or concerns about changes that \nare occurring to you reach out to a trusted adult or \nyou can talk to a counsellor in the adolescent friendly \nHealth Clinic near where you live.\n • Many young boys due to feeling of shame visit quacks \nand waste lot of time and money. It is best to visit the \ndoctor or the health centre. One can discuss the myths \nrelated to growing up with a trusted person (teacher, \nparents, friends).\n • There is a myth that wet dream causes weakness among \nthe males because semen is lost from the body. However \nit is not so, semen and sperms are continuously made \nin the testes and semen lost during wet dream gets \nreplaced very soon.\nmenstru Ation\nThe first menstruation is termed as menarche. In India, age \nof menarche is 12-13 years but may vary from individual to \nindividual. Menstruation generally stops between the age of \n45 and 55 years and is termed as menopause. Menopausal age \nvaries in different individuals. Age of menarche has decreased \ndue to various lifestyle changes. Menstruation hygiene and \ncleanliness is very important. Points to remember —\n • Regular bath and washing self properly are important \nfor avoiding infections, especially during menstruation.\n • Change undergarment regularly (at least once a day) \nand avoid synthetic cloth.\n • During menstruation, cloth, cloth pads or napkins should \nbe changed after every four to six hours to avoid infection.\n • One can also use sanitary napkins to manage \nmenstrual hygiene. Many girls and women also make \nsanitary napkins at home with old cloth and cotton. If \none makes a sanitary napkin at home, use only clean, \nsoft cotton cloth. Do not use old cloth that may have \nany metal or plastic parts in it like glitter, gota or hooks \nand buttons. This may hurt or cause infection.\n • If a cloth is used again as pad, it should be washed \nthoroughly with soap and dried in sun before next use \nas sunlight is an excellent disinfectant. Do not use dirty \nor damp cloth as it causes infections.\nChap-3.indd   28 8/24/2020   4:15:39 PM\n2024-25",
      "content_type": "text",
      "token_count": 615,
      "page_number": 4
    },
    {
      "id": "9b501d26-b8e7-4f08-af4a-84463b695e1f",
      "chapter_id": "31a106f2-d068-4130-ae54-c1e00158f670",
      "chunk_index": 3,
      "content": "--- Page 7 ---\nGrowth and development durinG adolescence\n29\n • Child With Special Need (CWSN) should be shown the \nprocess of maintaining hygiene or explained in detail  \nif necessary. \n • Sanitary pads should be wrapped in paper and disposed \nin trash bins or buried deep in a pit. Some schools have \nIncinerators which offer another safe way to dispose \nsanitary pads. There should be no shame attached in \nthe process of disposing sanitary pads.\nGovernment is supporting schemes for promoting menstrual \nhygiene among adolescent girls (10-19 years). Sanitary \nnapkins are made available in schools or by ASHAs at a  \nsubsidised rate.\npsychosoci Al chAnGes durinG Adolescence\nPsychosocial changes mean changes in thoughts, mood, \nattractions and friendships. The word ‘social’ is associated \nwith the word ‘society’. As adolescence sets in, a boy or girl \nbecomes psychologically aware of self and society. As a result, \nthe adolescents build their own image and personality. This \ngives confidence to the adolescent to move in the society.\nAdolescence is a transitional phase between childhood and \nadulthood. During this transitional period the adolescents \nget confused regarding their emerging role in the family \nand society at large. The physical changes in adolescents \nare accompanied by psychosocial changes. Adolescents get \nattracted towards opposite sex or become part of a peer \ngroup. Such changes tend to make them more dependent on \nthe peer group in neighborhood, among classmates, etc. This \noften creates stressful relationships with parents, teachers \nand elders. Sometimes these developments may make them \ninsecure about future. Adolescents who become aware of \nthese changes, overcome this phase comfortably. \nThe social changes are reflected in the behavior of \nadolescents with peers and parents. They differ from parents \non many issues and develop the confidence to express \ntheir own opinion emphatically if parents are friendly and \nunderstanding.  Adolescents are more friendly with their \npeer group. However belonging to a vulnerable age group, \nadolescents may feel pressurised under the influence of \npeers.  Everyone feels the need to have friends but during \nadolescence the need for friendship is more pronounced.  \nThe friendship may be with a peer or relative of one’s own \nage and someone of own sex or the other sex. It is, therefore, \nimportant for them to identify with whom they can share \ntheir ideas and identify ‘safety net’ in friends, parents and \nteachers. \nActivity 3.2\nSome psychological \nchanges that occur in an \nadolescent are mentioned \nhere. Write one or two \nsentences regarding them \nfrom your own experience. \nYou may quote incidents \ninvolving others of your \nage.\n • Developing a sense of \nidentity. \n • Distancing from parents.\n • Closeness with peers.\n • Curiosity for gaining \nknowledge.\n • Experimentation\nChap-3.indd   29 8/24/2020   4:15:39 PM\n2024-25",
      "content_type": "text",
      "token_count": 730,
      "page_number": 4
    },
    {
      "id": "17409d44-44a0-45a8-bf4d-1750eb37d171",
      "chapter_id": "31a106f2-d068-4130-ae54-c1e00158f670",
      "chunk_index": 4,
      "content": "--- Page 8 ---\nHealtH and PHysical education - class X\n30\nAdolescent  or teenAGe preGnAncy\nAn adolescent is capable of reproduction. However, the \nreproductive maturity is reached only when a teenager is fully \ndeveloped physically and physiologically. In India, because \nof early marriage, there are large number of adolescents or \nteenage pregnancies. If pregnancy occurs before reaching \ncomplete reproductive maturity, girls may risk their own \nhealth and that of the fetus (developing embryo).\nRisks involved in adolescent pregnancy are mentioned  \nbelow —\n • An adolescent mother is not mentally prepared for \nmotherhood.\n • An adolescent mother is likely to be anemic. \n • An adolescent mother is more prone towards maternal \ndeath while giving birth.\n • Infant death are more among teenage mothers.\n • There is likelihood of developing complications during \ngiving birth.\n • The baby born from teenage mother requires greater \ncare which the teenage mother may not be able to give.\n • The reproductive tract may be damaged during \nchildbirth.\n • Early pregnancy and motherhood delays development \nof education and career of adolescent mother.\n • There may be economic problems and also problems \ndue to psychological immaturity of the adolescent \nmother. This may hamper proper care of the infant.\nActivity 3.3\nRead the case study given below. Think and answer the questions \nthat follow. \nRahul’s grandmother and Sangeeta’s grandmother were great \nfriends. When Rahul grew up, his grandmother would often ask \nhim to drop Sangeeta at her home. As a result Rahul and Sangeeta \ndeveloped a liking for each other. When Sangeeta turned sixteen, \nthe grandmothers insisted that Rahul and Sangeeta be married \noff as they were developing a relationship and that people would \ntalk about it. Rahul was in college and Sangeeta had yet to \nfinish school when they got married. After six months Sangeeta \ndiscovered that she was pregnant. Sangeeta was sad as she had \ndreams of pursuing higher studies and a career.\n1.\n Were Rahul and Sangeeta right in agreeing \nto get married? \nGive reasons for your answer.",
      "content_type": "exercise",
      "token_count": 527,
      "page_number": 9
    },
    {
      "id": "58054bf1-728a-46d9-a6c7-18ef3888e29c",
      "chapter_id": "d7cad5f2-b386-467b-8536-c7e4153ed91d",
      "chunk_index": 0,
      "content": "was greater on Sangeeta than on Rahul? Give reasons for your \nanswer.\n3.\n What would you have done, if you were in Rahul or Sangeeta’s \nsituation?\nChap-3.indd   30 8/24/2020   4:15:39 PM\n2024-25\n\n--- Page 9 ---\nGrowth and development durinG adolescence\n31\nVitAl stAtistics  And Functions  oF the Body\nAs you grow in years, you grow in size with increased length \nand circumference of body parts till you are a full-fledged \nadult of age 19. While you must maintain hygiene of all \nexternal parts, the internal organs also have to function \nnormally. You know that certain vital functions of the body \nfor enjoying good health are maintenance of blood pressure, \npulse rate, respiratory rate, etc. Some ways of assessing \nthe vital functions and statistics of human beings are  \ngiven below. \nBlood pressure (BP) and its measurement\nPressure exerted \nby blood on the \nwall of the arteries \nis called blood \npressure. When \nthe heart \ncontracts, blood \nsurges through \naorta, BP is \nhighest (Systolic \nPressure) \npressure \nof blood on the arterial wall recorded when ventricles relax is \nlowest (Diastolic Pressure).\nThe pressure wave \nalong the arteries with \neach heartbeat can be \nfelt at the pulse. Blood \npressure is measured \nby the instrument \ncalled “Sphygmoma-\nnometer”. Diastolic \nand Systolic pressure \nis measured and in a \nnormal healthy young \nadult it is 110/75, \nwhich means 110 \nmm Hg systolic and \n75 mm Hg diastolic. \nSphygmomanometer \nconsists of cuff with \nan inflatable bladder which is wrapped around a person’s up-\nper arm and a rubber bulb inflates the bladder. An attached \ndevice indicates the blood pressure. There is now a digital de -\nvice which is also used for measuring the BP. BP increases \nwith age to about 130/90mm Hg. Abnormally high BP is called \nhypertension. \nFig. 3.1: Checking blood pressure\nFig. 3.3: Sphygmomanometer\nActivity 3.4\nMeasuring mid-arm \nCircumference\nBiceps is the muscle of  \nmid arm.\nPlace the beginning of the \ntapes in the middle of the \nbiceps (midway between \nshoulder and elbow joint) \ntake the reading and \nrecord it. When you do \nthis in a group, record the \ncircumference of all the \nstudents of the group and \nobserve the variation.\nFig. 3.2: Measuring mid-arm \ncircumference\nChap-3.indd   31 8/24/2020   4:15:40 PM\n2024-25",
      "content_type": "text",
      "token_count": 572,
      "page_number": 9
    },
    {
      "id": "5e4fab50-5b98-4599-93e7-010ec634a9c8",
      "chapter_id": "d7cad5f2-b386-467b-8536-c7e4153ed91d",
      "chunk_index": 1,
      "content": "--- Page 10 ---\nHealtH and PHysical education - class X\n32\nCalculate your Body Mass Index (BMI)\nBMI can be calculated by adopting the following formula. \nDivide your weight by square of your height.\nBMI =\nweight (kg)\nheight (m)\n2\n • If you measured your weight in kg then measure height \nin meters. \n • Normal BMI Range = 18 to 25.\n • Overweight = more than 25 and less then 29.\n • Obese = more than 30.\nExamination of conjunction \nThe conjunction is a transparent membrane over the eye.  \nA smooth shiny moist conjunction is normal. If red or thick or \ncovered by a secretion or foreign body, it requires immediate \nmedical attention or consultation of a eye doctor. \nTongue examination\nNutritional deficiencies, infections, dysfunction of nerves or \neven cancer can be detected by examining the tongue.\nSome key characteristic features of a tongue in normal \ncondition can be noted by physical examination. These are —\n (i) Colour: Pink red on both upper and lower surface. On \nlower surface blood vessels may be seen.\n (ii) Texture: Rough on upper surface due to presence of \npapillae or taste buds. Hair, farrows or ulceration \nindicates dysfunction.\n (iii) Size: If not swollen, tongue will fit comfortably inside \nthe mouth. The tongue can be examined by the \nfollowing steps —\n • Make tip of tongue touch roof of mouth to inspect \nventral surface.\n • When protruded out, colour and texture can be \nnoted for any deviation.\n • Use gauze to hold protruded tongue (wearing \ngloves) between tongue and index figure and fill \nthe fender areas.\nExamining nail bed\nNail bed also needs direct physical examination. Nail plate \nsurface discolouration, abnormal cuticle, nail fold or nail \nshape require inspection. Loss of nails and lesions around \nnails, need medical attention.\nActivity 3.6\nAt the exit gate of Nehru \nPlace Metro Station in \nNew Delhi, there is a \nprovision for measuring \nheight and weight and \nalso to calculate BMI for \n10 rupees. Find out where \nelse measurement of BMI \nis available. Do you have \nthis in your school?\n • My Height =\n • My Weight =\n • My BMI=\nNormal, Overweight, obese. \nTick whichever is relevant\nActivity 3.5\nMeasuring height\n • Take your own height \nat intervals as you \ngrow. You have learnt \nthat your height at \nage 19 is almost the \nmaximum height that \nyou shall attain. Do \nthis with your friends \nand try to figure out the \nreasons for variations. \nYou need only an inch \ntape for this.\n • Go to a clinic or any \nmedical practitioner \nand see the working \nof the Sphygmoma-\nnometer. Collect data \nfrom persons where \nBP is checked. Analyse \nthe variations and the  \nreasons.\nChap-3.indd   32 8/24/2020   4:15:40 PM\n2024-25",
      "content_type": "text",
      "token_count": 667,
      "page_number": 9
    },
    {
      "id": "f0523612-1cc9-4f9d-87f5-2d328f6d2188",
      "chapter_id": "d7cad5f2-b386-467b-8536-c7e4153ed91d",
      "chunk_index": 2,
      "content": "--- Page 11 ---\nGrowth and development durinG adolescence\n33\nPharmacology and its impact on the body\nPharmacology deals with biological effects of drugs. Drugs \nare chemical substances used for healing, curing diseases, \nslowing them or preventing diseases.\nEffects\nTherapeutic desired actions for cure are —\n • Stimulating or inhibited cell function \n • Blocking biochemical of tissues\n • Anti histamicric  (anti allergic)\n • Laxative (reasoning constipation)\nUnwanted effects\nSide effects are —\n • Dry mouth or dangerous effects on tissues\n • Damage or toxicity or excessive bleeding  are some \neffects of drugs used as medicine \nPrevention\nNever buy medicines over the counter (OTC) without Doctor’s \nprescription with dosage and instruction written.\n • Unusual responses are reasons for harmful effects of \ndrugs \n • Medication error or overdose\nChap-3.indd   33 8/24/2020   4:15:40 PM\n2024-25\n\n--- Page 12 ---\nHealtH and PHysical education - class X \n34\nAssessment\n I. Fill in the Blanks",
      "content_type": "text",
      "token_count": 248,
      "page_number": 13
    },
    {
      "id": "11c4f50b-acc7-4e8f-875b-a6efa1e941f8",
      "chapter_id": "9580b17c-0d6e-42b9-8f08-577c04c77925",
      "chunk_index": 0,
      "content": "____________, ___________, ______________, _____________ and \n____________.\n II. Choose the Correct Option",
      "content_type": "text",
      "token_count": 26,
      "page_number": 13
    },
    {
      "id": "86b63075-e5a3-49d1-a0ae-9416f83b8345",
      "chapter_id": "14c1f12f-85e1-4931-896a-4b69ff01d23b",
      "chunk_index": 0,
      "content": "(Yes/No/Don’t know)",
      "content_type": "text",
      "token_count": 4,
      "page_number": 13
    },
    {
      "id": "27159a95-bb01-4dea-800f-edd56431dafa",
      "chapter_id": "b1eba4e4-b205-46f8-8d00-cc269d1f0872",
      "chunk_index": 0,
      "content": "hygiene among adolescent girls. (Yes/No/Don’t know)",
      "content_type": "text",
      "token_count": 12,
      "page_number": 13
    },
    {
      "id": "d6dc42dc-e384-4335-afc7-36944d5e9dfa",
      "chapter_id": "9ece277b-0471-458f-a086-ed1c05556fdf",
      "chunk_index": 0,
      "content": "appearance once secondary sexual characteristics begin to \ndevelop. (Yes/No/Don’t know)",
      "content_type": "text",
      "token_count": 21,
      "page_number": 13
    },
    {
      "id": "8328ec76-35f4-4634-9227-da63f4df21b8",
      "chapter_id": "0881922c-735a-415f-8e8f-7199577b00b8",
      "chunk_index": 0,
      "content": "increased mental development. (Yes/No/Don’t know)",
      "content_type": "text",
      "token_count": 12,
      "page_number": 13
    },
    {
      "id": "c674ab05-fcf6-4203-8497-30592053cd49",
      "chapter_id": "94d610e6-fe2f-4637-85a5-8f41e4ee57c0",
      "chunk_index": 0,
      "content": "(Yes/No/Don’t know)",
      "content_type": "text",
      "token_count": 4,
      "page_number": 13
    },
    {
      "id": "f28ec390-fbfb-4980-8332-0ce6fbd766a1",
      "chapter_id": "cd8aebbe-c17f-4b8a-bbf8-483c35f7faa4",
      "chunk_index": 0,
      "content": "(Yes/No/Don’t know)",
      "content_type": "text",
      "token_count": 4,
      "page_number": 13
    },
    {
      "id": "a58c86e5-cc16-43e4-bc68-d05a06a705db",
      "chapter_id": "dc23e3fb-fbf1-40fb-8011-f0528ec3332a",
      "chunk_index": 0,
      "content": "(Yes/No/Don’t know)\n III. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 14,
      "page_number": 13
    },
    {
      "id": "94687cbf-e76d-4003-b924-600d7821c2ef",
      "chapter_id": "7a71a78d-7a14-44f6-949b-6da9f2d71f08",
      "chunk_index": 0,
      "content": "pregnancy?",
      "content_type": "text",
      "token_count": 2,
      "page_number": 13
    },
    {
      "id": "c7fd1410-2429-41b6-ac89-e8802ae84699",
      "chapter_id": "378aba58-2a7f-4993-8bd5-89f1ecaf3474",
      "chunk_index": 0,
      "content": "(i) mid-arm circumference.\n (ii) measurement of height.\n (iii) body mass index.\n (iv) tongue examination.\n (v) examination the nail beds.",
      "content_type": "text",
      "token_count": 34,
      "page_number": 14
    },
    {
      "id": "6a404b60-7e17-422e-89fa-a20208705da5",
      "chapter_id": "a40eb6b4-ced3-4bbb-8568-e4a23082ef50",
      "chunk_index": 0,
      "content": "Chap-3.indd   34 8/24/2020   4:15:40 PM\n2024-25",
      "content_type": "text",
      "token_count": 11,
      "page_number": 14
    }
  ]
}