{
  "textbook": {
    "id": "00a839a8-d5fc-47fd-b9da-70316409597f",
    "file_name": "Class X Health and PE - Ch 00 - HealtHy Community living.pdf",
    "title": "HealtHy Community living",
    "grade": 10,
    "subject": "Class X Health and PE",
    "total_pages": 12,
    "file_size_mb": 2.3985986709594727,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:22.868510",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Health and PE/Class X Health and PE - Ch 00 - HealtHy Community living.pdf"
  },
  "chapters": [
    {
      "id": "b3e6674c-8dce-4993-9d8f-9583f08a4ef7",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 3,
      "title": "3. A slum in an urban area (Fig 11.3)",
      "topics": [],
      "start_page": 1,
      "end_page": 3,
      "content": "A village\nMawlynnong Village in East Khasi Hills District of Meghalaya \nwas declared as Asia’s cleanest village in 2003 by Discover \nHealtHy Community \nliving\n11\nChap-11.indd   193 8/24/2020   11:46:07 AM\n2024-25\n\n--- Page 2 ---\nHealtH and PHysical education - class X\n194\nIndia Magazine. It is about 75 km away from Shillong,  \nthe capital of Meghalaya. Most of the houses in this village \nare beautifully decorated with flowers and plants. As per \nthe Census of 2011, the total population of Mawlynnong \nis 414. The main occupation of the villagers is agriculture, \nbut it has also been an age old tradition of ensuring that \nthe surrounding environment is clean. In fact cleanliness is \na collective effort and this practice is ingrained in the people \nsince their childhood. The people voluntarily sweep the roads \nand lanes, water the plants in public areas and clean the \ndrains. A dustbin made out of bamboo is found all along \nthe village. Everyone makes it a point that dirt and waste \nare not thrown anywhere. All the waste from the dustbin is \ncollected and kept in a pit, which the villagers use as manure. \nTrees are planted to restore and maintain nature’s balance. \nMawlynnong’s fame as the cleanest village in Asia, is drawing \na lot of domestic as well as international tourists, as a result of \nwhich tourism is also an important source of employment for \nthe local youths. Besides, there are many interesting sights \nto see such as the famous living root bridge in the nearby \nvillage of Riwai, which is a fascinating example of indigenous \nmethods of conservation and sustainability. Local youths are \navailable as enthusiastic and informative guides.\nFig. 11.1: Mawlynnong Village\nA township in an urban area\nFig. 11.2: A modern township\nChap-11.indd   194 8/24/2020   11:46:07 AM\n2024-25\n\n--- Page 3 ---\nHealtHy Community living\n195\nThis picture is of a modern township derived from an \nadvertisement in a national newspaper. Many times, \ncatchy slogans such as ‘Get away from noise, pollution, \ncongestion and a cramped life’ are used by builders to sell \ntheir apartments. People are assured a safe and healthy \nenvironment with not only the basic amenities, but \nalso other features, such as, shopping arcades, clubs, \ngymnasiums, gardens, clinics, food market, lots of open \nspace, etc.\nA slum in an urban area\nFig. 11.3: A slum area\nThese pictures characterise life in a slum area in big cities. \nAs you can see in the picture, people live in overcrowded \nhouses surrounded by stagnant water which is a potential \nbreeding ground for mosquitoes. We also find railway tracks \nadjacent to the houses which is dangerous for children and \nadults too. In addition, we find heaps of garbage scattered \naround the houses.\nActivity 11.2\nYou may conduct a survey in your neighborhood and collect \ninformation on the following —\n • Make a list of some of the basic amenities and community \nresources that are collectively shared by members of your \ncommunity. \n • Make a list of \nsome of the community resources that are not \navailable in your locality. \n • On the basis of your observations and survey, complete the \nfollowing table —\nFeatures appropriate or \nnecessary for healthy \ncommunity living\nFeatures not appropriate \nor necessary for healthy \ncommunity living"
    },
    {
      "id": "57fe7a04-c513-4660-930b-e85bf65e136d",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 4,
      "title": "1. Water supply",
      "topics": [],
      "start_page": 3,
      "end_page": 3,
      "content": "2. ..................................\n3. ..................................\n4. ..................................\n5. .................................."
    },
    {
      "id": "4ea0df48-a5ce-43d8-8b4f-48ddfc4a6360",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 5,
      "title": "1. Open drains",
      "topics": [],
      "start_page": 3,
      "end_page": 10,
      "content": "2. ..................................\n3. ..................................\n4. ..................................\n5. ..................................\nActivity 11.1\nAfter observing the \npictures, discuss the \nfollowing —\n • Do you think \nMawlynnong Village is \na successful example \nof healthy community \nliving? Give reasons for \nyour answers.\n • Do you think modern \ntownships as depicted \nin Fig 11.2, can offer its \ninhabitants a safe and \nhealthy environment, \nas assured by the \nbuilders? \n • The pictures shown \nin Fig 11.3, does not \nreflect signs of healthy \ncommunity living. Do \nyou agree? Give reasons \nfor your answers. \nChap-11.indd   195 8/24/2020   11:46:07 AM\n2024-25\n\n--- Page 4 ---\nHealtH and PHysical education - class X\n196\nThese activities will enable you to understand various features of \nhealthy community living. Through these activities, you may have \nobserved that in a community, a group of people live in a particular \nlocal area. Secondly, they share common facilities, which differ from \nplace to place. In some areas, people have access to facilities, such \nas, water supply, sanitation, garbage disposal facilities, health \ncare services, recreational facilities, community centre, schools, \ntransportation, etc., but in some places people do not have access to \neven the most basic amenities. \nA community is said to be healthy when its members \ncontinuously work together to maintain, improve and expand \nthe available natural resources and avoid their wastage.  \nThe healthy community only be develped when its members \nrecognise their roles and responsibilities. They strive to \ninculcate values and attitudes of cooperation, mutual \nrespect, tolerance, kindness, etc. The role of Panchayati Raj, \ncivil societies and other government institutions is also very \nimportant to promote healthy living.\nImportant features of healthy community living\nMaintaining cleanliness of our home and surroundings is \nan essential feature of healthy community living. Healthy \ncommunity is one in which all residents have access to \nquality education, safe and healthy homes, adequate \nemployment, transportation, physical activity and \nnutrition. Living in overcrowded and unhygienic places \nwith excessive noise and pollution, may lead to various \nforms of illnesses, diseases and stress. For instance, lack \nof adequate space, poor ventilation in rooms and toxic \nfumes in the air, increase the risk of air borne diseases. \nAccess to basic amenities such as regular water supply, \nsafe drinking water and sanitation, is important for \nhealthy community living. In the previous classes (Classes \nVII to IX), it has been learnt that open and unattended \ngarbage dumps are a potential breeding place for flies, \ncockroaches, insects and so on. Stagnant water and open \ndrains breed mosquitoes, the carrier of diseases, such as, \nmalaria, dengue and chikungunya. Water borne diseases, \nsuch as, cholera, jaundice, diarrhea and gastroenteritis \nare also resulted due to water pollution.\nAccess to basic amenities also includes other provisions \nsuch as electricity, hospitals, dispensaries, housing facilities, \nroads and transportation, schools, colleges, employment, \nsecurity, recreational facilities and so on. Imagine a situation \nwhen a member in the family falls seriously ill and requires \nurgent treatment. What would happen to this person if there \nare no hospitals in the nearby city, or no transportation \nfacilities to reach there? \nChap-11.indd   196 8/24/2020   11:46:07 AM\n2024-25\n\n--- Page 5 ---\nHealtHy Community living\n197\nTo ensure these basic amenities, the role of the local \ngovernment or panchayats is very important. They are required \nto ensure rules and regulations for safety measures, cleanliness, \nensure equal access of public amenities to all members, \npromote adoption of waste management practices, and help \necological restoration and conservation. However, we cannot \ndepend solely on the government to take the initiative. The \nquality of life in a community also depends on how the members \nof the community work to improve on available resources \nand ensure that the government provides for these facilities. \nYou might have seen this logo before. This is \nthe logo of the Swachh Bharat Abhiyan . You \nmust have also seen some of the television \nadvertisements through which the government \nadvertises the importance and necessity of \nstaying clean and keeping our environment \nclean. In this Clean India campaign — known \npopularly as the Swachh Bharat Abhiyan , \nthe vision of a Clean and hygienic India, once \nseen by Mahatma Gandhi, can happen only if \nmembers of every community cooperate and \naccept individual and collective responsibility \nof keeping themselves, their homes and their \nsurroundings clean.\nIn order to work collectively, members of a community \nneed to develop values of co-operation, kindness, respect, \ngratitude, joy, peace and selflessness. These attributes are \nimportant in fostering the principles of collective work and \nin nurturing healthy social relationships. The example \nof Mawlynnong village shows that high income alone \nis not the only criterion for healthy living. Cooperative \naction, responsibility and positive values can also help in \nimproving the quality of life, and healthy living conditions \nfor one and all.\nPrevention  of Coronavirus : soCial \nDistanCing anD Dealing  witH stigma\nPrevention through social distancing\nSocial Distancing: Deliberately increasing the physical space \nbetween people to avoid spreading illness and staying at \nleast one meter away from other person decreases chances \nof catching coronavirus (COVID-19).\nSocial distancing: Dos\n • Stay at home unless absolutely necessary.\n • Keep a distance of at least one meter between yourself \nand another person.\nChap-11.indd   197 8/24/2020   11:46:08 AM\n2024-25\n\n--- Page 6 ---\nHealtH and PHysical education - class X\n198\nSocial distancing: Don’ts\n • Do not hold events where people have to gather  \n(even if it is a corner meeting with three or four friends, \nor an evening chat on the chaupal).\n • Do not go to crowded places like markets, shopping, \nmelas, parties.\n • Do not use public transport.\nFig. 11.4: Social distancing dos and don’ts\nCourtesy: https://www.mohfw.gov.in/\nDealing with the stigma\nWhat is stigma?\nIn any epidemic, it is common for individuals to feel stressed \nand worried because they fear —\n • falling ill and dying.\n • approaching health facilities due to fear of becoming \ninfected while in care.\n • losing livelihoods, not being able to work during \nisolation, and of being dismissed from work.\n • being socially excluded or placed in quarantine because \nof being associated with the disease.\n • feeling powerless in protecting loved ones and fear of \nlosing loved ones because of the virus or being separated \nduring quarantine.\n • feelings of helplessness, boredom, loneliness and \ndepression due to being isolated and not working \ntowards caring for a dependent.\nStress is caused due to the above fears and being treated as \nan outcaste or blamed for spreading the disease.\nWhat is the reason behind the stigma?\nThe level of stigma associated with COVID-19 is based on \nthree main factors —\nChap-11.indd   198 8/24/2020   11:46:08 AM\n2024-25\n\n--- Page 7 ---\nHealtHy Community living\n199\n • COVID-19 is a new disease about which many things \nare still being discovered.\n • When something is unknown people are worried which \nleads to fear.\n • Rumours or fake news give wrong information and \nspreads the fear.\nRecognising the stigma\nIt is very important to recognise stigma and handle it. Below \nare four case studies related to these issues. Read these case \nstudies and recognise the stigma.\nCASE 1\nYou are in the grocery shop, there are several people who are \nwearing a mask. You see Babulal, the store owner, going red \nin his face as he tries to suppress a cough.\nCASE 2\nSukhram has come back from Pune where he works as a \ntaxi driver. They stay in a joint family and you have taken \nhis contact history as advised by your supervisor. You come \nto know that Sukhram’s family members have asked him to \nleave the house.\nCASE 3\nBeauty works in Delhi as a house maid. recently she has come \nback and you have been told that beauty’s employers have \nasked her to leave as she had a cold.\nCASE 4\nSurali is a young girl of 11 years. She and her 8-year-old  \nbrother are staying with an aunt as their parents have \nbeen asked to go in for isolation. Surali’s aunt keeps on \ncomplaining to you that the children are a big burden on the  \nfamily’s resources.\nWhat will you feel like if you were Babulal, Rani, Sukhram \nand Beauty?\n • Babulal has simple cough. But he is too scared to \ncough in front of people as he will loose the customers.\n • Sukhram needs family support to help him stay in \nisolation. If everyone takes proper precautions the \ninfection need not spread.\n • Beauty has a seasonal cold but she has been asked to \nleave by her employers.\n • Surali and her brother are two small children who need \nto be supported and this kind of incident can cause \nmental stress even in the future. Child Protection Cell \n(CPC) should be approached for appropriate measures \nfor helping children in difficult situations.\nChap-11.indd   199 8/24/2020   11:46:08 AM\n2024-25\n\n--- Page 8 ---\nHealtH and PHysical education - class X\n200\nFig. 11.5: What does stigma do?\nhttps://www.mohfw.gov.in/\nvalues anD attituDes ConDuCive for \nHealtHy anD CooPerative  living\nHow to develop values and attitudes conducive for healthy and \ncooperative living? These values have to emanate from within \na person, but they can also be developed through various \nother ways. Camping can be seen as one of these ways which \nis extremely appropriate for students, particularly during the \nadolescent period. \nWhat is camping?\nYoungsters might \nhave already attended \na camp or may have \nheard about camping \nactivities f rom friends. \nCamping is an outdoor \nactivity, where familiar \nsurroundings are left to \nspend a night or several \nnights at an outdoor \nsite. The location of \nthese sites varies as \nper the objectives of the \ntrip, time of the year \nand budget available. \nCommon camping sites are: visits to villages or rural areas \nto understand their pattern of living; mountain areas, \nnational parks, lakes, beaches, forests, etc. One can also \nplan camping activities in a nearby place, such as, open \nfields, park, or even in an open space of the school premises.  \nThe basic camping equipment include tents, cooking utensils \nor gadgets, sleeping bags, first aid kits, ropes, insect repellents, \nFig. 11.6: Camping\nChap-11.indd   200 8/24/2020   11:46:09 AM\n2024-25\n\n--- Page 9 ---\nHealtHy Community living\n201\netc. These requirements will vary as per the location of the \ncamping site and objectives of the trip. However, irrespective \nof the location, the essence of all camping activities revolves \naround two main features — \n (i) Bonding with nature\n (ii) Importance of living in a community. \nImportance of camping\nCamping gives students a good break, away from the \nmonotony of the classroom. It gives an opportunity to \nlearn from nature in a joyful, exciting and adventurous \nmanner. Living in the natural environment with students \nfrom different areas, cultures, religions and backgrounds, \nhelp then to learn to work as a team in various activities. \nThese activities differ from adventurous and challenging \nones, to the most basic ones, such as, cooking, cleaning, \ncollecting water, etc. In this process, students learn the \nimportance of self-reliance, teamwork, co-existence, \nimportance of natural resources and organisational skills. \nCamping also offers great opportunities for empowerment \nof the girls.\nFig. 11.7: Trekking  \nFig. 11.8: Mountaineering\n \nFig. 11.9: Rock climbing\nWhile camping, one can engage in adventure sport, \nsuch as, trekking, river rafting, mountaineering, rock \nclimbing, repelling, paragliding, caving. Adventure sport \nhelp to develop courage, self-confidence, leadership \nqualities and enhance concentration powers. This is also \na great form of physical exercise. However, these activities \nshould be conducted only in the presence of qualified and \nprofessional trainers. Joining the National Cadet Corps \n(NCC), National Service Scheme (NSS) or Bharat Scouts \nand Guides will also give you opportunities to take part in \nthese activities.\nChap-11.indd   201 8/24/2020   11:46:14 AM\n2024-25\n\n--- Page 10 ---\nHealtH and PHysical education - class X\n202\nFig. 11.10: Zipline\n \nFig. 11.11: River rafting\nA guided walk through the forest helps to explore \nnature. It can also complement much of the textual data \nin your geography and science textbooks through direct \nexperiences. At the same time, learn to appreciate the beauty \nand simplicity of nature to make all understand how much \ndisconnected from ‘Mother Earth one has become.’ You realise \nthe importance of nature and how we should take care of it. \nMoreover, through interaction with local communities, one \nlearns about edible and medicinal plants, local crafts, first-\naid and various other sustainable forms of living. \nDuring the evenings all may gather around campfires which \ngive a great opportunity for social bonding. Campfires also \nenable to learn about different cultures through story telling, \nsongs, dances, skits and games. On many occasions hidden \ntalents of individuals are brought out during these activities.\nActivity 11.3\nSome of the camping activities have been given in the following table. Write down \nthe qualities which can be developed through the respective activities. You may \nconsult other sources for your answers.\nActivities Qualities developed\nHiking, rock climbing, trekking, rope \nclimbing, river rafting, etc.\nConfidence, leadership qualities, team-\nwork\nNature walk\nCultural activities — patriotic songs, \nlectures on Indian culture and \nheritage through dance, drama, \nsongs, story telling, skits, quizzes, etc.\nCampfire — story telling that emphasize \non moral values based on local folk \ntales, history, games and songs.\nInteraction with local community \nmembers on local crafts, medicines, \nfirst aid, food, etc.\nYoga\nVoluntary services\nChap-11.indd   202 8/24/2020   11:46:15 AM\n2024-25\n\n--- Page 11 ---\nHealtHy Community living\n203\nassessment\n I. Multiple Choice Questions"
    },
    {
      "id": "4101e7e7-031f-44b3-99bb-f9eaa235e2f1",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 6,
      "title": "1. Which of the following is the most important criterion for healthy",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "community living?\n  a) Cooperative action \n  b) Kindness \n  c) Harmony \n  d) Safety measures"
    },
    {
      "id": "f0bc781b-98b2-4e70-a52b-9b3f9f072846",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 7,
      "title": "2. Community participation is essential for ________________.",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "  a) ecological restoration \n  b) public hygiene and health \n  c) social harmony\n  d) All of the above\n II. State whether True or false\n  a) Maintenance of public hygiene is the sole responsibility of the \ngovernment.\n  b) Community health and individual health are closely interlinked\n  c) Camping is the only means for developing values of cooperative \nliving\n  d) Overcrowding increases the risk to air borne diseases\n  e) Interpersonal relationships are as important as our physical \nenvironment.\nIII. Answer the following Questions"
    },
    {
      "id": "f5758ac6-1244-4dd1-b1c8-0fc8b8a9c8a5",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 8,
      "title": "1. What is your vision of a healthy community? Give at least 3",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "examples."
    },
    {
      "id": "9f60c1f2-7d66-4a9f-859f-e48a103d39d3",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 9,
      "title": "2. A camping trip has been arranged by your school. Two girls from",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "your community are not allowed to go for the trip. What are \nthe points you would highlight to convince the parents on the \nimportance of camping trip for girls."
    },
    {
      "id": "b8dabca6-8e5a-482c-a1a7-5e04897deb01",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 10,
      "title": "3. Arrange a collage of pictures showing various activities in a",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "Camping Trip."
    },
    {
      "id": "c1fa2374-10de-4cbc-bad0-d2efd3c18e1f",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 11,
      "title": "4. Give two suggestions for keeping your community healthy,",
      "topics": [],
      "start_page": 10,
      "end_page": 11,
      "content": "both at the individual and collective level, based on the points \nenumerated below. \n  For example,\n  Record your suggestions regarding cleanliness drive within the \ncommunity. The first one has been done for you.\n  I will ensure that, I do not throw litter around.\n  We will ensure that, there are no open garbage dumps in the \ncommunity.\nChap-11.indd   203 8/24/2020   11:46:15 AM\n2024-25\n\n--- Page 12 ---\nHealtH and PHysical education - class X\n204\n a) Record your suggestions regarding rules and regulations within \nthe community for safety measures.\n   I will ensure that ____________________________________________ .\n   We will ensure that __________________________________________.\n b) Record your suggestions for ensuring equal access of public \namenities to all members.\n  I will ensure that  ____________________________________________ .\n  We will ensure that  __________________________________________.\n c) Record your suggestions for adopting effective waste management \npractices.\n  I will ensure that  ____________________________________________ .\n  We will ensure that  __________________________________________.\n d) Record your suggestions for ecological restoration and \nconservation within your community.\n  I will ensure that  ____________________________________________ .\n  We will ensure that  __________________________________________.\n e) Record your suggestions for ensuring kindness and consideration \nto the aged and differently abled.\n  I will ensure that  ____________________________________________ .\n  We will ensure that  __________________________________________.\n f) Record your suggestions for counseling provisions for the youth, \nrecreational facilities, etc.\n  I will arrange for  _____________________________________________.\n  We will arrange for  __________________________________________ ."
    },
    {
      "id": "b0eae7d2-e3fb-46b2-8834-ac10e8e6ef05",
      "textbook_id": "00a839a8-d5fc-47fd-b9da-70316409597f",
      "chapter_number": 12,
      "title": "10. Imagine that you have been asked to prepare an activity schedule",
      "topics": [],
      "start_page": 11,
      "end_page": 12,
      "content": "for a day in a camping trip. First write down the location of the \ncamping site and objectives of the camping trip and include other \ndetails in the following table.\n  Location of camping site  _____________________________________ .\n  Objectives of the camping trip  ________________________________.\nTable : Schedule for a camping trip\nTime Activities Equipment \nRequired\nNo. of \nparticipants\nNo. of \nTeachers/ \nInstructors\nExpected \nOutcome\nBudget\nChap-11.indd   204 8/24/2020   11:46:16 AM\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "0a810166-3611-49f3-9bc5-a5c388fc88f7",
      "chapter_id": "b3e6674c-8dce-4993-9d8f-9583f08a4ef7",
      "chunk_index": 0,
      "content": "A village\nMawlynnong Village in East Khasi Hills District of Meghalaya \nwas declared as Asia’s cleanest village in 2003 by Discover \nHealtHy Community \nliving\n11\nChap-11.indd   193 8/24/2020   11:46:07 AM\n2024-25\n\n--- Page 2 ---\nHealtH and PHysical education - class X\n194\nIndia Magazine. It is about 75 km away from Shillong,  \nthe capital of Meghalaya. Most of the houses in this village \nare beautifully decorated with flowers and plants. As per \nthe Census of 2011, the total population of Mawlynnong \nis 414. The main occupation of the villagers is agriculture, \nbut it has also been an age old tradition of ensuring that \nthe surrounding environment is clean. In fact cleanliness is \na collective effort and this practice is ingrained in the people \nsince their childhood. The people voluntarily sweep the roads \nand lanes, water the plants in public areas and clean the \ndrains. A dustbin made out of bamboo is found all along \nthe village. Everyone makes it a point that dirt and waste \nare not thrown anywhere. All the waste from the dustbin is \ncollected and kept in a pit, which the villagers use as manure. \nTrees are planted to restore and maintain nature’s balance. \nMawlynnong’s fame as the cleanest village in Asia, is drawing \na lot of domestic as well as international tourists, as a result of \nwhich tourism is also an important source of employment for \nthe local youths. Besides, there are many interesting sights \nto see such as the famous living root bridge in the nearby \nvillage of Riwai, which is a fascinating example of indigenous \nmethods of conservation and sustainability. Local youths are \navailable as enthusiastic and informative guides.\nFig. 11.1: Mawlynnong Village\nA township in an urban area\nFig. 11.2: A modern township\nChap-11.indd   194 8/24/2020   11:46:07 AM\n2024-25",
      "content_type": "example",
      "token_count": 452,
      "page_number": 1
    },
    {
      "id": "2b257ddd-7c33-44ef-bd8a-864c3052310b",
      "chapter_id": "b3e6674c-8dce-4993-9d8f-9583f08a4ef7",
      "chunk_index": 1,
      "content": "--- Page 3 ---\nHealtHy Community living\n195\nThis picture is of a modern township derived from an \nadvertisement in a national newspaper. Many times, \ncatchy slogans such as ‘Get away from noise, pollution, \ncongestion and a cramped life’ are used by builders to sell \ntheir apartments. People are assured a safe and healthy \nenvironment with not only the basic amenities, but \nalso other features, such as, shopping arcades, clubs, \ngymnasiums, gardens, clinics, food market, lots of open \nspace, etc.\nA slum in an urban area\nFig. 11.3: A slum area\nThese pictures characterise life in a slum area in big cities. \nAs you can see in the picture, people live in overcrowded \nhouses surrounded by stagnant water which is a potential \nbreeding ground for mosquitoes. We also find railway tracks \nadjacent to the houses which is dangerous for children and \nadults too. In addition, we find heaps of garbage scattered \naround the houses.\nActivity 11.2\nYou may conduct a survey in your neighborhood and collect \ninformation on the following —\n • Make a list of some of the basic amenities and community \nresources that are collectively shared by members of your \ncommunity. \n • Make a list of \nsome of the community resources that are not \navailable in your locality. \n • On the basis of your observations and survey, complete the \nfollowing table —\nFeatures appropriate or \nnecessary for healthy \ncommunity living\nFeatures not appropriate \nor necessary for healthy \ncommunity living",
      "content_type": "text",
      "token_count": 368,
      "page_number": 3
    },
    {
      "id": "07598225-a570-49ea-a276-58305339582f",
      "chapter_id": "57fe7a04-c513-4660-930b-e85bf65e136d",
      "chunk_index": 0,
      "content": "2. ..................................\n3. ..................................\n4. ..................................\n5. ..................................",
      "content_type": "text",
      "token_count": 37,
      "page_number": 3
    },
    {
      "id": "04d091fc-75f3-4f50-9f59-bd493d67da7c",
      "chapter_id": "4ea0df48-a5ce-43d8-8b4f-48ddfc4a6360",
      "chunk_index": 0,
      "content": "2. ..................................\n3. ..................................\n4. ..................................\n5. ..................................\nActivity 11.1\nAfter observing the \npictures, discuss the \nfollowing —\n • Do you think \nMawlynnong Village is \na successful example \nof healthy community \nliving? Give reasons for \nyour answers.\n • Do you think modern \ntownships as depicted \nin Fig 11.2, can offer its \ninhabitants a safe and \nhealthy environment, \nas assured by the \nbuilders? \n • The pictures shown \nin Fig 11.3, does not \nreflect signs of healthy \ncommunity living. Do \nyou agree? Give reasons \nfor your answers. \nChap-11.indd   195 8/24/2020   11:46:07 AM\n2024-25",
      "content_type": "example",
      "token_count": 171,
      "page_number": 3
    },
    {
      "id": "d8b7566a-c3bc-44ed-9bc3-35cb2cc250f4",
      "chapter_id": "4ea0df48-a5ce-43d8-8b4f-48ddfc4a6360",
      "chunk_index": 1,
      "content": "--- Page 4 ---\nHealtH and PHysical education - class X\n196\nThese activities will enable you to understand various features of \nhealthy community living. Through these activities, you may have \nobserved that in a community, a group of people live in a particular \nlocal area. Secondly, they share common facilities, which differ from \nplace to place. In some areas, people have access to facilities, such \nas, water supply, sanitation, garbage disposal facilities, health \ncare services, recreational facilities, community centre, schools, \ntransportation, etc., but in some places people do not have access to \neven the most basic amenities. \nA community is said to be healthy when its members \ncontinuously work together to maintain, improve and expand \nthe available natural resources and avoid their wastage.  \nThe healthy community only be develped when its members \nrecognise their roles and responsibilities. They strive to \ninculcate values and attitudes of cooperation, mutual \nrespect, tolerance, kindness, etc. The role of Panchayati Raj, \ncivil societies and other government institutions is also very \nimportant to promote healthy living.\nImportant features of healthy community living\nMaintaining cleanliness of our home and surroundings is \nan essential feature of healthy community living. Healthy \ncommunity is one in which all residents have access to \nquality education, safe and healthy homes, adequate \nemployment, transportation, physical activity and \nnutrition. Living in overcrowded and unhygienic places \nwith excessive noise and pollution, may lead to various \nforms of illnesses, diseases and stress. For instance, lack \nof adequate space, poor ventilation in rooms and toxic \nfumes in the air, increase the risk of air borne diseases. \nAccess to basic amenities such as regular water supply, \nsafe drinking water and sanitation, is important for \nhealthy community living. In the previous classes (Classes \nVII to IX), it has been learnt that open and unattended \ngarbage dumps are a potential breeding place for flies, \ncockroaches, insects and so on. Stagnant water and open \ndrains breed mosquitoes, the carrier of diseases, such as, \nmalaria, dengue and chikungunya. Water borne diseases, \nsuch as, cholera, jaundice, diarrhea and gastroenteritis \nare also resulted due to water pollution.\nAccess to basic amenities also includes other provisions \nsuch as electricity, hospitals, dispensaries, housing facilities, \nroads and transportation, schools, colleges, employment, \nsecurity, recreational facilities and so on. Imagine a situation \nwhen a member in the family falls seriously ill and requires \nurgent treatment. What would happen to this person if there \nare no hospitals in the nearby city, or no transportation \nfacilities to reach there? \nChap-11.indd   196 8/24/2020   11:46:07 AM\n2024-25",
      "content_type": "example",
      "token_count": 707,
      "page_number": 3
    },
    {
      "id": "0f974321-a624-49d0-9374-5f072918957b",
      "chapter_id": "4ea0df48-a5ce-43d8-8b4f-48ddfc4a6360",
      "chunk_index": 2,
      "content": "--- Page 5 ---\nHealtHy Community living\n197\nTo ensure these basic amenities, the role of the local \ngovernment or panchayats is very important. They are required \nto ensure rules and regulations for safety measures, cleanliness, \nensure equal access of public amenities to all members, \npromote adoption of waste management practices, and help \necological restoration and conservation. However, we cannot \ndepend solely on the government to take the initiative. The \nquality of life in a community also depends on how the members \nof the community work to improve on available resources \nand ensure that the government provides for these facilities. \nYou might have seen this logo before. This is \nthe logo of the Swachh Bharat Abhiyan . You \nmust have also seen some of the television \nadvertisements through which the government \nadvertises the importance and necessity of \nstaying clean and keeping our environment \nclean. In this Clean India campaign — known \npopularly as the Swachh Bharat Abhiyan , \nthe vision of a Clean and hygienic India, once \nseen by Mahatma Gandhi, can happen only if \nmembers of every community cooperate and \naccept individual and collective responsibility \nof keeping themselves, their homes and their \nsurroundings clean.\nIn order to work collectively, members of a community \nneed to develop values of co-operation, kindness, respect, \ngratitude, joy, peace and selflessness. These attributes are \nimportant in fostering the principles of collective work and \nin nurturing healthy social relationships. The example \nof Mawlynnong village shows that high income alone \nis not the only criterion for healthy living. Cooperative \naction, responsibility and positive values can also help in \nimproving the quality of life, and healthy living conditions \nfor one and all.\nPrevention  of Coronavirus : soCial \nDistanCing anD Dealing  witH stigma\nPrevention through social distancing\nSocial Distancing: Deliberately increasing the physical space \nbetween people to avoid spreading illness and staying at \nleast one meter away from other person decreases chances \nof catching coronavirus (COVID-19).\nSocial distancing: Dos\n • Stay at home unless absolutely necessary.\n • Keep a distance of at least one meter between yourself \nand another person.\nChap-11.indd   197 8/24/2020   11:46:08 AM\n2024-25",
      "content_type": "example",
      "token_count": 580,
      "page_number": 3
    },
    {
      "id": "62b083c0-91a9-497e-b831-c29e791017ba",
      "chapter_id": "4ea0df48-a5ce-43d8-8b4f-48ddfc4a6360",
      "chunk_index": 3,
      "content": "--- Page 6 ---\nHealtH and PHysical education - class X\n198\nSocial distancing: Don’ts\n • Do not hold events where people have to gather  \n(even if it is a corner meeting with three or four friends, \nor an evening chat on the chaupal).\n • Do not go to crowded places like markets, shopping, \nmelas, parties.\n • Do not use public transport.\nFig. 11.4: Social distancing dos and don’ts\nCourtesy: https://www.mohfw.gov.in/\nDealing with the stigma\nWhat is stigma?\nIn any epidemic, it is common for individuals to feel stressed \nand worried because they fear —\n • falling ill and dying.\n • approaching health facilities due to fear of becoming \ninfected while in care.\n • losing livelihoods, not being able to work during \nisolation, and of being dismissed from work.\n • being socially excluded or placed in quarantine because \nof being associated with the disease.\n • feeling powerless in protecting loved ones and fear of \nlosing loved ones because of the virus or being separated \nduring quarantine.\n • feelings of helplessness, boredom, loneliness and \ndepression due to being isolated and not working \ntowards caring for a dependent.\nStress is caused due to the above fears and being treated as \nan outcaste or blamed for spreading the disease.\nWhat is the reason behind the stigma?\nThe level of stigma associated with COVID-19 is based on \nthree main factors —\nChap-11.indd   198 8/24/2020   11:46:08 AM\n2024-25",
      "content_type": "text",
      "token_count": 352,
      "page_number": 3
    },
    {
      "id": "54e58de0-a41e-42ca-a3a9-1918b3559641",
      "chapter_id": "4ea0df48-a5ce-43d8-8b4f-48ddfc4a6360",
      "chunk_index": 4,
      "content": "--- Page 7 ---\nHealtHy Community living\n199\n • COVID-19 is a new disease about which many things \nare still being discovered.\n • When something is unknown people are worried which \nleads to fear.\n • Rumours or fake news give wrong information and \nspreads the fear.\nRecognising the stigma\nIt is very important to recognise stigma and handle it. Below \nare four case studies related to these issues. Read these case \nstudies and recognise the stigma.\nCASE 1\nYou are in the grocery shop, there are several people who are \nwearing a mask. You see Babulal, the store owner, going red \nin his face as he tries to suppress a cough.\nCASE 2\nSukhram has come back from Pune where he works as a \ntaxi driver. They stay in a joint family and you have taken \nhis contact history as advised by your supervisor. You come \nto know that Sukhram’s family members have asked him to \nleave the house.\nCASE 3\nBeauty works in Delhi as a house maid. recently she has come \nback and you have been told that beauty’s employers have \nasked her to leave as she had a cold.\nCASE 4\nSurali is a young girl of 11 years. She and her 8-year-old  \nbrother are staying with an aunt as their parents have \nbeen asked to go in for isolation. Surali’s aunt keeps on \ncomplaining to you that the children are a big burden on the  \nfamily’s resources.\nWhat will you feel like if you were Babulal, Rani, Sukhram \nand Beauty?\n • Babulal has simple cough. But he is too scared to \ncough in front of people as he will loose the customers.\n • Sukhram needs family support to help him stay in \nisolation. If everyone takes proper precautions the \ninfection need not spread.\n • Beauty has a seasonal cold but she has been asked to \nleave by her employers.\n • Surali and her brother are two small children who need \nto be supported and this kind of incident can cause \nmental stress even in the future. Child Protection Cell \n(CPC) should be approached for appropriate measures \nfor helping children in difficult situations.\nChap-11.indd   199 8/24/2020   11:46:08 AM\n2024-25",
      "content_type": "text",
      "token_count": 507,
      "page_number": 3
    },
    {
      "id": "c02fb39b-acfe-4b2f-ba5f-304e3cce4510",
      "chapter_id": "4ea0df48-a5ce-43d8-8b4f-48ddfc4a6360",
      "chunk_index": 5,
      "content": "--- Page 8 ---\nHealtH and PHysical education - class X\n200\nFig. 11.5: What does stigma do?\nhttps://www.mohfw.gov.in/\nvalues anD attituDes ConDuCive for \nHealtHy anD CooPerative  living\nHow to develop values and attitudes conducive for healthy and \ncooperative living? These values have to emanate from within \na person, but they can also be developed through various \nother ways. Camping can be seen as one of these ways which \nis extremely appropriate for students, particularly during the \nadolescent period. \nWhat is camping?\nYoungsters might \nhave already attended \na camp or may have \nheard about camping \nactivities f rom friends. \nCamping is an outdoor \nactivity, where familiar \nsurroundings are left to \nspend a night or several \nnights at an outdoor \nsite. The location of \nthese sites varies as \nper the objectives of the \ntrip, time of the year \nand budget available. \nCommon camping sites are: visits to villages or rural areas \nto understand their pattern of living; mountain areas, \nnational parks, lakes, beaches, forests, etc. One can also \nplan camping activities in a nearby place, such as, open \nfields, park, or even in an open space of the school premises.  \nThe basic camping equipment include tents, cooking utensils \nor gadgets, sleeping bags, first aid kits, ropes, insect repellents, \nFig. 11.6: Camping\nChap-11.indd   200 8/24/2020   11:46:09 AM\n2024-25",
      "content_type": "text",
      "token_count": 345,
      "page_number": 3
    },
    {
      "id": "a7f221e5-b0fc-4c65-8d8b-9068856dd83f",
      "chapter_id": "4ea0df48-a5ce-43d8-8b4f-48ddfc4a6360",
      "chunk_index": 6,
      "content": "--- Page 9 ---\nHealtHy Community living\n201\netc. These requirements will vary as per the location of the \ncamping site and objectives of the trip. However, irrespective \nof the location, the essence of all camping activities revolves \naround two main features — \n (i) Bonding with nature\n (ii) Importance of living in a community. \nImportance of camping\nCamping gives students a good break, away from the \nmonotony of the classroom. It gives an opportunity to \nlearn from nature in a joyful, exciting and adventurous \nmanner. Living in the natural environment with students \nfrom different areas, cultures, religions and backgrounds, \nhelp then to learn to work as a team in various activities. \nThese activities differ from adventurous and challenging \nones, to the most basic ones, such as, cooking, cleaning, \ncollecting water, etc. In this process, students learn the \nimportance of self-reliance, teamwork, co-existence, \nimportance of natural resources and organisational skills. \nCamping also offers great opportunities for empowerment \nof the girls.\nFig. 11.7: Trekking  \nFig. 11.8: Mountaineering\n \nFig. 11.9: Rock climbing\nWhile camping, one can engage in adventure sport, \nsuch as, trekking, river rafting, mountaineering, rock \nclimbing, repelling, paragliding, caving. Adventure sport \nhelp to develop courage, self-confidence, leadership \nqualities and enhance concentration powers. This is also \na great form of physical exercise. However, these activities \nshould be conducted only in the presence of qualified and \nprofessional trainers. Joining the National Cadet Corps \n(NCC), National Service Scheme (NSS) or Bharat Scouts \nand Guides will also give you opportunities to take part in \nthese activities.\nChap-11.indd   201 8/24/2020   11:46:14 AM\n2024-25",
      "content_type": "exercise",
      "token_count": 443,
      "page_number": 3
    },
    {
      "id": "443ed298-a2d4-4727-be8d-0a0c15a55695",
      "chapter_id": "4ea0df48-a5ce-43d8-8b4f-48ddfc4a6360",
      "chunk_index": 7,
      "content": "--- Page 10 ---\nHealtH and PHysical education - class X\n202\nFig. 11.10: Zipline\n \nFig. 11.11: River rafting\nA guided walk through the forest helps to explore \nnature. It can also complement much of the textual data \nin your geography and science textbooks through direct \nexperiences. At the same time, learn to appreciate the beauty \nand simplicity of nature to make all understand how much \ndisconnected from ‘Mother Earth one has become.’ You realise \nthe importance of nature and how we should take care of it. \nMoreover, through interaction with local communities, one \nlearns about edible and medicinal plants, local crafts, first-\naid and various other sustainable forms of living. \nDuring the evenings all may gather around campfires which \ngive a great opportunity for social bonding. Campfires also \nenable to learn about different cultures through story telling, \nsongs, dances, skits and games. On many occasions hidden \ntalents of individuals are brought out during these activities.\nActivity 11.3\nSome of the camping activities have been given in the following table. Write down \nthe qualities which can be developed through the respective activities. You may \nconsult other sources for your answers.\nActivities Qualities developed\nHiking, rock climbing, trekking, rope \nclimbing, river rafting, etc.\nConfidence, leadership qualities, team-\nwork\nNature walk\nCultural activities — patriotic songs, \nlectures on Indian culture and \nheritage through dance, drama, \nsongs, story telling, skits, quizzes, etc.\nCampfire — story telling that emphasize \non moral values based on local folk \ntales, history, games and songs.\nInteraction with local community \nmembers on local crafts, medicines, \nfirst aid, food, etc.\nYoga\nVoluntary services\nChap-11.indd   202 8/24/2020   11:46:15 AM\n2024-25\n\n--- Page 11 ---\nHealtHy Community living\n203\nassessment\n I. Multiple Choice Questions",
      "content_type": "exercise",
      "token_count": 471,
      "page_number": 10
    },
    {
      "id": "15cc4525-37aa-4538-8876-6c05cacafdfb",
      "chapter_id": "4101e7e7-031f-44b3-99bb-f9eaa235e2f1",
      "chunk_index": 0,
      "content": "community living?\n  a) Cooperative action \n  b) Kindness \n  c) Harmony \n  d) Safety measures",
      "content_type": "text",
      "token_count": 23,
      "page_number": 10
    },
    {
      "id": "9c94fa4a-cb9e-4ce0-a5bd-9879715345d9",
      "chapter_id": "f0bc781b-98b2-4e70-a52b-9b3f9f072846",
      "chunk_index": 0,
      "content": "a) ecological restoration \n  b) public hygiene and health \n  c) social harmony\n  d) All of the above\n II. State whether True or false\n  a) Maintenance of public hygiene is the sole responsibility of the \ngovernment.\n  b) Community health and individual health are closely interlinked\n  c) Camping is the only means for developing values of cooperative \nliving\n  d) Overcrowding increases the risk to air borne diseases\n  e) Interpersonal relationships are as important as our physical \nenvironment.\nIII. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 133,
      "page_number": 10
    },
    {
      "id": "02cb0030-d5e8-4d50-9f39-07c5cd353c78",
      "chapter_id": "f5758ac6-1244-4dd1-b1c8-0fc8b8a9c8a5",
      "chunk_index": 0,
      "content": "examples.",
      "content_type": "example",
      "token_count": 2,
      "page_number": 10
    },
    {
      "id": "521d46e6-11eb-4499-9ada-f69ca9c69d2b",
      "chapter_id": "9f60c1f2-7d66-4a9f-859f-e48a103d39d3",
      "chunk_index": 0,
      "content": "your community are not allowed to go for the trip. What are \nthe points you would highlight to convince the parents on the \nimportance of camping trip for girls.",
      "content_type": "text",
      "token_count": 40,
      "page_number": 10
    },
    {
      "id": "72619e2e-783b-457b-9f50-79a4c6177f86",
      "chapter_id": "b8dabca6-8e5a-482c-a1a7-5e04897deb01",
      "chunk_index": 0,
      "content": "Camping Trip.",
      "content_type": "text",
      "token_count": 3,
      "page_number": 10
    },
    {
      "id": "b5d268fc-d176-4af9-aa09-4862a8b9e156",
      "chapter_id": "c1fa2374-10de-4cbc-bad0-d2efd3c18e1f",
      "chunk_index": 0,
      "content": "both at the individual and collective level, based on the points \nenumerated below. \n  For example,\n  Record your suggestions regarding cleanliness drive within the \ncommunity. The first one has been done for you.\n  I will ensure that, I do not throw litter around.\n  We will ensure that, there are no open garbage dumps in the \ncommunity.\nChap-11.indd   203 8/24/2020   11:46:15 AM\n2024-25\n\n--- Page 12 ---\nHealtH and PHysical education - class X\n204\n a) Record your suggestions regarding rules and regulations within \nthe community for safety measures.\n   I will ensure that ____________________________________________ .\n   We will ensure that __________________________________________.\n b) Record your suggestions for ensuring equal access of public \namenities to all members.\n  I will ensure that  ____________________________________________ .\n  We will ensure that  __________________________________________.\n c) Record your suggestions for adopting effective waste management \npractices.\n  I will ensure that  ____________________________________________ .\n  We will ensure that  __________________________________________.\n d) Record your suggestions for ecological restoration and \nconservation within your community.\n  I will ensure that  ____________________________________________ .\n  We will ensure that  __________________________________________.\n e) Record your suggestions for ensuring kindness and consideration \nto the aged and differently abled.\n  I will ensure that  ____________________________________________ .\n  We will ensure that  __________________________________________.\n f) Record your suggestions for counseling provisions for the youth, \nrecreational facilities, etc.\n  I will arrange for  _____________________________________________.\n  We will arrange for  __________________________________________ .",
      "content_type": "example",
      "token_count": 460,
      "page_number": 11
    },
    {
      "id": "62001764-b15e-46da-be32-9dc363f5639f",
      "chapter_id": "b0eae7d2-e3fb-46b2-8834-ac10e8e6ef05",
      "chunk_index": 0,
      "content": "for a day in a camping trip. First write down the location of the \ncamping site and objectives of the camping trip and include other \ndetails in the following table.\n  Location of camping site  _____________________________________ .\n  Objectives of the camping trip  ________________________________.\nTable : Schedule for a camping trip\nTime Activities Equipment \nRequired\nNo. of \nparticipants\nNo. of \nTeachers/ \nInstructors\nExpected \nOutcome\nBudget\nChap-11.indd   204 8/24/2020   11:46:16 AM\n2024-25",
      "content_type": "text",
      "token_count": 125,
      "page_number": 12
    }
  ]
}