{
  "textbook": {
    "id": "a8fe3960-43de-4d1e-9b84-2fedff241938",
    "file_name": "Class X Health and PE - Ch 00 - What is Physical Education.pdf",
    "title": "What is Physical Education",
    "grade": 10,
    "subject": "Class X Health and PE",
    "total_pages": 10,
    "file_size_mb": 1.3366470336914062,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:29.478719",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Health and PE/Class X Health and PE - Ch 00 - What is Physical Education.pdf"
  },
  "chapters": [
    {
      "id": "a764c3ed-54d7-43e4-8e8e-7ea1ce698869",
      "textbook_id": "a8fe3960-43de-4d1e-9b84-2fedff241938",
      "chapter_number": 1,
      "title": "1. What is Coronavirus?",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "Covid 19 is the infectious disease caused by the recently discovered coronavirus. This \nnew virus and disease were unknown before the outbreak began in Wuhan, China, in \nDecember 2019. That is why it is called the Novel (new) Coronavirus (NCoV). "
    },
    {
      "id": "835eafb8-5845-4594-a3b9-a8fee9f51250",
      "textbook_id": "a8fe3960-43de-4d1e-9b84-2fedff241938",
      "chapter_number": 2,
      "title": "2. What are the symptoms?",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "The most common symptoms of Coronavirus are fever, cough and difficulty in breathing. \nSome patients may have aches and pains, nasal congestion, runny nose, sore throat or \ndiarrhea. These symptoms are usually mild and begin gradually. Some people become \ninfected but don’t develop any symptoms and dont’t feel unwell. Most people (about \n80%) recover from the disease without needing special treatment. People with fever \ncough and difficulty in breathing should seek medical attention immediately."
    },
    {
      "id": "5bf9f5e2-dab9-4ca9-a7d7-254fa5bcd487",
      "textbook_id": "a8fe3960-43de-4d1e-9b84-2fedff241938",
      "chapter_number": 3,
      "title": "3. How does Coronavirus spread?",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "People can catch Coronavirus from others who have the virus. The disease can \nspread from person to person through small droplets from the nose or mouth which \nare spread when a person with Coronavirus coughs or exhales. These droplets land \non objects and surfaces around the person. Other people then catch Coronavirus \nby first touching these objects or surfaces, then touching their eyes, nose or mouth. \nPeople can also catch Coronavirus if they breathe in from a person with Coronavirus \nwho coughs out or exhales droplets. This is why it is important to stay more than  \n1 meter away from a person who is sick."
    },
    {
      "id": "42035af2-dbf0-4d88-9da7-756a9d2924ff",
      "textbook_id": "a8fe3960-43de-4d1e-9b84-2fedff241938",
      "chapter_number": 4,
      "title": "4. How to prevent Coronavirus?",
      "topics": [],
      "start_page": 4,
      "end_page": 11,
      "content": "Wash your hands with soap \nwater regularly.\nThrow used tissues into \nclosed bins immediately after \nuse.\nIf soap and water is not \navailable, use hand sanitiser \nwith at least 60 per cent alcohol.\nCover your nose and mouth \nwith handkerchief/tissue while \nsneezing and coughing.\nWash hands before touching \neyes, nose and mouth.\nAvoid mass gathering and \ncrowded places.\nFor more information, refer to — \nhttps://www.mohfw.gov.in/pdf/FacilitatorGuideCOVID19_27%20March.pdf\nChap-1.indd   4 8/28/2020   4:45:57 PM\n2024-25\n\n--- Page 5 ---\nPhysical Education: RElationshiP with othER subjEcts\n5\nContents related to Yoga also form a part of this area. \nCommon Yogic Practices are Yama and Niyama, Asana , \nPranayama, Pratyahara, Bandha Mudra, Shatkarma/Kriya, \nMeditation. It includes Ahara (Food), Vihara (Relaxation), \nAchara (Conduct), Vichara (Thinking), Vyavahara (Behaviour).\nTheories of training are also included in this subject area. \nThese are principles  and characteristics of sports training, \nmethods of sports training, training load, warming up, \ncooling down, aerobic and anaerobic activities, calisthenics \nand rhythmic exercises, specific training program for \ndevelopment of various motor qualities, techniques, tactics \nand talent identification. It is also important to understand \nthe difference between play, games and sports.\nPlay, GamEs and sPort\nThough these terms are used interchangeably, these are \nactually different. \nPlay\nPlay is spontaneous. It is usually a creative activity but has \nits own limitation and space. One plays voluntarily for fun \nand pleasure. Play, however, is a broad area which includes \nboth games and sports. The distinctive features of play are \nthat they are free, separate, uncertain, governed by self rules \nand creative.\nGames\nGenerally the word games and sports are used together.  \nA game is an activity involving more players, defined by a goal \nthat the players tries to reach, and some set rules to play. \nBy masses, games are played primarily for entertainment \nor enjoyment. The difference of purpose differentiates sport \nfrom game, combined with the notion of individual or team \nskill. Games are also played on the basis of a set of rules.  \nA game is defined as a goal that the players try to achieve. A \nperson who participates in a game is known as a player. \nSport\nA sport is a physical activity carried out under an agreed set \nof rules, for competition or self-enjoyment or a combination \nof these.  Sport are the kind of activities in which similar \nkind of body movement is repeated over a long time. For \nexample, swimming and running and almost all the track \nand field events come under sport. Sport involves an activity \nor activities where the mental capabilities of the sportsperson \nare judged. In a sport, it is the sportsperson or the individual \nwho determines the outcome. A person participating in a \nsport is called an athlete or a sportsperson. \nActivity 1.3\nThe teacher divides \nstudents into small groups \nof 10 and plans an aerobic \ndance or drama. Keeping \nin view the skill, creativity, \nand music, these may \neven be in the form of a \ncompetition.\nChap-1.indd   5 8/28/2020   4:45:57 PM\n2024-25\n\n--- Page 6 ---\nHealtH and PHysical education - class X\n6\nrElationshi P of hEalth and Physical  \nEducation  With othEr disciPlinEs of \nKnoWlEdGE\nHealth and Physical Education (HPE) classes provide space \nfor exploring new ideas related to personal and community \nhealth. These ideas might then be used by students in various \nother fields of learning, such as, arts, science, civics and \ncitizenship, communication, design, creativity and technology \nand languages (english, hindi and other regional languages), \nhumanities (e.g. history, geography, economics, etc.), \ninformation and communication technology and psychology.\nArt\nHealth and physical education teachers can incorporate \nactivities related to performing arts, drawing, painting, \ndance, drama, media, music and visual communication into \ntheir programs. These involve both fine motor skills and \nwhole body movement including rhythmic movement. As \nbody movements are part of both arts practice and health \nand physical education, these promote health knowledge, \nunderstanding of the body and lead to physical fitness and \nenhancing of creative skills at the same time. \nScience\nThe human body is a common concern of both science and \nhealth and physical education. In science, students study the \nhuman body from the cellular level to the systems level, with \na focus on anatomy and physiology. In health and physical \neducation learning is focused on the requirements for good \nhealth and the promotion of a healthy body. Students gain \nan understanding of the role of physical and yogic activities \nin ensuring good health and can link the functioning of the \nmusculo-skeletal, digestive, endocrine and nervous systems \nstudied in science, for the promotion of the physical, social, \nmental and emotional health of individuals within a society. \nStudents consider it their personal responsibilities to discuss \nand adopt health issues, both in relation to their own safety \nand well-being, as well as to the safety and well-being of \nothers. It also contributes in the designing of training for \nmovements of organs to achieve optimal performance in the \narea of play, sports and games.\nSocial science\nSocial sciences promote the idea that citizens require \nknowledge and understanding of civic institutions and the \nskills and willingness to actively participate in functioning \nof the society. Similarly, in health and physical education, \nChap-1.indd   6 8/28/2020   4:45:57 PM\n2024-25\n\n--- Page 7 ---\nPhysical Education: RElationshiP with othER subjEcts\n7\nstudents are encouraged to become active and responsible \nmembers of their community. Key concepts within health \nand physical education classes include understanding of \nthe importance of personal identity within a community, \nwhat makes a community and how to engage with different \nmembers and agencies within a community. Participation in \nphysical activity and sports also reflect values, rules, rights \nand responsibilities indicative of a democratic society. \nCommunication\nCommunication involves developing knowledge, skills and \nbehaviors that empower students to respond to, make meaning \nof, and deconstruct a range of communication forms. Effective \ncommunication is a key skill in health and physical education. \nIt is essential that students develop the ability to listen, view \nand respond with respect to the content and context in which \ncommunication happens. Learning in the health and physical \neducation domain involves developing familiarity with forms, \nlanguage and conventions used in different forms of public, \npersonal and interpersonal communication.\nDesign, Creativity and Technology\nDesign, Creativity and Technology (DCT) help in developing \nsport goods, sportwear, sport software programme, etc. \nThese are associated with knowledge and promotion.  In \nthis area students learn about the characteristic and \nproperties of how all these aspects differ from each other.  \nThese investigations assist students to make decisions about \nappropriate solution. Students analyse and evaluate factors, \nsuch as, social, cultural and economic factors that influence \ndesign, creativity and technology.\nLanguage(s)\nLanguages help students to develop critical approaches to \nthe ideas and thoughts collated to read, view, write, compare, \nresearch and talk about texts. Health and Physical Education \nteachers can use examples related to health and wellbeing \nto encourage students to reflect on their lifestyles and \nanalyse ways by which the media influences their attitude \ntowards health. For example, Health and Physical Education \nemphasises on the importance of physical fitness, self-esteem \nand body image in the maintenance of good health.\nEconomics\nEconomics is the study of how society allocates scarce \nresources to satisfy the wants and needs of its members. \nWithin the health and physical education (HPE) context, \nconsumer health assists students to become more \ninformed consumers of health products and services.  \nActivity 1.4\n • Identify and analyse \nhealth needs and \nservices available in \nthe community.\n • Investigate the cost of \nspecific behaviours, \nillness or disease in \nthe community, such \nas, the economic \nimpact of obesity and \ninactivity on society.\n • Explore the influence \nof government \nspending on health \noutcomes for \nindividuals and the \ncommunity.\n • Identify various \nlocations from the map \nand interpret maps \nfor outdoor adventure \nactivities.\n • Investigate the impact \nof development and \nglobalisation on \npoverty, the links \nbetween food, hunger \nand technology,  \nidentifying and locating \nfacilities and services \nthat contribute to the \nhealth and safety of \ncommunities on a local \nand national level.\nChap-1.indd   7 8/28/2020   4:45:57 PM\n2024-25\n\n--- Page 8 ---\nHealtH and PHysical education - class X\n8\nThe cost of disease emerging from unhealthy lifestyle is \nalso studied to determine the burden of disease on families \nand community.\nGeography\nStudents develop skills in reading and interpreting maps of \ndifferent kinds and at different scales. The same knowledge and \nskills are reinforced in physical education during orientation \non outdoor education activities (Trekking, Mountaineering, \netc). The investigation of local and global health issues involves \ncollecting information from maps, satellite images, statistical \ndata and information and communication technology based \nresources. These help students to understand themselves \nand their world, to apply their understanding in their present \nlives as well as make evidence based decisions that lead to \nthe kind of future they desire.\nHistory\nThe study of History reflects multiple influences and \nconnections to an array of other countries, cultures and \ntimes. The concepts of time, chronology and changes are \ncommon to both History and Health and Physical Education. \nWhile History focuses on identity from a cultural or national \nperspective, Health and Physical Education focuses on the \nrange of factors that shape personal identity.\nLike skill correction analysis programme, use of cameras \nand videos in game, use of wind gauge, Iso kinetic machines, \nconstruction and marking of play field.\nInformation and Communications Technology (ICT)\nICT can be used to access, process, manage and present \ninformation and events. It constructs new understanding and \ncommunicate with others. It is an integral part of different \ntraining measurement and evaluation and offcourse coaching \nand officiating very helpful in conducting tournament.\nMathematics\nIn Health a nd Physical Education, Mathematics provides \ntools and procedures which can be used to model situations \nand solve problems in areas, such as, scoring different \nsporting events involving time, distance, weight and number \nas variables, calculating percentage improvement in results \nfrom data collected through fitness testing or performance in \nphysical activities.\nActivity 1.5\n • Create a report and \nmay be a presentation \nabout a game of your \nchoice.\n • Capture still and \nmoving images of \nsporting activities \norganised in your \nschool and edit \nor annotate them \nto explain skill \ndevelopment or tactics.\n • Identify, collect and \nevaluate data from \nonline sources such \nas, blogs, websites \nand forums to inform \nabout myths related to \nPhysical Education. \nChap-1.indd   8 8/28/2020   4:45:57 PM\n2024-25\n\n--- Page 9 ---\nPhysical Education: RElationshiP with othER subjEcts\n9\nLanguage other than English (LOTE)\nThere are a number of martial arts developed by different \nsocieties. The text of these martial arts is discussed in the \nlocal languages. For folk dances the accompanying songs are \nin regional languages and music has its own characteristic \ntone and rhythm.\nThe concepts of movement, dance, physical activity and sport, \nvary culturally. These are associated with their own specific \nlanguages, vocabularies and discourses. Different societies have \ndifferent attitudes, values and beliefs about physical activities \nwhich are expressed in their regional languages.\nmyths and misconc EPtions about Physical  \nEducation\nMyths are surrounded in regard to relationship of physical \neducation with academic success. One of the most discussed \nmyths in the society is that participation in sport and games \nreduces academic performance of individual.\nMyths\nParticipation in sport kills the time of study. Contrary to the \nwidely held assumption that sport and other activities cut upon \nthe time for serious school study, research evidence has shown \nthat students tend to do better in school when they participate \nin physical activities. There is a positive correlation between \nperformance in sport and the level of academic achievement. \nPhysical education including sport is an integral part of the \nsocial and cultural infrastructure of a nation. It really can \nmake a difference in the broader educational process and in \nchanging and enhancing the quality of life. Vigorous physical \nexercise stimulates circulation, helps prevent skin eruptions \nand increases fluid intake. These exercises also promote \nself-worth and mental health, and support an individual for \nhealing an injury. Sport also enhances physical performance \nand induce positive physiological adaptation. When children \nexercise, their fitness needs are met, and build up energy \nto learn and achieve. Given the growing number of children \nwith obesity, watching TV, continuously being involved in \ncomputer games and other unwanted activities, frequency \nof the children getting involved in physical achievement \nand academic performance, has taken a back seat. Physical \nexercise enhances the function in joints, increases the sense \nof physical well being and promotes a sense of feeling good. It \nalso increases physical working capacity by increasing cardio-\nrespiratory fitness and increased strength and endurance \nand decreases risk of serious disease that could lead to early \ndisability and death.\nActivity 1.6\n • Identify, collect and \nevaluate data from \nonline sources, such \nas, blogs, websites \nand forums to inform \nabout myths related to \nPhysical Education.\nChap-1.indd   9 8/28/2020   4:45:57 PM\n2024-25\n\n--- Page 10 ---\nHealtH and PHysical education - class X\n10\n I. Answer in Brief"
    },
    {
      "id": "3b253885-4a19-4177-b58c-77bef947c4ed",
      "textbook_id": "a8fe3960-43de-4d1e-9b84-2fedff241938",
      "chapter_number": 6,
      "title": "2. What is the contribution of science subjects to physical education?",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": " 3. “Although physical education uses content from several \ndisciplines, it is fast emerging as a discipline.” Write two \narguments favouring this statement.\n  (a) _______________________ \n  (b) _______________________ "
    },
    {
      "id": "58dd1d7e-41f3-484a-a5b2-e6c1462bd358",
      "textbook_id": "a8fe3960-43de-4d1e-9b84-2fedff241938",
      "chapter_number": 7,
      "title": "4. Who is a physically fit person?",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": " II. Short Answer Questions"
    },
    {
      "id": "a3cdcb55-2fc9-475b-b0fd-2d9ec587a21b",
      "textbook_id": "a8fe3960-43de-4d1e-9b84-2fedff241938",
      "chapter_number": 8,
      "title": "1. Should physical education and sports be an integral part of",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "learning? Justify your answer. Give at least three reasons.\n 2. “All sports can be games, but not all games can be sports” Give at \nleast two arguments for or against the statement.\n  (a) _______________________ \n  (b) _______________________\nassEssmEnt\nChap-1.indd   10 8/28/2020   4:45:57 PM\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "2124d954-e791-44a8-9794-79eb73a3f0f5",
      "chapter_id": "a764c3ed-54d7-43e4-8e8e-7ea1ce698869",
      "chunk_index": 0,
      "content": "Covid 19 is the infectious disease caused by the recently discovered coronavirus. This \nnew virus and disease were unknown before the outbreak began in Wuhan, China, in \nDecember 2019. That is why it is called the Novel (new) Coronavirus (NCoV).",
      "content_type": "text",
      "token_count": 61,
      "page_number": 4
    },
    {
      "id": "60defec9-9be0-432e-9cbe-fb371872a2d4",
      "chapter_id": "835eafb8-5845-4594-a3b9-a8fee9f51250",
      "chunk_index": 0,
      "content": "The most common symptoms of Coronavirus are fever, cough and difficulty in breathing. \nSome patients may have aches and pains, nasal congestion, runny nose, sore throat or \ndiarrhea. These symptoms are usually mild and begin gradually. Some people become \ninfected but don’t develop any symptoms and dont’t feel unwell. Most people (about \n80%) recover from the disease without needing special treatment. People with fever \ncough and difficulty in breathing should seek medical attention immediately.",
      "content_type": "text",
      "token_count": 125,
      "page_number": 4
    },
    {
      "id": "f6f3aa3b-6e59-4275-beb7-ad16f4644654",
      "chapter_id": "5bf9f5e2-dab9-4ca9-a7d7-254fa5bcd487",
      "chunk_index": 0,
      "content": "People can catch Coronavirus from others who have the virus. The disease can \nspread from person to person through small droplets from the nose or mouth which \nare spread when a person with Coronavirus coughs or exhales. These droplets land \non objects and surfaces around the person. Other people then catch Coronavirus \nby first touching these objects or surfaces, then touching their eyes, nose or mouth. \nPeople can also catch Coronavirus if they breathe in from a person with Coronavirus \nwho coughs out or exhales droplets. This is why it is important to stay more than  \n1 meter away from a person who is sick.",
      "content_type": "text",
      "token_count": 154,
      "page_number": 4
    },
    {
      "id": "6b19b567-c246-4489-8daf-54691e6af621",
      "chapter_id": "42035af2-dbf0-4d88-9da7-756a9d2924ff",
      "chunk_index": 0,
      "content": "Wash your hands with soap \nwater regularly.\nThrow used tissues into \nclosed bins immediately after \nuse.\nIf soap and water is not \navailable, use hand sanitiser \nwith at least 60 per cent alcohol.\nCover your nose and mouth \nwith handkerchief/tissue while \nsneezing and coughing.\nWash hands before touching \neyes, nose and mouth.\nAvoid mass gathering and \ncrowded places.\nFor more information, refer to — \nhttps://www.mohfw.gov.in/pdf/FacilitatorGuideCOVID19_27%20March.pdf\nChap-1.indd   4 8/28/2020   4:45:57 PM\n2024-25",
      "content_type": "text",
      "token_count": 129,
      "page_number": 4
    },
    {
      "id": "9dc36482-8065-4526-ae8d-42bf7a4bde0a",
      "chapter_id": "42035af2-dbf0-4d88-9da7-756a9d2924ff",
      "chunk_index": 1,
      "content": "--- Page 5 ---\nPhysical Education: RElationshiP with othER subjEcts\n5\nContents related to Yoga also form a part of this area. \nCommon Yogic Practices are Yama and Niyama, Asana , \nPranayama, Pratyahara, Bandha Mudra, Shatkarma/Kriya, \nMeditation. It includes Ahara (Food), Vihara (Relaxation), \nAchara (Conduct), Vichara (Thinking), Vyavahara (Behaviour).\nTheories of training are also included in this subject area. \nThese are principles  and characteristics of sports training, \nmethods of sports training, training load, warming up, \ncooling down, aerobic and anaerobic activities, calisthenics \nand rhythmic exercises, specific training program for \ndevelopment of various motor qualities, techniques, tactics \nand talent identification. It is also important to understand \nthe difference between play, games and sports.\nPlay, GamEs and sPort\nThough these terms are used interchangeably, these are \nactually different. \nPlay\nPlay is spontaneous. It is usually a creative activity but has \nits own limitation and space. One plays voluntarily for fun \nand pleasure. Play, however, is a broad area which includes \nboth games and sports. The distinctive features of play are \nthat they are free, separate, uncertain, governed by self rules \nand creative.\nGames\nGenerally the word games and sports are used together.  \nA game is an activity involving more players, defined by a goal \nthat the players tries to reach, and some set rules to play. \nBy masses, games are played primarily for entertainment \nor enjoyment. The difference of purpose differentiates sport \nfrom game, combined with the notion of individual or team \nskill. Games are also played on the basis of a set of rules.  \nA game is defined as a goal that the players try to achieve. A \nperson who participates in a game is known as a player. \nSport\nA sport is a physical activity carried out under an agreed set \nof rules, for competition or self-enjoyment or a combination \nof these.  Sport are the kind of activities in which similar \nkind of body movement is repeated over a long time. For \nexample, swimming and running and almost all the track \nand field events come under sport. Sport involves an activity \nor activities where the mental capabilities of the sportsperson \nare judged. In a sport, it is the sportsperson or the individual \nwho determines the outcome. A person participating in a \nsport is called an athlete or a sportsperson. \nActivity 1.3\nThe teacher divides \nstudents into small groups \nof 10 and plans an aerobic \ndance or drama. Keeping \nin view the skill, creativity, \nand music, these may \neven be in the form of a \ncompetition.\nChap-1.indd   5 8/28/2020   4:45:57 PM\n2024-25",
      "content_type": "example",
      "token_count": 666,
      "page_number": 4
    },
    {
      "id": "09cecb85-62f4-4fff-8d2f-7064cd7cdc97",
      "chapter_id": "42035af2-dbf0-4d88-9da7-756a9d2924ff",
      "chunk_index": 2,
      "content": "--- Page 6 ---\nHealtH and PHysical education - class X\n6\nrElationshi P of hEalth and Physical  \nEducation  With othEr disciPlinEs of \nKnoWlEdGE\nHealth and Physical Education (HPE) classes provide space \nfor exploring new ideas related to personal and community \nhealth. These ideas might then be used by students in various \nother fields of learning, such as, arts, science, civics and \ncitizenship, communication, design, creativity and technology \nand languages (english, hindi and other regional languages), \nhumanities (e.g. history, geography, economics, etc.), \ninformation and communication technology and psychology.\nArt\nHealth and physical education teachers can incorporate \nactivities related to performing arts, drawing, painting, \ndance, drama, media, music and visual communication into \ntheir programs. These involve both fine motor skills and \nwhole body movement including rhythmic movement. As \nbody movements are part of both arts practice and health \nand physical education, these promote health knowledge, \nunderstanding of the body and lead to physical fitness and \nenhancing of creative skills at the same time. \nScience\nThe human body is a common concern of both science and \nhealth and physical education. In science, students study the \nhuman body from the cellular level to the systems level, with \na focus on anatomy and physiology. In health and physical \neducation learning is focused on the requirements for good \nhealth and the promotion of a healthy body. Students gain \nan understanding of the role of physical and yogic activities \nin ensuring good health and can link the functioning of the \nmusculo-skeletal, digestive, endocrine and nervous systems \nstudied in science, for the promotion of the physical, social, \nmental and emotional health of individuals within a society. \nStudents consider it their personal responsibilities to discuss \nand adopt health issues, both in relation to their own safety \nand well-being, as well as to the safety and well-being of \nothers. It also contributes in the designing of training for \nmovements of organs to achieve optimal performance in the \narea of play, sports and games.\nSocial science\nSocial sciences promote the idea that citizens require \nknowledge and understanding of civic institutions and the \nskills and willingness to actively participate in functioning \nof the society. Similarly, in health and physical education, \nChap-1.indd   6 8/28/2020   4:45:57 PM\n2024-25",
      "content_type": "example",
      "token_count": 614,
      "page_number": 4
    },
    {
      "id": "7514a9d6-45c9-4f2c-96c5-551375769aaf",
      "chapter_id": "42035af2-dbf0-4d88-9da7-756a9d2924ff",
      "chunk_index": 3,
      "content": "--- Page 7 ---\nPhysical Education: RElationshiP with othER subjEcts\n7\nstudents are encouraged to become active and responsible \nmembers of their community. Key concepts within health \nand physical education classes include understanding of \nthe importance of personal identity within a community, \nwhat makes a community and how to engage with different \nmembers and agencies within a community. Participation in \nphysical activity and sports also reflect values, rules, rights \nand responsibilities indicative of a democratic society. \nCommunication\nCommunication involves developing knowledge, skills and \nbehaviors that empower students to respond to, make meaning \nof, and deconstruct a range of communication forms. Effective \ncommunication is a key skill in health and physical education. \nIt is essential that students develop the ability to listen, view \nand respond with respect to the content and context in which \ncommunication happens. Learning in the health and physical \neducation domain involves developing familiarity with forms, \nlanguage and conventions used in different forms of public, \npersonal and interpersonal communication.\nDesign, Creativity and Technology\nDesign, Creativity and Technology (DCT) help in developing \nsport goods, sportwear, sport software programme, etc. \nThese are associated with knowledge and promotion.  In \nthis area students learn about the characteristic and \nproperties of how all these aspects differ from each other.  \nThese investigations assist students to make decisions about \nappropriate solution. Students analyse and evaluate factors, \nsuch as, social, cultural and economic factors that influence \ndesign, creativity and technology.\nLanguage(s)\nLanguages help students to develop critical approaches to \nthe ideas and thoughts collated to read, view, write, compare, \nresearch and talk about texts. Health and Physical Education \nteachers can use examples related to health and wellbeing \nto encourage students to reflect on their lifestyles and \nanalyse ways by which the media influences their attitude \ntowards health. For example, Health and Physical Education \nemphasises on the importance of physical fitness, self-esteem \nand body image in the maintenance of good health.\nEconomics\nEconomics is the study of how society allocates scarce \nresources to satisfy the wants and needs of its members. \nWithin the health and physical education (HPE) context, \nconsumer health assists students to become more \ninformed consumers of health products and services.  \nActivity 1.4\n • Identify and analyse \nhealth needs and \nservices available in \nthe community.\n • Investigate the cost of \nspecific behaviours, \nillness or disease in \nthe community, such \nas, the economic \nimpact of obesity and \ninactivity on society.\n • Explore the influence \nof government \nspending on health \noutcomes for \nindividuals and the \ncommunity.\n • Identify various \nlocations from the map \nand interpret maps \nfor outdoor adventure \nactivities.\n • Investigate the impact \nof development and \nglobalisation on \npoverty, the links \nbetween food, hunger \nand technology,  \nidentifying and locating \nfacilities and services \nthat contribute to the \nhealth and safety of \ncommunities on a local \nand national level.\nChap-1.indd   7 8/28/2020   4:45:57 PM\n2024-25",
      "content_type": "example",
      "token_count": 824,
      "page_number": 4
    },
    {
      "id": "9c9c3c53-3987-4619-abe1-6025793e24ef",
      "chapter_id": "42035af2-dbf0-4d88-9da7-756a9d2924ff",
      "chunk_index": 4,
      "content": "--- Page 8 ---\nHealtH and PHysical education - class X\n8\nThe cost of disease emerging from unhealthy lifestyle is \nalso studied to determine the burden of disease on families \nand community.\nGeography\nStudents develop skills in reading and interpreting maps of \ndifferent kinds and at different scales. The same knowledge and \nskills are reinforced in physical education during orientation \non outdoor education activities (Trekking, Mountaineering, \netc). The investigation of local and global health issues involves \ncollecting information from maps, satellite images, statistical \ndata and information and communication technology based \nresources. These help students to understand themselves \nand their world, to apply their understanding in their present \nlives as well as make evidence based decisions that lead to \nthe kind of future they desire.\nHistory\nThe study of History reflects multiple influences and \nconnections to an array of other countries, cultures and \ntimes. The concepts of time, chronology and changes are \ncommon to both History and Health and Physical Education. \nWhile History focuses on identity from a cultural or national \nperspective, Health and Physical Education focuses on the \nrange of factors that shape personal identity.\nLike skill correction analysis programme, use of cameras \nand videos in game, use of wind gauge, Iso kinetic machines, \nconstruction and marking of play field.\nInformation and Communications Technology (ICT)\nICT can be used to access, process, manage and present \ninformation and events. It constructs new understanding and \ncommunicate with others. It is an integral part of different \ntraining measurement and evaluation and offcourse coaching \nand officiating very helpful in conducting tournament.\nMathematics\nIn Health a nd Physical Education, Mathematics provides \ntools and procedures which can be used to model situations \nand solve problems in areas, such as, scoring different \nsporting events involving time, distance, weight and number \nas variables, calculating percentage improvement in results \nfrom data collected through fitness testing or performance in \nphysical activities.\nActivity 1.5\n • Create a report and \nmay be a presentation \nabout a game of your \nchoice.\n • Capture still and \nmoving images of \nsporting activities \norganised in your \nschool and edit \nor annotate them \nto explain skill \ndevelopment or tactics.\n • Identify, collect and \nevaluate data from \nonline sources such \nas, blogs, websites \nand forums to inform \nabout myths related to \nPhysical Education. \nChap-1.indd   8 8/28/2020   4:45:57 PM\n2024-25",
      "content_type": "exercise",
      "token_count": 650,
      "page_number": 4
    },
    {
      "id": "e0c9aa7a-f091-4065-8841-0a8b733b94b8",
      "chapter_id": "42035af2-dbf0-4d88-9da7-756a9d2924ff",
      "chunk_index": 5,
      "content": "--- Page 9 ---\nPhysical Education: RElationshiP with othER subjEcts\n9\nLanguage other than English (LOTE)\nThere are a number of martial arts developed by different \nsocieties. The text of these martial arts is discussed in the \nlocal languages. For folk dances the accompanying songs are \nin regional languages and music has its own characteristic \ntone and rhythm.\nThe concepts of movement, dance, physical activity and sport, \nvary culturally. These are associated with their own specific \nlanguages, vocabularies and discourses. Different societies have \ndifferent attitudes, values and beliefs about physical activities \nwhich are expressed in their regional languages.\nmyths and misconc EPtions about Physical  \nEducation\nMyths are surrounded in regard to relationship of physical \neducation with academic success. One of the most discussed \nmyths in the society is that participation in sport and games \nreduces academic performance of individual.\nMyths\nParticipation in sport kills the time of study. Contrary to the \nwidely held assumption that sport and other activities cut upon \nthe time for serious school study, research evidence has shown \nthat students tend to do better in school when they participate \nin physical activities. There is a positive correlation between \nperformance in sport and the level of academic achievement. \nPhysical education including sport is an integral part of the \nsocial and cultural infrastructure of a nation. It really can \nmake a difference in the broader educational process and in \nchanging and enhancing the quality of life. Vigorous physical \nexercise stimulates circulation, helps prevent skin eruptions \nand increases fluid intake. These exercises also promote \nself-worth and mental health, and support an individual for \nhealing an injury. Sport also enhances physical performance \nand induce positive physiological adaptation. When children \nexercise, their fitness needs are met, and build up energy \nto learn and achieve. Given the growing number of children \nwith obesity, watching TV, continuously being involved in \ncomputer games and other unwanted activities, frequency \nof the children getting involved in physical achievement \nand academic performance, has taken a back seat. Physical \nexercise enhances the function in joints, increases the sense \nof physical well being and promotes a sense of feeling good. It \nalso increases physical working capacity by increasing cardio-\nrespiratory fitness and increased strength and endurance \nand decreases risk of serious disease that could lead to early \ndisability and death.\nActivity 1.6\n • Identify, collect and \nevaluate data from \nonline sources, such \nas, blogs, websites \nand forums to inform \nabout myths related to \nPhysical Education.\nChap-1.indd   9 8/28/2020   4:45:57 PM\n2024-25\n\n--- Page 10 ---\nHealtH and PHysical education - class X\n10\n I. Answer in Brief",
      "content_type": "exercise",
      "token_count": 720,
      "page_number": 11
    },
    {
      "id": "09964d7a-8cdc-4eb0-9215-8a39635037b2",
      "chapter_id": "3b253885-4a19-4177-b58c-77bef947c4ed",
      "chunk_index": 0,
      "content": "3. “Although physical education uses content from several \ndisciplines, it is fast emerging as a discipline.” Write two \narguments favouring this statement.\n  (a) _______________________ \n  (b) _______________________",
      "content_type": "text",
      "token_count": 54,
      "page_number": 11
    },
    {
      "id": "ecaa57f4-0c9b-45f8-8759-abb245672ebb",
      "chapter_id": "58dd1d7e-41f3-484a-a5b2-e6c1462bd358",
      "chunk_index": 0,
      "content": "II. Short Answer Questions",
      "content_type": "exercise",
      "token_count": 6,
      "page_number": 11
    },
    {
      "id": "64c941f7-36a0-415a-b61e-1c6336f2a69c",
      "chapter_id": "a3cdcb55-2fc9-475b-b0fd-2d9ec587a21b",
      "chunk_index": 0,
      "content": "learning? Justify your answer. Give at least three reasons.\n 2. “All sports can be games, but not all games can be sports” Give at \nleast two arguments for or against the statement.\n  (a) _______________________ \n  (b) _______________________\nassEssmEnt\nChap-1.indd   10 8/28/2020   4:45:57 PM\n2024-25",
      "content_type": "text",
      "token_count": 75,
      "page_number": 12
    }
  ]
}