{
  "textbook": {
    "id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
    "file_name": "Class X Health and PE - Ch 00 - Safety at the Work Place.pdf",
    "title": "Safety at the Work Place",
    "grade": 10,
    "subject": "Class X Health and PE",
    "total_pages": 12,
    "file_size_mb": 2.036592483520508,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:30.455788",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Health and PE/Class X Health and PE - Ch 00 - Safety at the Work Place.pdf"
  },
  "chapters": [
    {
      "id": "f1c3478e-8564-491f-9754-429a169cf638",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 6,
      "title": "6. Rodenticides",
      "topics": [],
      "start_page": 2,
      "end_page": 2,
      "content": " • Concentrate on work and avoid talking.\n • Switch off electricity if the machine is not in use.\n • Keep extra or spare parts carefully in proper places so \nthat they do not fall on any one. \n • Avoid touching the moving parts of any machine.  \nThis may tear-off the skin or cause burn due to heat.\nCertain safety equipment and gadgets are used in various areas —\n • Helmets\n • Spectacles\n • Gloves\n • Apron\n • Insulating Boots\n • Face Mask\nHandling insecticides \nInsecticides are chemicals or herbs to kill or drive away \nhousehold and agriculture pests like rats, cockroaches, etc.  \nWhile they are safe to use if proper instructions are followed \nbut carelessness may cause serious accidents.\nCommon insecticides are —"
    },
    {
      "id": "f064f090-6aa4-4efe-a929-37ec876004df",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 8,
      "title": "2. tablets kept in grain containers to control grain",
      "topics": [],
      "start_page": 2,
      "end_page": 2,
      "content": "insects."
    },
    {
      "id": "d83eb4e8-7aa1-452b-8ba0-bfd263d8af39",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 9,
      "title": "3. naphthalene balls – used in cupboards and drawers",
      "topics": [],
      "start_page": 2,
      "end_page": 2,
      "content": "to preserve clothes from clothes moth. \nCertain dos and don’ts for safety while using insecticides \nare —"
    },
    {
      "id": "e80c2d4c-0c26-4c99-97d4-414666b563e2",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 12,
      "title": "3. insecticide tablets in grain containers",
      "topics": [],
      "start_page": 2,
      "end_page": 4,
      "content": "Household insecticides\n • Spray cans should be kept away from children and \ndestroyed after use.\n • Keep the nozzle of the insecticide container away from \nchildren.\n • Container used for spray need to be shaken well \nbefore use otherwise the liquid content may spoil \nyour hand.\n • One should read the information brochure attached \nwith container and avoid frequent use of sprays.\n • One should not keep the  windows and doors closed for \nlong after the spray.\nActivity 10.1\n • Enlist and paste \npictures of the safety \nequipment’s  or gadgets \nof any five sports of \nyour choice.\n • Name the tablets kept \nin grain containers to \ncontrol grain insect.\n • Enlist five household \ninsecticides.\nChap-10.indd   182 8/24/2020   11:45:08 AM\n2024-25\n\n--- Page 3 ---\nSafety MeaSureS for HealtHy living\n183\n • If accidently sprayed on your body parts, immediately \nwash with plenty of water and soap.\n • If pesticide is accidently sprayed on your clothes,  \nremove them immediately.\n • Do not use if any member of your family suffers from \nallergy and asthma.\nAgriculture insecticide\nIn addition to the precautions mentioned above, remember \nto —\n • cover your body parts with a dress used for this \npurpose. Wash this thoroughly after every scheduled \nspray and do not use it if not washed and dried. It can \ncause serious insecticide poisoning.\n • cover your eyes and face with spectacles and mask.\n • take a bath as soon as possible after the spray.\nInsecticide tablets in grain containers\n • Always use the tablets after tying in a cloth piece. \n • Wash hands with soap and water as soon as you touch \nthe tablets.\n • Keep the tablets out of reach of children.\n • Remove the tablets before boiling rice or giving wheat \nfor grinding.\n • Shift the patient to the hospital if a tablet is ingested \naccidently.\nHandling electricity and electric gadgets\nElectricity is a boon for modern civilisation.  However, if \ndue care is not taken while handling electricity and electric \ngadgets, it may prove fatal. For safe use of electric gadgets, \nfollow the guidelines given below —\n • Always use MCBs (Miniature Circuit Breakers) installed \nat main switch board.\n • Immediately change the heated sockets and switches if \nthere is sparking.\n • Always read the accompanying instructions before \nusing the gadget.\n • Do not touch any electric switch or gadget with moist \nhands.\n • Do not leave the electric gadgets on, if not being used.\n • Always wear shoes or rubber slippers while using a \ngadget to prevent electric shock in accidental leaking \nof current.\nDo You Know?\nInsecticides are chemicals \nor herbs to kill or drive \naway household pests \nlike rats, cockroaches etc.\nChap-10.indd   183 8/24/2020   11:45:08 AM\n2024-25\n\n--- Page 4 ---\nHealtH and PHysical education - class X\n184\n • Never try to repair the gadgets yourselves, if you are \nnot trained.\n • Always switch the electric supply off before and after \nusing the gadgets.\n • Never be in close proximity with electric wires, fire and \nwater. Always use dry sand in case of fire to douse it.\n • Always get the servicing of the electrical gadgets done \nas per schedule.\n • Use government approved (ISI mark), electrical gadgets  \nand fittings.\nfirSt aid\nYou must have met with certain emergency situations \nwhen you needed urgent medical treatment but it was not  \navailable immediately. You might have seen someone \nhelping a person by providing first aid and then in reaching  \nthe hospital. \nWhat is First Aid?\nFirst aid is the immediate and essential temporary care \ngiven to a wounded, injured or sick person, in an emergency \nsituation to reduce the suffering of the patient, prevent \nfurther complication of injury or sickness before availing \nprofessional medical assistance.\nPriorities of First Aid\nRemember the following priorities before giving first aid — "
    },
    {
      "id": "3ec022ce-5842-4f12-9638-863e3ccc5a83",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 13,
      "title": "1. Maintain ABC",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": " a) Airway: Clear the airway if blocked\n b) Breathing: Check breathing and give artificial \nrespiration if necessary.\n c) Circulation: Give chest compressions if heart has \nstopped"
    },
    {
      "id": "fc1480a3-863f-4c82-a207-e4ef2e55fccc",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 19,
      "title": "7. Transfer the patient to the nearest health centre",
      "topics": [],
      "start_page": 4,
      "end_page": 12,
      "content": "When is First Aid required?\nThere are many conditions where first aid is required. You \nhave studied a few in Class IX.\nActivity 10.2\n • Discuss with your \nclassmates the need of \nfirst aid.\n • List the most essential \nitems in a First Aid Box \nand draw a diagram.\nDo You Know?\nC-A-B means —\n • compression\n • airways\n • breathing\nIt helps to perform CPR.\nChap-10.indd   184 8/24/2020   11:45:08 AM\n2024-25\n\n--- Page 5 ---\nSafety MeaSureS for HealtHy living\n185\nThe can be following situations may arise where you \nmight need to provide first aid —\nThe person is unconscious and not breathing\nHere CPR (Cardio Pulmonary Resuscitation) is required. It \nis a life saving measure used when the heart and breathing \nhas stopped.\nStarting CPR within three minutes of heart stoppage is \nvery important or else brain will be damaged.\nCardio Pulmonary Resuscitation (CPR): Circulation is \nmaintained by chest compressions. Draw a line between the \ntwo nipples and keep the heel of the hand over the centre \nof this line. Place the other hand over it and give chest \ncompressions pressing down the breast bone 1.5 to 2 inches.\nFig. 10.1: Giving chest compressions\nThe ratio of chest compressions to breathing should be \n30:2 (i.e. 30 chest compressions and 2 artificial breaths per \nminute) as we have to provide a heart rate of approximately \n100 beats per minute.\nOpen the airway: The \nairway is cleared by finger  \nsweep if required. Any foreign \nbody, secretion, food, broken \nteeth or tongue falling back are \nremoved.\nThe airway is kept open by \ntilting the head backwards and \nlifting the chin upwards.\nFig. 10.2: Head tilt \nand chin lift\nDo You Know?\n • CPR (Cardio Pulmonary \nResuscitation) must \nbe given soon after \nbreathing has stopped.\n • If you are untrained \nthen give CPR only \nthrough hands for \n100-120 per minute \nand continue until \nsigns of movements \nor medical help has \narrived.\nActivity 10.3\nObserve the activity \nperform by teacher \nand do activity under \nthe supervision of the \nteacher.\nC- Cardio means heart,\nP-  Pulmonary means \nlungs and \nR-  Resuscitation \nmeans to revive\nChap-10.indd   185 8/24/2020   11:45:10 AM\n2024-25\n\n--- Page 6 ---\nHealtH and PHysical education - class X\n186\nBreathing: Breathing is artificially conducted by mouth \nto mouth technique. Keep your handkerchief over the mouth \nof the unconscious person. Pinch the nose of the person with \none hand while tilting the head backwards and lifting the \nchin upwards.\nContinue CPR till either the person is revived or medical \nhelp arrives.\nThe person is unconscious and  breathing\nPlace the unconscious casualty in recovery position as \nexplained in Fig. 10.4.\n • Extend the arm nearest up alongside the person’s head. \n • Bring the other arm across the person’s chest and place \nthe back of the hand against the cheek. \n • Grasp the leg just above the knee and pull it up so that \nthe foot is flat on the ground. \n • Roll the person far enough for the face to be angled \nforward. \n • Position the elbow and knee to help stabilise the head \nand body\nMedicine S and their effectS on individual S\nMedicines are chemicals and biochemical substances which \nare used to prevent, cure or correct deficiency disorders in the  \nbody. Many substances have been used as medicines since \nages in one or the other form, but modern times have seen a \ntremendous growth in terms of types and usage of medicines.  \nWhile medicines are used to treat diseases and can be life \nsaving, they can harm the body if not used correctly.\nMedicines are used in the form of injections, tablets, \nsyrups, creams, lotions, solutions, drops, powder, sprays \nand straps.\nMedicines affect us in many ways.  Some of the common \nways are —\n • Analgesics — reducing pain and in fever.\n • Antibodies — killing or weakening microbes and infections.\n • Lotions — in burns and allergies, for soothing effect.\n • Supplements — correcting deficiencies due to vitamins, \nnutrients.\n • Antipsychotic drugs — modifying the body’s response, \npsychological disorders.\n • Vaccines and inoculations and immunisation — \nProtecting and preventing.\n • Hormones — supporting physiological functions.\n • Herbal medicines — plants herbs\nAlthough  medicines assist us to lead a healthy life free \nof diseases, there are also certain undesirable effects  due to \nDo You Know?\n30 compressions followed \nby two breaths counts \nconsists of one cycle of \nCPR.\nFig. 10.3: Performing mouth to \nmouth breathing\nFig. 10.4: Recovery position\nActivity 10.4\nLet us learn about \ncommon medicines, \ntheir effects and what \nhappens if they are used \nincorrectly.\nChap-10.indd   186 8/24/2020   11:45:11 AM\n2024-25\n\n--- Page 7 ---\nSafety MeaSureS for HealtHy living\n187\nmechanism of action of the medicine or if taken more than \nthe recommended dose. Thus, it is important to take the \nmedicines only under medical supervision.\nPrecautions while taking medicines\nMedicines need to be used in the required dose so that they \nshould not only have the desired effect but also prevent \nundesired side effects. Some of the precautions while taking \nmedicines are —\n • Take medicines only if prescribed by a doctor. Self \nmedication may be dangerous.\n • Take the recommended dose of the medicine and at \nthe prescribed interval. Only then there will be desired \neffects. One should never adjust the dose oneself.\n • Do not minimise or exceed the dose and frequency of \ntaking the medicine. This can cause undesirable effects\n • Adult dose of medicines should not be given to children. \nThere are special forms and doses of medicines for \nchildren. Keep all medicines out of reach of children. \nIngestion by them may cause emergency.\n • Store the medicines away from extreme temperature \nand sunlight.\n • Always check the expiry date of medicines before \nconsumption.\n • Use a  full cup of water and drink standing upright \nwhile swallowing a tablet.\n • Do not take any medicine on an empty stomach unless \nprescribed by the doctor.\n • Keep a list of medicines one is allergic to. Always tell \nthe doctor about such medicine(s). \n • Always visit the doctor if one experiences any unusual \nsymptom while taking the prescribed medicines.\n • It is important that the medicine should be taken \nregularly for the entire period and duration as prescribed \nby the doctor. Otherwise the disease due to infections \ncan return. \nSubStance (drug) abuSe \nIn an effort to establish their identity and desire for \nexperimentation, adolescents often try out new things. \nAlso they are more amenable to external influences, such  \nas, the media and peers. This makes them more vulnerable \nto substance misuse, especially when they do not have \ncorrect and scientific information. They also lack life skills \nto deal with the wide ranging negative outcomes of extreme \ndependency on a substance and thereby, getting addicted  \nto it.\nDo You Know?\nOur physiological \nfunctions are supported \nby hormones.\nActivity 10.5\nWhat is the use of \nvitamins in our body?\nChap-10.indd   187 8/24/2020   11:45:11 AM\n2024-25\n\n--- Page 8 ---\nHealtH and PHysical education - class X\n188\nWhat is substance abuse?\nAs you have learnt, drugs affect the body by changing \nthe mental and physical status of a person. Some other \nsubstances also work in the same way and are not necessarily \ndrugs.  The non-medical use of a substance including drugs, \nthat changes an individual’s mental and physical status and \naffect the health adversely, is known as substance abuse. \nOnce a person starts using a substance, his mental state \nis altered and the person cannot get out of this habit. The \nextreme dependency on the substance compels them to  \nincrease the intake every day. This is called addiction. \nSubstance misuse is widespread today including \nadolescents across the world.  Socially acceptable drugs \nlike tobacco and alcohol abuse not only ruins the life of the \nindividual but can also influence them to associated with \ncrime and violence.\nCommonly abused substances \nThere are substances that can be abused for their mood-\naltering effects such as inhalants and solvents. On the other \nhand, there are drugs that can be abused that have no mood-\naltering or intoxication properties, such as, anabolic steroids. \nThey are abused by the adolescents and youth during body \nbuilding, to look more muscular.\nCommonly abused substances are tobacco, alcohol, \nmarijuana (ganja), opium, cannabis, solvents (petrol, glue, \ncorrection ink) and aerosols inhalants, cough syrup, caffeine, \ncocaine and ecstasy.  There are other substances like gutka \nand paan (betel). \nThese substances can be ingested, inhaled, drunk, \nchewed or injected by a syringe in the blood.  Some of these \nsubstances make one addicted, even if taken once.\nReasons for substance abuse in young people \nYoung people are more vulnerable to substance abuse due to \nthe following reasons —\n • During the process of growing up, poor self-esteem, low \nachievement at school, performance pressures, etc,. \nare some of the factors that promote substance abuse \nin adolescence.  Resorting to substance use as a means \nof ‘growing up’ or fun also makes the adolescents more \nvulnerable to substance abuse.\n • Pressure from peers or friends to try an addictive \nsubstance, the urge to gain popularity among friends, \nand desire to experiment and curiosity to try out new \nthings also make young people particularly vulnerable \nto substance abuse.\nChap-10.indd   188 8/24/2020   11:45:11 AM\n2024-25\n\n--- Page 9 ---\nSafety MeaSureS for HealtHy living\n189\n • Previous experience of taking substance.\n • Family history of substance misuse.\n • Lack of support from family, friends and school. \n • Lack of knowledge about the effects and dangers of \nconsuming addictive substances.\n • Glamorising substance misuse  by media misleads \nyoung people. \n • Easy availability of substances and drugs are the main \nreasons for substance misuse in young people.\n • Social approval of substance abuse like tobacco, paan, \nbeetel nut, gutka chewing or taking wine in parties \nencourages young people to initiate abuse of these \nsubstances.\nCASE 1\nSohan has performed well in Class IX annual exams. Now, he \nis worried whether he will be able to keep up his performance \nand score good grades in Class X. His parents always tell him \nhow they expect to see him at the top of his class.  Afraid \nof disappointing them, Sohan does not share his concerns \nwith his parents. He feels that some of his friends may be \ngoing through the same phase and discusses his problem with \nthem. His friends suggest that smoking may reduce his stress \nand help him to relax. Sohan wants to feel better and decides \nto follow his friends’ advice. He starts smoking a cigarette or \ntwo everyday.  Without realising, over a period of six months \nhe was smoking 6-10 cigarettes a day. Smoking has become a \nhabit with him, and in future, it was the cause of his ill health.\nPoints for Discussion\n a) What do you think is responsible for Sohan’s habit of \nsmoking and why?\n b) Do you think smoking helped reduce Sohan’s stress? \nWhy?\n c) What else could Sohan have done to reduce his stress \neffectively? \n d) What role could Sohan’s parents have played to prevent \nhim from smoking? \nConsequences of substance abuse\nSubstance misuse leads to a number of short-term and long-\nterm effects that are detrimental to health. \nShort-term effects: These are effects that appear only \na few minutes after the intake of substance. The user feels \na false sense of well-being and a pleasant drowsiness.  \nSome of the short-term effects are distorted vision, hearing \nand coordination, impaired judgment, bad breath and \nhangovers.\nChap-10.indd   189 8/24/2020   11:45:11 AM\n2024-25\n\n--- Page 10 ---\nHealtH and PHysical education - class X\n190\nLong-term effects: Substances having a long-term \nimpact lead to serious damage due to constant and excessive \nuse. These effects show up over a course of time and are \nusually caused by progressive damage to different body \norgans. Some of the health consequences include irregular \neating habits, sleep disorders, poor hygiene resulting in \npoor health and low immunity. This predisposes substance \nabuser to diseases and infections. \nSubstance abuse in itself is not a cause of HIV/AIDS or \nSTDs but under the influence of drugs, people may engage \nin risk-behaviours that make them more susceptible to \nthese infections. Injectable drug users, however, are more \nprone to HIV in conditions where the users do not sterilise \nneedles and share needles to inject the drug. \nSubstance users may even die suddenly from a so-called \noverdose, when one consumes more than what the body \ncan tolerate. Death may also occur from long-term damage \nto the organs of the body.\nThese substances are especially harmful if consumed \nduring pregnancy. These substances reach the foetus \nthrough blood and harm it by crippling its growth and \ndevelopment or death. \nSubstance abuse influences not only the individual \nand family but also the community. The persons who get \naddicted often lose interest in other activities be it school, \njob or any other responsibility. They are not able to take \ncare of their responsibilities and may become a liability \nfor their families and finally the society. Furthermore, it is \nexpensive to buy substances or drugs on a regular basis. \nHence, in desperation, addicted individuals may be forced \nto engage in petty severe crimes. \nPrevention of drug abuse\nPaying attention to the following may prevent young people \nfrom misusing substances —\n • Peer pressure can be managed by being aware of \nthe implications of substance abuse and developing \nlife skills. One can not only save oneself from \nadopting risky behaviours under peer pressure but \nalso persuade the peers not to engage in unhealthy \nbehaviours such as substance misuse. Advocacy \nwith the involvement of local community can be quite \nuseful.\n • The different ways of dealing with negative peer \npressure are saying ‘No’ assertively, making an \nexcuse, reversal of pressure, and giving reasons.\n • Young people should also be educated to recognise \nthat a friend is someone who cares, protects and looks \nActivity 10.6\nDiscuss how a substance \nabuser’s life gets affected.\nChap-10.indd   190 8/24/2020   11:45:11 AM\n2024-25\n\n--- Page 11 ---\nSafety MeaSureS for HealtHy living\n191\nafter the welfare of their friends rather than force and \ninitiate into unhealthy habits. \n • Young people should be empowered with life skills to \nknow about their body and their life. They should be \ntaking well-informed and responsible decisions.\n • The family and society should provide the support \nsystem for young children in their ‘low’ times.\n • As the attitudes related to smoking, drinking and \nmisuse of other substances are formed during \npre-adolescence and early adolescence, this is an \nimportant age to invest in prevention efforts. The \nfamily, community and educational institutions \nshould empower young people with correct and \nscientific information.\nYoung children should be encouraged to get engaged \nin socially productive activities. For example, one can \nstart a learning centre for the lesser advantaged children \nin the neighbourhood, one can learn Braille and help at \nblind school, and one can create awareness about water \nconservation in the neighbourhood. This will help them to \nchannelise their energy, being away from the menace of \nsubstance abuse and also inculcate social responsibility\nChap-10.indd   191 8/24/2020   11:45:11 AM\n2024-25\n\n--- Page 12 ---\nHealtH and PHysical education - class X\n192\naSSeSSMent\n I. Answer the following Questions"
    },
    {
      "id": "2648a844-46e6-41d3-8873-55c8921fa071",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 20,
      "title": "1. State three precautions one should take while working with a",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "machine. "
    },
    {
      "id": "386f5fb0-fcb8-45e8-9476-1f8252c6dc58",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 21,
      "title": "2. While opening a bottle containing liquid insecticide, the liquid fell",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "on your clothes. How can you prevent its harmful effects on you?"
    },
    {
      "id": "c9837d18-925f-46e3-b2d1-ed243e925614",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 22,
      "title": "3. Electrical gadgets are used in all households. What are the",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "requirements of these gadgets which will prevent you from getting \nan electric shock?"
    },
    {
      "id": "284a81cc-1e33-4763-8280-d34eae2bc279",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 23,
      "title": "4. What do you understand by First Aid? What are the priorities you",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "should keep in mind before administering first aid?"
    },
    {
      "id": "fb613e42-9a2a-4c6d-ab33-78659193cfb9",
      "textbook_id": "08f5a6b7-baa8-42d2-9fbf-90436e81164a",
      "chapter_number": 27,
      "title": "8. List the long term effects of substance abuse. If your friend falls",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "into the trap of substance use, what will you do to dissuade him?\nChap-10.indd   192 8/24/2020   11:45:11 AM\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "961b29ca-3e5b-4982-9181-f9020c44ae7b",
      "chapter_id": "f1c3478e-8564-491f-9754-429a169cf638",
      "chunk_index": 0,
      "content": "• Concentrate on work and avoid talking.\n • Switch off electricity if the machine is not in use.\n • Keep extra or spare parts carefully in proper places so \nthat they do not fall on any one. \n • Avoid touching the moving parts of any machine.  \nThis may tear-off the skin or cause burn due to heat.\nCertain safety equipment and gadgets are used in various areas —\n • Helmets\n • Spectacles\n • Gloves\n • Apron\n • Insulating Boots\n • Face Mask\nHandling insecticides \nInsecticides are chemicals or herbs to kill or drive away \nhousehold and agriculture pests like rats, cockroaches, etc.  \nWhile they are safe to use if proper instructions are followed \nbut carelessness may cause serious accidents.\nCommon insecticides are —",
      "content_type": "text",
      "token_count": 180,
      "page_number": 2
    },
    {
      "id": "374a023c-468a-4652-bc79-dd888f4164d9",
      "chapter_id": "f064f090-6aa4-4efe-a929-37ec876004df",
      "chunk_index": 0,
      "content": "insects.",
      "content_type": "text",
      "token_count": 2,
      "page_number": 2
    },
    {
      "id": "f0b94da2-170a-4b9c-84f2-dace9940b7b8",
      "chapter_id": "d83eb4e8-7aa1-452b-8ba0-bfd263d8af39",
      "chunk_index": 0,
      "content": "to preserve clothes from clothes moth. \nCertain dos and don’ts for safety while using insecticides \nare —",
      "content_type": "text",
      "token_count": 26,
      "page_number": 2
    },
    {
      "id": "0c791fda-7f52-4a9d-9e08-77866643b58e",
      "chapter_id": "e80c2d4c-0c26-4c99-97d4-414666b563e2",
      "chunk_index": 0,
      "content": "Household insecticides\n • Spray cans should be kept away from children and \ndestroyed after use.\n • Keep the nozzle of the insecticide container away from \nchildren.\n • Container used for spray need to be shaken well \nbefore use otherwise the liquid content may spoil \nyour hand.\n • One should read the information brochure attached \nwith container and avoid frequent use of sprays.\n • One should not keep the  windows and doors closed for \nlong after the spray.\nActivity 10.1\n • Enlist and paste \npictures of the safety \nequipment’s  or gadgets \nof any five sports of \nyour choice.\n • Name the tablets kept \nin grain containers to \ncontrol grain insect.\n • Enlist five household \ninsecticides.\nChap-10.indd   182 8/24/2020   11:45:08 AM\n2024-25\n\n--- Page 3 ---\nSafety MeaSureS for HealtHy living\n183\n • If accidently sprayed on your body parts, immediately \nwash with plenty of water and soap.\n • If pesticide is accidently sprayed on your clothes,  \nremove them immediately.\n • Do not use if any member of your family suffers from \nallergy and asthma.\nAgriculture insecticide\nIn addition to the precautions mentioned above, remember \nto —\n • cover your body parts with a dress used for this \npurpose. Wash this thoroughly after every scheduled \nspray and do not use it if not washed and dried. It can \ncause serious insecticide poisoning.\n • cover your eyes and face with spectacles and mask.\n • take a bath as soon as possible after the spray.\nInsecticide tablets in grain containers\n • Always use the tablets after tying in a cloth piece. \n • Wash hands with soap and water as soon as you touch \nthe tablets.\n • Keep the tablets out of reach of children.\n • Remove the tablets before boiling rice or giving wheat \nfor grinding.\n • Shift the patient to the hospital if a tablet is ingested \naccidently.\nHandling electricity and electric gadgets\nElectricity is a boon for modern civilisation.  However, if \ndue care is not taken while handling electricity and electric \ngadgets, it may prove fatal. For safe use of electric gadgets, \nfollow the guidelines given below —\n • Always use MCBs (Miniature Circuit Breakers) installed \nat main switch board.\n • Immediately change the heated sockets and switches if \nthere is sparking.\n • Always read the accompanying instructions before \nusing the gadget.\n • Do not touch any electric switch or gadget with moist \nhands.\n • Do not leave the electric gadgets on, if not being used.\n • Always wear shoes or rubber slippers while using a \ngadget to prevent electric shock in accidental leaking \nof current.\nDo You Know?\nInsecticides are chemicals \nor herbs to kill or drive \naway household pests \nlike rats, cockroaches etc.\nChap-10.indd   183 8/24/2020   11:45:08 AM\n2024-25",
      "content_type": "text",
      "token_count": 679,
      "page_number": 2
    },
    {
      "id": "e2952077-1948-49f8-a2fb-dba5b061c191",
      "chapter_id": "e80c2d4c-0c26-4c99-97d4-414666b563e2",
      "chunk_index": 1,
      "content": "--- Page 4 ---\nHealtH and PHysical education - class X\n184\n • Never try to repair the gadgets yourselves, if you are \nnot trained.\n • Always switch the electric supply off before and after \nusing the gadgets.\n • Never be in close proximity with electric wires, fire and \nwater. Always use dry sand in case of fire to douse it.\n • Always get the servicing of the electrical gadgets done \nas per schedule.\n • Use government approved (ISI mark), electrical gadgets  \nand fittings.\nfirSt aid\nYou must have met with certain emergency situations \nwhen you needed urgent medical treatment but it was not  \navailable immediately. You might have seen someone \nhelping a person by providing first aid and then in reaching  \nthe hospital. \nWhat is First Aid?\nFirst aid is the immediate and essential temporary care \ngiven to a wounded, injured or sick person, in an emergency \nsituation to reduce the suffering of the patient, prevent \nfurther complication of injury or sickness before availing \nprofessional medical assistance.\nPriorities of First Aid\nRemember the following priorities before giving first aid —",
      "content_type": "text",
      "token_count": 275,
      "page_number": 4
    },
    {
      "id": "21c4a9fe-d8e3-492c-abec-3716ab2670a7",
      "chapter_id": "3ec022ce-5842-4f12-9638-863e3ccc5a83",
      "chunk_index": 0,
      "content": "a) Airway: Clear the airway if blocked\n b) Breathing: Check breathing and give artificial \nrespiration if necessary.\n c) Circulation: Give chest compressions if heart has \nstopped",
      "content_type": "text",
      "token_count": 44,
      "page_number": 4
    },
    {
      "id": "b8afbc95-f5ec-4b13-afc3-c9c12c529fb4",
      "chapter_id": "fc1480a3-863f-4c82-a207-e4ef2e55fccc",
      "chunk_index": 0,
      "content": "When is First Aid required?\nThere are many conditions where first aid is required. You \nhave studied a few in Class IX.\nActivity 10.2\n • Discuss with your \nclassmates the need of \nfirst aid.\n • List the most essential \nitems in a First Aid Box \nand draw a diagram.\nDo You Know?\nC-A-B means —\n • compression\n • airways\n • breathing\nIt helps to perform CPR.\nChap-10.indd   184 8/24/2020   11:45:08 AM\n2024-25\n\n--- Page 5 ---\nSafety MeaSureS for HealtHy living\n185\nThe can be following situations may arise where you \nmight need to provide first aid —\nThe person is unconscious and not breathing\nHere CPR (Cardio Pulmonary Resuscitation) is required. It \nis a life saving measure used when the heart and breathing \nhas stopped.\nStarting CPR within three minutes of heart stoppage is \nvery important or else brain will be damaged.\nCardio Pulmonary Resuscitation (CPR): Circulation is \nmaintained by chest compressions. Draw a line between the \ntwo nipples and keep the heel of the hand over the centre \nof this line. Place the other hand over it and give chest \ncompressions pressing down the breast bone 1.5 to 2 inches.\nFig. 10.1: Giving chest compressions\nThe ratio of chest compressions to breathing should be \n30:2 (i.e. 30 chest compressions and 2 artificial breaths per \nminute) as we have to provide a heart rate of approximately \n100 beats per minute.\nOpen the airway: The \nairway is cleared by finger  \nsweep if required. Any foreign \nbody, secretion, food, broken \nteeth or tongue falling back are \nremoved.\nThe airway is kept open by \ntilting the head backwards and \nlifting the chin upwards.\nFig. 10.2: Head tilt \nand chin lift\nDo You Know?\n • CPR (Cardio Pulmonary \nResuscitation) must \nbe given soon after \nbreathing has stopped.\n • If you are untrained \nthen give CPR only \nthrough hands for \n100-120 per minute \nand continue until \nsigns of movements \nor medical help has \narrived.\nActivity 10.3\nObserve the activity \nperform by teacher \nand do activity under \nthe supervision of the \nteacher.\nC- Cardio means heart,\nP-  Pulmonary means \nlungs and \nR-  Resuscitation \nmeans to revive\nChap-10.indd   185 8/24/2020   11:45:10 AM\n2024-25",
      "content_type": "text",
      "token_count": 536,
      "page_number": 4
    },
    {
      "id": "a31400f6-242f-4c22-b631-5e56697b0ea0",
      "chapter_id": "fc1480a3-863f-4c82-a207-e4ef2e55fccc",
      "chunk_index": 1,
      "content": "--- Page 6 ---\nHealtH and PHysical education - class X\n186\nBreathing: Breathing is artificially conducted by mouth \nto mouth technique. Keep your handkerchief over the mouth \nof the unconscious person. Pinch the nose of the person with \none hand while tilting the head backwards and lifting the \nchin upwards.\nContinue CPR till either the person is revived or medical \nhelp arrives.\nThe person is unconscious and  breathing\nPlace the unconscious casualty in recovery position as \nexplained in Fig. 10.4.\n • Extend the arm nearest up alongside the person’s head. \n • Bring the other arm across the person’s chest and place \nthe back of the hand against the cheek. \n • Grasp the leg just above the knee and pull it up so that \nthe foot is flat on the ground. \n • Roll the person far enough for the face to be angled \nforward. \n • Position the elbow and knee to help stabilise the head \nand body\nMedicine S and their effectS on individual S\nMedicines are chemicals and biochemical substances which \nare used to prevent, cure or correct deficiency disorders in the  \nbody. Many substances have been used as medicines since \nages in one or the other form, but modern times have seen a \ntremendous growth in terms of types and usage of medicines.  \nWhile medicines are used to treat diseases and can be life \nsaving, they can harm the body if not used correctly.\nMedicines are used in the form of injections, tablets, \nsyrups, creams, lotions, solutions, drops, powder, sprays \nand straps.\nMedicines affect us in many ways.  Some of the common \nways are —\n • Analgesics — reducing pain and in fever.\n • Antibodies — killing or weakening microbes and infections.\n • Lotions — in burns and allergies, for soothing effect.\n • Supplements — correcting deficiencies due to vitamins, \nnutrients.\n • Antipsychotic drugs — modifying the body’s response, \npsychological disorders.\n • Vaccines and inoculations and immunisation — \nProtecting and preventing.\n • Hormones — supporting physiological functions.\n • Herbal medicines — plants herbs\nAlthough  medicines assist us to lead a healthy life free \nof diseases, there are also certain undesirable effects  due to \nDo You Know?\n30 compressions followed \nby two breaths counts \nconsists of one cycle of \nCPR.\nFig. 10.3: Performing mouth to \nmouth breathing\nFig. 10.4: Recovery position\nActivity 10.4\nLet us learn about \ncommon medicines, \ntheir effects and what \nhappens if they are used \nincorrectly.\nChap-10.indd   186 8/24/2020   11:45:11 AM\n2024-25",
      "content_type": "text",
      "token_count": 621,
      "page_number": 4
    },
    {
      "id": "72a5cfa2-7b82-4afc-94c1-5774866c3625",
      "chapter_id": "fc1480a3-863f-4c82-a207-e4ef2e55fccc",
      "chunk_index": 2,
      "content": "--- Page 7 ---\nSafety MeaSureS for HealtHy living\n187\nmechanism of action of the medicine or if taken more than \nthe recommended dose. Thus, it is important to take the \nmedicines only under medical supervision.\nPrecautions while taking medicines\nMedicines need to be used in the required dose so that they \nshould not only have the desired effect but also prevent \nundesired side effects. Some of the precautions while taking \nmedicines are —\n • Take medicines only if prescribed by a doctor. Self \nmedication may be dangerous.\n • Take the recommended dose of the medicine and at \nthe prescribed interval. Only then there will be desired \neffects. One should never adjust the dose oneself.\n • Do not minimise or exceed the dose and frequency of \ntaking the medicine. This can cause undesirable effects\n • Adult dose of medicines should not be given to children. \nThere are special forms and doses of medicines for \nchildren. Keep all medicines out of reach of children. \nIngestion by them may cause emergency.\n • Store the medicines away from extreme temperature \nand sunlight.\n • Always check the expiry date of medicines before \nconsumption.\n • Use a  full cup of water and drink standing upright \nwhile swallowing a tablet.\n • Do not take any medicine on an empty stomach unless \nprescribed by the doctor.\n • Keep a list of medicines one is allergic to. Always tell \nthe doctor about such medicine(s). \n • Always visit the doctor if one experiences any unusual \nsymptom while taking the prescribed medicines.\n • It is important that the medicine should be taken \nregularly for the entire period and duration as prescribed \nby the doctor. Otherwise the disease due to infections \ncan return. \nSubStance (drug) abuSe \nIn an effort to establish their identity and desire for \nexperimentation, adolescents often try out new things. \nAlso they are more amenable to external influences, such  \nas, the media and peers. This makes them more vulnerable \nto substance misuse, especially when they do not have \ncorrect and scientific information. They also lack life skills \nto deal with the wide ranging negative outcomes of extreme \ndependency on a substance and thereby, getting addicted  \nto it.\nDo You Know?\nOur physiological \nfunctions are supported \nby hormones.\nActivity 10.5\nWhat is the use of \nvitamins in our body?\nChap-10.indd   187 8/24/2020   11:45:11 AM\n2024-25",
      "content_type": "text",
      "token_count": 592,
      "page_number": 4
    },
    {
      "id": "7afa9692-62c4-4c87-b305-3ab6682e3ce3",
      "chapter_id": "fc1480a3-863f-4c82-a207-e4ef2e55fccc",
      "chunk_index": 3,
      "content": "--- Page 8 ---\nHealtH and PHysical education - class X\n188\nWhat is substance abuse?\nAs you have learnt, drugs affect the body by changing \nthe mental and physical status of a person. Some other \nsubstances also work in the same way and are not necessarily \ndrugs.  The non-medical use of a substance including drugs, \nthat changes an individual’s mental and physical status and \naffect the health adversely, is known as substance abuse. \nOnce a person starts using a substance, his mental state \nis altered and the person cannot get out of this habit. The \nextreme dependency on the substance compels them to  \nincrease the intake every day. This is called addiction. \nSubstance misuse is widespread today including \nadolescents across the world.  Socially acceptable drugs \nlike tobacco and alcohol abuse not only ruins the life of the \nindividual but can also influence them to associated with \ncrime and violence.\nCommonly abused substances \nThere are substances that can be abused for their mood-\naltering effects such as inhalants and solvents. On the other \nhand, there are drugs that can be abused that have no mood-\naltering or intoxication properties, such as, anabolic steroids. \nThey are abused by the adolescents and youth during body \nbuilding, to look more muscular.\nCommonly abused substances are tobacco, alcohol, \nmarijuana (ganja), opium, cannabis, solvents (petrol, glue, \ncorrection ink) and aerosols inhalants, cough syrup, caffeine, \ncocaine and ecstasy.  There are other substances like gutka \nand paan (betel). \nThese substances can be ingested, inhaled, drunk, \nchewed or injected by a syringe in the blood.  Some of these \nsubstances make one addicted, even if taken once.\nReasons for substance abuse in young people \nYoung people are more vulnerable to substance abuse due to \nthe following reasons —\n • During the process of growing up, poor self-esteem, low \nachievement at school, performance pressures, etc,. \nare some of the factors that promote substance abuse \nin adolescence.  Resorting to substance use as a means \nof ‘growing up’ or fun also makes the adolescents more \nvulnerable to substance abuse.\n • Pressure from peers or friends to try an addictive \nsubstance, the urge to gain popularity among friends, \nand desire to experiment and curiosity to try out new \nthings also make young people particularly vulnerable \nto substance abuse.\nChap-10.indd   188 8/24/2020   11:45:11 AM\n2024-25",
      "content_type": "exercise",
      "token_count": 607,
      "page_number": 4
    },
    {
      "id": "1944669c-52af-4603-b0e2-0cdadfe99f05",
      "chapter_id": "fc1480a3-863f-4c82-a207-e4ef2e55fccc",
      "chunk_index": 4,
      "content": "--- Page 9 ---\nSafety MeaSureS for HealtHy living\n189\n • Previous experience of taking substance.\n • Family history of substance misuse.\n • Lack of support from family, friends and school. \n • Lack of knowledge about the effects and dangers of \nconsuming addictive substances.\n • Glamorising substance misuse  by media misleads \nyoung people. \n • Easy availability of substances and drugs are the main \nreasons for substance misuse in young people.\n • Social approval of substance abuse like tobacco, paan, \nbeetel nut, gutka chewing or taking wine in parties \nencourages young people to initiate abuse of these \nsubstances.\nCASE 1\nSohan has performed well in Class IX annual exams. Now, he \nis worried whether he will be able to keep up his performance \nand score good grades in Class X. His parents always tell him \nhow they expect to see him at the top of his class.  Afraid \nof disappointing them, Sohan does not share his concerns \nwith his parents. He feels that some of his friends may be \ngoing through the same phase and discusses his problem with \nthem. His friends suggest that smoking may reduce his stress \nand help him to relax. Sohan wants to feel better and decides \nto follow his friends’ advice. He starts smoking a cigarette or \ntwo everyday.  Without realising, over a period of six months \nhe was smoking 6-10 cigarettes a day. Smoking has become a \nhabit with him, and in future, it was the cause of his ill health.\nPoints for Discussion\n a) What do you think is responsible for Sohan’s habit of \nsmoking and why?\n b) Do you think smoking helped reduce Sohan’s stress? \nWhy?\n c) What else could Sohan have done to reduce his stress \neffectively? \n d) What role could Sohan’s parents have played to prevent \nhim from smoking? \nConsequences of substance abuse\nSubstance misuse leads to a number of short-term and long-\nterm effects that are detrimental to health. \nShort-term effects: These are effects that appear only \na few minutes after the intake of substance. The user feels \na false sense of well-being and a pleasant drowsiness.  \nSome of the short-term effects are distorted vision, hearing \nand coordination, impaired judgment, bad breath and \nhangovers.\nChap-10.indd   189 8/24/2020   11:45:11 AM\n2024-25",
      "content_type": "exercise",
      "token_count": 558,
      "page_number": 4
    },
    {
      "id": "97635ea7-96c0-47f4-877e-2ce0607ffa2f",
      "chapter_id": "fc1480a3-863f-4c82-a207-e4ef2e55fccc",
      "chunk_index": 5,
      "content": "--- Page 10 ---\nHealtH and PHysical education - class X\n190\nLong-term effects: Substances having a long-term \nimpact lead to serious damage due to constant and excessive \nuse. These effects show up over a course of time and are \nusually caused by progressive damage to different body \norgans. Some of the health consequences include irregular \neating habits, sleep disorders, poor hygiene resulting in \npoor health and low immunity. This predisposes substance \nabuser to diseases and infections. \nSubstance abuse in itself is not a cause of HIV/AIDS or \nSTDs but under the influence of drugs, people may engage \nin risk-behaviours that make them more susceptible to \nthese infections. Injectable drug users, however, are more \nprone to HIV in conditions where the users do not sterilise \nneedles and share needles to inject the drug. \nSubstance users may even die suddenly from a so-called \noverdose, when one consumes more than what the body \ncan tolerate. Death may also occur from long-term damage \nto the organs of the body.\nThese substances are especially harmful if consumed \nduring pregnancy. These substances reach the foetus \nthrough blood and harm it by crippling its growth and \ndevelopment or death. \nSubstance abuse influences not only the individual \nand family but also the community. The persons who get \naddicted often lose interest in other activities be it school, \njob or any other responsibility. They are not able to take \ncare of their responsibilities and may become a liability \nfor their families and finally the society. Furthermore, it is \nexpensive to buy substances or drugs on a regular basis. \nHence, in desperation, addicted individuals may be forced \nto engage in petty severe crimes. \nPrevention of drug abuse\nPaying attention to the following may prevent young people \nfrom misusing substances —\n • Peer pressure can be managed by being aware of \nthe implications of substance abuse and developing \nlife skills. One can not only save oneself from \nadopting risky behaviours under peer pressure but \nalso persuade the peers not to engage in unhealthy \nbehaviours such as substance misuse. Advocacy \nwith the involvement of local community can be quite \nuseful.\n • The different ways of dealing with negative peer \npressure are saying ‘No’ assertively, making an \nexcuse, reversal of pressure, and giving reasons.\n • Young people should also be educated to recognise \nthat a friend is someone who cares, protects and looks \nActivity 10.6\nDiscuss how a substance \nabuser’s life gets affected.\nChap-10.indd   190 8/24/2020   11:45:11 AM\n2024-25",
      "content_type": "text",
      "token_count": 644,
      "page_number": 4
    },
    {
      "id": "b1440cfb-49be-4c51-afa8-a14a4d83cfad",
      "chapter_id": "fc1480a3-863f-4c82-a207-e4ef2e55fccc",
      "chunk_index": 6,
      "content": "--- Page 11 ---\nSafety MeaSureS for HealtHy living\n191\nafter the welfare of their friends rather than force and \ninitiate into unhealthy habits. \n • Young people should be empowered with life skills to \nknow about their body and their life. They should be \ntaking well-informed and responsible decisions.\n • The family and society should provide the support \nsystem for young children in their ‘low’ times.\n • As the attitudes related to smoking, drinking and \nmisuse of other substances are formed during \npre-adolescence and early adolescence, this is an \nimportant age to invest in prevention efforts. The \nfamily, community and educational institutions \nshould empower young people with correct and \nscientific information.\nYoung children should be encouraged to get engaged \nin socially productive activities. For example, one can \nstart a learning centre for the lesser advantaged children \nin the neighbourhood, one can learn Braille and help at \nblind school, and one can create awareness about water \nconservation in the neighbourhood. This will help them to \nchannelise their energy, being away from the menace of \nsubstance abuse and also inculcate social responsibility\nChap-10.indd   191 8/24/2020   11:45:11 AM\n2024-25\n\n--- Page 12 ---\nHealtH and PHysical education - class X\n192\naSSeSSMent\n I. Answer the following Questions",
      "content_type": "example",
      "token_count": 334,
      "page_number": 12
    },
    {
      "id": "065273b5-f906-4573-8c01-603690fd2196",
      "chapter_id": "2648a844-46e6-41d3-8873-55c8921fa071",
      "chunk_index": 0,
      "content": "machine.",
      "content_type": "text",
      "token_count": 2,
      "page_number": 12
    },
    {
      "id": "9b9f5584-ddca-4abe-91dc-43873148e266",
      "chapter_id": "386f5fb0-fcb8-45e8-9476-1f8252c6dc58",
      "chunk_index": 0,
      "content": "on your clothes. How can you prevent its harmful effects on you?",
      "content_type": "text",
      "token_count": 16,
      "page_number": 12
    },
    {
      "id": "b69ff167-e4d2-4b92-824b-e71c600b9bea",
      "chapter_id": "c9837d18-925f-46e3-b2d1-ed243e925614",
      "chunk_index": 0,
      "content": "requirements of these gadgets which will prevent you from getting \nan electric shock?",
      "content_type": "text",
      "token_count": 21,
      "page_number": 12
    },
    {
      "id": "39f4033b-4594-422b-bb24-b031b5a4ee90",
      "chapter_id": "284a81cc-1e33-4763-8280-d34eae2bc279",
      "chunk_index": 0,
      "content": "should keep in mind before administering first aid?",
      "content_type": "text",
      "token_count": 12,
      "page_number": 12
    },
    {
      "id": "cd424db6-3e0a-450b-8ae2-1875e00061b9",
      "chapter_id": "fb613e42-9a2a-4c6d-ab33-78659193cfb9",
      "chunk_index": 0,
      "content": "into the trap of substance use, what will you do to dissuade him?\nChap-10.indd   192 8/24/2020   11:45:11 AM\n2024-25",
      "content_type": "text",
      "token_count": 29,
      "page_number": 13
    }
  ]
}