{
  "textbook": {
    "id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
    "file_name": "Class X Health and PE - Ch 00 - as, Basketball, Cricket, Football, Handball, Hockey, Kabaddi,.pdf",
    "title": "as, Basketball, Cricket, Football, Handball, Hockey, Kabaddi,",
    "grade": 10,
    "subject": "Class X Health and PE",
    "total_pages": 34,
    "file_size_mb": 6.704715728759766,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:36.500705",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Health and PE/Class X Health and PE - Ch 00 - as, Basketball, Cricket, Football, Handball, Hockey, Kabaddi,.pdf"
  },
  "chapters": [
    {
      "id": "d5b7e70f-5416-4a6e-98c9-ac3a2942a99c",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 1,
      "title": "1951. After that it started being organised annually.",
      "topics": [],
      "start_page": 2,
      "end_page": 5,
      "content": "Basketball court measurements\nFig. 6.2: Basketball court, a basket and a basketball\n28m\n15m\n1.575m\n0.90m Sideline Throw-in line\n8.325m\nThreePointLine\n0.15m\n6.75mNo-chargeSemi-Circle\n3.6m\nCentreCircle\nEndline Centre line\nRestricted\nArea\nEndline\nSideline\nBasketball is played on a rectangular court, which should \nbe an indoor wooden court or an outdoor concrete court \nhaving two side lines and two end lines. The dimensions \nof basketball court is 28 x15 meters. The court is divided \n18 inch\nwide Diameter\nChap-6.indd   78 8/24/2020   11:39:23 AM\n2024-25\n\n--- Page 3 ---\nTeam Games and sporTs I\n79\ninto two sections, called half-courts, by the mid-court line, \nwhich is where the game starts with a jump ball. A jump \nball is when a referee throws the ball up at center circle to \ndetermine which team gets possession. Two players from \nopposing teams jump up to tap the ball out of the circle in \norder to gain control over the ball take the game forward. The \nbasketball posts are located at the opposite ends of the court.\nRules\nDuration of a Match (Total 4 Quarters)\nPlay Rest Play Half time Play Rest Play\n10 min 2 min 10 min 15 min 10 min 2 min 10 min\n • The duration of the game of each quarter is ten \nminutes with 2 minutes rest between 1st and 2nd \nquarter and 3rd and 4th quarter, also 15 minutes \nrest between 2nd and 3rd quarter. Extra time period \nis of about 5 minutes. Teams exchange the side after \nhalf time. The clock is stopped while the play is not \nactive. Therefore, it takes longer time to complete the \ngame than the allotted time.\n • A team must consist of twelve (12) members. But \nonly five players from each team may be on the court \nat one time. Substitutions are unlimited but can only \nbe done when the play is stopped. \n • The team with the ball, attempting to score in \ntheir basket is ‘on offense’, the team that prevents \nopposite team from scoring is ‘on defence’. The ball is \nmoved in two ways: either dribbling or by passing to \nteammates. If the ball goes out of the court, the ball \npossession is given to the opposite team. \n • For both men’s and women’s teams, a standard \nuniform consists of a pair of shorts and a jersey \nwith a clearly visible bib number, printed on both \nthe front and back. Players should wear appropriate \nshoes that provide extra ankle support. \n • The game is controlled by the officials consisting \nof the three (3) referees, out of which one (1) is the \noverall incharge and the other four (4) table officials \nare responsible for keeping other records of each \nteams scoring, timekeeping, individual and team \nfouls, player substitutions, alternating possession \narrow, and stop–and-go-clock, etc.\n • The essential equipment in basketball game is the \nball, clocks, score sheets, scoreboard(s), alternating \npossession arrows and other required equipments.\n • An attempt to unfairly disadvantage an opponent \nthrough physical contact is illegal and called a foul. \nChap-6.indd   79 8/24/2020   11:39:23 AM\n2024-25\n\n--- Page 4 ---\nHealtH and PHysical education - class X\n80\nPlayers who are fouled either get ball possession or \nare awarded one or two free throws and one point \nis awarded for successfully converting a free throw, \nwhich is attempted from a line 15 feet (4.6 m) from \nthe basket. Each player is allowed 5 personal fouls \nbefore they are disqualified from the game. At this \npoint they no longer remain a part of the game.\n • Two points are awarded when a basket is scored \nduring the game but three points are awarded when \na basket is scored from outside the 6.25 mtrs line. \nFundamental skills\nWe are well aware that, to play any game one has to learn \nsome skills. Similarly to play basketball game a player \nshould learn the following fundamental skills. \nDribbling\nIt is important to penetrate to score a basket, move the \nball across the court, get away from the defenders, and \nfind a good passing lane. There are different types of \ndribbling — \n • basic dribble\n • low dribbling\n • high dribble\n • behind the back\n • crossover dribble \n • change-of-pace\n • between the legs dribble\nPassing\nA good offensive attack requires accurate passing from \nplayers. It helps find an open man, to find a good shooter \nor to get away from a defender. There are several types of \npasses used in basketball, either one hand or both hand \npass —\n • Overhead \n • Chest \n • Push \n • Baseball \n • Off-the-dribble \n • Bounce \n • Shoulder \n • Hook \nFig. 6.3: Dribbling\nChap-6.indd   80 8/24/2020   11:39:24 AM\n2024-25\n\n--- Page 5 ---\nTeam Games and sporTs I\n81\nFig. 6.4: Passing\n18 inch\nwide Diameter\nShooting\nFig. 6.5: Shooting\nThe objective of the game is to win by scoring maximum \npoints. Therefore, improving the team’s shooting is \nimportant to win a game. Shooting with either one hand \nor both hands is done in the following ways —\n • Jump shot \n • Dunk shot\n • Free throw \n • Layup\n • Three-point shot \n • Hook shot\nChap-6.indd   81 8/24/2020   11:39:25 AM\n2024-25\n\n--- Page 6 ---\nHealtH and PHysical education - class X\n82\nDefence\nFig. 6.6: Defence\nThe game of basketball allows a variety of defences to be \ndeployed in an effort to disrupt and combat offensive \nplays. Here are examples of the three basic categories of \nteam defences. In addition, each category comprises of an \nassortment of different variations.\n • Man to man defence: Man-to-man defences match \nup the defenders against specific offensive players. \nDefenders are usually assigned to be matched up with \noffensive players by size and ability.\n • Zone Defence: In Zone defence, defenders are assigned \nto guard specific areas on the court. Zones are named \nor designated by their player alignments.\n • Combined Defence: A third type of defence that can be \ndeployed is the combination defence. With combina-\ntion defences, some of the players are assigned to play \nman-to-man while the rest of the defenders play zone. \nCombination defences are usually deployed in an effort \nto stop or neutralise great individual offensive players. \nRebounding\nThe objective of rebounding is to successfully gain possession \nof the basketball after a missed field point or free throw, as it \nrebounds from the ring or backboard. This plays a major role \nin the game, as most possessions end when a team misses \na shot. There are two categories of rebounds: offensive \nrebounds, in which the ball is recovered by the offensive side \nand does not change possession, and defensive rebounds, \nin which the defending team gains possession of the loose \nball. The majority of rebounds are defensive, as the team \non defence tends to be in better position to recover missed \nshots.\nChap-6.indd   82 8/24/2020   11:39:26 AM\n2024-25\n\n--- Page 7 ---\nTeam Games and sporTs I\n83\nFig. 6.7: Rebounding\nArjun awardees\nS.No. Name of Player Year"
    },
    {
      "id": "c22be10e-71fa-4ae8-8072-a86e62921355",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 7,
      "title": "6. Prashanti Singh 2017",
      "topics": [],
      "start_page": 5,
      "end_page": 14,
      "content": "CriCket\nIntroduction\nCricket is a bat and ball game played between two teams \non a field, at the centre of which is a rectangular pitch. One \nteam bats, trying to defend the wicket and scoring as many \nruns as possible. The other team bowls and fields, trying to \ndismiss the batsmen and thus limiting the runs scored by \nthe batting team. A run is scored by the striking batsman \nhitting the ball with his bat, running to the opposite end \nof the pitch and touching the crease there without being \ndismissed. The teams switch between batting and fielding at \nthe end of an inning.\nChap-6.indd   83 8/24/2020   11:39:26 AM\n2024-25\n\n--- Page 8 ---\nHealtH and PHysical education - class X\n84\nHistory\nThe game of cricket, as it is played today, has its origin in the \nsouth eastern part of England. Cricket became a generally \nadopted sport in the second half of the seventeenth century. \nThe Hambeldon club which was founded in about 1750’s \nhad played a significant part in the evolution of the game. \nIt was superseded by the Marylebone Cricket Club (M.C.C) \nwith its headquarters at Lords, London. Cricket became \nan international game with the formation of the Imperial \nCricket Conference (I.C.C) in 1909. The name of Imperial \nCricket Conference was changed to International Cricket \nConference (later, Council) to enable countries outside the \ncommon wealth to become its members. The first Limited \nOver International cricket match was played in 1971 at \nMelbourne. The governing International Cricket Council (ICC) \nsaw its potential and staged the first limited over Cricket \nWorld Cup in 1975. The first edition of limited over Cricket \nworld cup won by West Indies. \nIn the 21st century, a new limited over form, Twenty 20, \nhas made an immediate impact. The first T-20 international \nmatch took place on August 5 2004, between the women’s \nteams of England and New Zealand. The first T-20 \ninternational match between men’s teams was played on \nFebruary 17 2005, between Australia and New Zealand. The \nfirst T-20 World Cup was played in South Africa in 2007. \nIndia won the first edition of T-20 World Cup.\nAn all India team went on a tour of England in 1911 under \nMaharaja Bhupinder Singh of Patiala. The Indian Cricket \nControl Board came into being towards the end of 1928. The \nnational championship for the Ranji Trophy began in 1935. \nIndia entered the international arena and played its first official \nTest against England in 1932. Meanwhile Prince Ranjit Singhji \nof Nawanagar who had gone to England for further studies, \nmade a remarkable name for himself in the game of cricket. \nMeasurement\nMin 122cm\nMin3.66 m2.64 m 3.05 m\nReturn Crease\nStumps\nBowling Crease\nPopping Crease\n20.12 m (22 yds)\nFig. 6.8: Specifications of cricket ground\nChap-6.indd   84 8/24/2020   11:39:26 AM\n2024-25\n\n--- Page 9 ---\nTeam Games and sporTs I\n85\nWays to score runs\nThe aim of the batsmen is to score runs. One of the main \ncricket rules for batsmen to score runs is that they must \nrun to the pitch at each other’s end (from one end to the \nother), hence score one run. Cricket rules state that, they \nmay run multiple runs per shot. As well as while running \nthey can also score runs by hitting boundaries. A batsman \nhits a boundary and scores 4 or 6 runs. A four and six both \nare scored by hitting the ball. If it crosses the boundary \nafter touching the ground it is considered as four and if \nthe ball crosses boundary before touching the ground it is \nconsidered as six. Cricket rules also state that once a 4 or 6 \nhas been scored any runs physically scored by the batsman \nby running between the wickets are null and void. \nOther ways runs can be scored according to the cricket \nrules include no balls, wide balls, byes and leg byes. Cricket \nrules state that all runs scored by these methods are awarded \nto the batting team but not the individual batters.\n • A No Ball can be declared for many reasons: If the \nheel of the bowler’s front foot lands on or in front of \nthe popping crease or if the bowler’s back foot touches \nthen outside the return crease the ball is declared no \nball. If the bowler bowls the ball from the wrong place, \nthe ball is declared dangerous (often happens when \nbowled at the batsmen’s body on the full), bounces \nmore than twice or rolls before reaching the batsman \nor if fielders are standing in illegal positions. The \nbatsman can hit a No ball and score runs off it but \ncannot be out from a No ball except if they are run \nout, hit the ball twice, handle the ball or obstruct the \nfield. The batsman gains any runs scored off the no \nball for his shot while the team also gains one run for \nthe no ball itself.\n • A Wide Ball will be declared if the umpire thinks the \nbatsman did not have a reasonable opportunity to \nscore off the delivery. However if the delivery is bowled \nover the batsmen’s head it will not be declared a wide \nbut a no ball. Umpires are much stricter on wide \ndeliveries in the shorter format of the game while being \nmuch more relaxed in test cricket. A wide delivery will \nadd one run to the batting team and any runs scored \nby the batsman. The batsman is not supposed to be \ndeclared ‘out’ off a wide delivery except if they are \nstumped, run out, handle the ball, hit their wicket or \nobstruct the field.\n • A Bye is where a ball that isn’t a no ball or wide passes \nthe striking batsman and runs are scored without the \nbatsman hitting the ball.\nChap-6.indd   85 8/24/2020   11:39:26 AM\n2024-25\n\n--- Page 10 ---\nHealtH and PHysical education - class X\n86\n • A Leg Bye  is where runs are scored by hitting the \nbatsman, but not the bat and the ball is not a no ball \nor wide. However no runs can be scored if the striking \nbatsman didn’t attempt to play a shot or if he was \navoiding the ball.\nTypes of ‘out’ in cricket\nWays batsmen can be given ‘Out’ according to cricket rules:\nThere are a number of different ways a batsman can be given \nout in the game of cricket. When a bowler gets a batsman \nout it is said that the bowler gets a ‘wicket’. Following are the \ndifferent ways, a batsman can be given out according to the \nrules of cricket:\nFig. 6.9: Bowled\n • Bowled – Cricket rules state that if the ball is bowled \nand hits the striking batsman’s wickets the batsman is \ngiven out (as long as at least one bail is removed by the \nball). It does not matter whether the ball has touched \nthe batsman’s bat, gloves, body or any other part of \nthe batsman. However, the ball is not allowed to have \ntouched another player or umpire before hitting the \nwickets.\n • Caught – Cricket rules state that if a batsman while \nplaying the ball, either it touches his bat, hand or glove \nholding the bat then the batsman can be caught out. \nThis is done by the fielders, wicket keeper or bowler \ncatching the ball on the full (before it bounces). If this \nis done then cricket rules state the batsman is out.\n • Leg before Wicket (LBW) – If the ball is bowled and \nhits the .batsman first without touching the bat, then \nan LBW decision is possible. However for the umpire to \ngive this out he must first look at some of the factors \nstated in the cricket rules. The first thing the umpire \nChap-6.indd   86 8/24/2020   11:39:28 AM\n2024-25\n\n--- Page 11 ---\nTeam Games and sporTs I\n87\nneed to decide is that if is not a no ball, would the ball \nhave hit the wickets if the batsman was not there. If his, \nanswer to this is yes and the ball was not pitched on \nthe leg side of the wicket he can safely give the batsman \nout. However, if the ball hits the batsman outside the \nline of off stump while he was attempting to play a \nstroke then he is not out.\n • Stumped – A batsman can be given out according to \ncricket rules when the wicketkeeper puts down his \nwicket while, he is out of his crease and not attempting \na run (if he is attempting a run it would be a run out).\n • Retired Out – A batsman leaves the field without the \npermission of umpire for any resource like, illness, \ninjury etc. Than is given as retired out. \n • Run Out – Cricket rules state that a batsman is out \nif no part of his bat or body is grounded behind the \npopping crease while the ball is in play and the wicket \nis fairly put down by the fielding side.\n • Hit Wicket – Cricket rules specify that if a batsman \nhits his wicket down with his bat or body after the \nbowler has entered his delivery stride and the ball is in \nplay then he is out. \n • Handled the Ball – Cricket rules allow the batsman \nto be given out if he willingly handles the ball with the \nhand that is not touching the bat without the consent \nof the opposition or umpire.\n • Timed Out – An incoming batsman must be ready to \nface a ball or be at the non strikers end with his partner \nwithin three minutes of the outgoing batsman being \ndismissed. If this is not done the incoming batsman \ncan be given timed out.\n • Hit the Ball Twice – Cricket rules state that if a \nbatsman hits a ball twice other than for the purpose \nof protecting his wicket or with consent from the \nopposition, he is out.\n • Obstructing the Field – A batsman is out if he \nintentionally obstructs the opposition by word or action\nThere are many other cricket rules. However these are \nmost of the basics and will get you well on your way to playing \nthe game. Many of the more advanced rules and laws can be \nlearned along the way and are not vital to general play.\nIf any batsman leaves the field of play without the Umpire’s \nconsent for any reason other than injury or incapacity, \nhe may resume the innings only with the consent of the \nopposing captain. If he fails to resume his innings, he is out. \nFor the purposes of calculating a batting average, retired out \nis considered a dismissal.\nChap-6.indd   87 8/24/2020   11:39:28 AM\n2024-25\n\n--- Page 12 ---\nHealtH and PHysical education - class X\n88\nRules\n • Cricket is a game played between two teams consisting \nof eleven players each. There is also a reserve player \ncalled a twelfth man, who can only be utilized as fielder.\n • The twelfth man is not allowed to ball, bat, and wicket \nkeeping or captain the team. His sole duty is to act as \na substitute fielder.\n • Two umpires are placed on the playing field while there \nis also a third umpire off the field who is in charge of \nvideo decisions.\n • When the call is too close for the on field umpires \nthen they refer it to the third umpire who reviews slow \nmotion video replays to make a decision.\nFundamental skills\nBatting skills\nBeing a batsman he must have good wrist power, eye co-\nordination, Endurance, speed, Excellent reaction ability and \nStatistics for cricket.\nFig. 6.10: Batting skill\nChap-6.indd   88 8/24/2020   11:39:30 AM\n2024-25\n\n--- Page 13 ---\nTeam Games and sporTs I\n89\nBatting techniques\n•\t Defence •\t Drive\n•\t Pull •\t Cut\n•\t Hook •\t Sweep\nFront foot defence\n • The front foot defence is played when the ball is bowled \nat a good length, which is not over-pitched enough for \na drive and not short enough to go on the back foot. \n • The front foot should move as close as possible to \nthe pitch of the ball with the left shoulder and left \nelbow leading the body in the direction of the ball.\n • The weight of the body is on the front foot with \nthe knee bent and the head should be over the bat \nwatching the point of contact. The bat is kept angled \nand very close to the front pad to prevent the ball \ngoing through bat and pad. \n • The top hand is firm at the top of the handle while the \nbottom hand is relaxed, with the thumb and index \nfinger loosely holding the bat. The back leg should \nbe fully extended with the heel raised off the ground \nbut remaining parallel to the crease.\n • The weight of the back foot should be on the inside \nof the right toe and care should be taken not to turn \nit or drag it out of the crease. \n • The front foot defensive stroke can be played with \nthe bat slightly behind or in front of the pad depend-\ning on the nature of the wicket and the proficiency \nof the bowler. \nOff drive\n • Off drive is played to an over-pitched ball in line with \nthe off stump or marginally outside. \n • Like the forward defence, the left shoulder and elbow \nlead the body with the front foot going as close as \npossible to the pitch of the ball. The bat comes down \nin and arc from the top of the back lift and strikes the \nball just in front of the left foot. \n • After impact, the bat must continue in the arc and finish \nover the left shoulder. The follow through can also be \nchecked at shoulder height, keeping the bat face open. \n • The head is kept straight and still throughout the shot \nand the top hand and elbow controls the direction of \nthe shot. At the time of impact the head should be \nover the ball with the body weight balanced on the \nfront foot. The full face of the bat must hit the ball and \non \ncompletion, the batsman must be well balanced. \nChap-6.indd   89 8/24/2020   11:39:30 AM\n2024-25\n\n--- Page 14 ---\nHealtH and PHysical education - class X\n90\nStraight drive\n • This shot is played exactly in the same way as an off \ndrive but with the difference is that it is played to a over \npitched ball in and around the line of middle stump \nand the front foot must point down the wicket and the \nbody must be turned slightly and the shoulders opened \nout to allow the free swing of the bat. \nOn drive\n • On drive is played to a over-pitched ball on and around \nthe leg stump. \n • This has been considered to be a difficult shot to play. \nThe basic principles of a drive apply here too, though \nthe swing of the bat is an arc from slips to mid- on \nwith the front pointing down the wicket. \n • The front foot should be placed outside the line of ball \nwith the shoulders turned and the impact is just in \nfront of the left toe. The follow through is generally \nchecked below shoulder height.\nBack foot defence\n • The back foot defensive stroke is played to a short-\npitched ball in line with the stumps, which is not \nshort enough to play and attacking shot.\n • The back foot is moved back and across to the line \nof the ball with the front naturally following it. The \nbat is brought down close to the body with the head \nsteady and over the ball. \n • The back foot must remain parallel to the crease as \nfar as possible to maintain the sideways position of \nthe body with the top hand firm and in control, and \nthe bottom hand holding the bat loosely.\n • To keep the bat straight, the left elbow is held high \nnext to the head. Care should be taken to maintain \nthe balance at the time of playing the ball and to \nremain ‘side-on’ as this presents a smaller target for \nshort rising deliveries. \n • The back foot defence can also be played with the \nbody beside the line of the ball, but here the batsman \nmust resist the temptation to follow the movement of \nthe ball away from him. \nBowling skills\nBowling is as important as batting. The ball is defended by \na batsman to save his wicket. When the ball is bowled to a \nbatsman it is called as a ball or delivery.\nFig. 6.11: Bowling Skills\nChap-6.indd   90 8/24/2020   11:39:31 AM\n2024-25\n\n--- Page 15 ---\nTeam Games and sporTs I\n91\nTypes of bowling\nFast bowling Spin bowling\nSeam bowling Off spin\nSwing bowling Leg spin\nBouncer Chinaman\nIn swinger Doosra \nLeg cutter Googly\nOff cutter Arm ball\nSwing bowling\n • When a ball of a fast or medium fast bowler deviator in \nair either on leg side (in swing) or on off side (out swing) \nit is turned in air as swing bowling.\nOutswing\n • For out swing bowling, the ball is held with the index \nand middle finger and thumb below the seam, which \nis upright & angled towards the slips with the shiny \nsurface on the right (for right hand bowler).\n • For effective out swing bowling, the bowler should bowl \nas close as possible to the stumps.\n • The wrist is cocked and when the ball is released the \nseam must be vertical and goes down the pitch upright. \nThe two fingers should stay behind the seam as long as \npossible. \nInswing\n • Here, the ball is held by the two fingers and the thumb \nunderneath it, with the seam upright and angle towards \nfine leg. \n • The shiny side is on the left side and the fingers may \nalso have a slight gap between them.\nWicket keeping\nThe wicket keeper plays an important role in cricket. \nA good wicket keeper can save a number of runs for his team.  \nHis function is to stop deliveries, which the batsman is \nunable to play or passed by batsman.\nFielding\nIn 21st century, fielding is a key point to win the match.  \nA player requires more hard work, practice and flexibility to \nbecome a good fielder.\nFig. 6.12: Wicket keeping\nChap-6.indd   91 8/24/2020   11:39:32 AM\n2024-25\n\n--- Page 16 ---\nHealtH and PHysical education - class X\n92\n3rd Man\nLeg Slips\nFine leg\nSlips\nGully\nPoint\nCover Point\nCover\nExtra Cover\nMid off Mid on\nMid Wicket\nSquare Leg\nBowler\nWK\nDeep\nSquare\nDeep\nMid Wicket\nDeep Extra\nCover\nLong off Long on\nFig. 6.13: Fielding\nArjuna awardee\nS.No. Name of Player Year\n1 Sachin Tendulkar 1994\n2 Sourav Ganguly 1997\n3 Rahul Dravid 1998\n4 Mithali Raj 2003\n5 Anju Jain 2005\n6 Anjum Chopra 2006\n7 Jhulan Goswami 2010\nChap-6.indd   92 8/24/2020   11:39:32 AM\n2024-25\n\n--- Page 17 ---\nTeam Games and sporTs I\n93\n8 Virat Kohli 2013\n9 Harmanpreet Kaur 2017\n10 Smriti Mandhana 2018\nBharat Ratna\nS.No. Name of Player Year"
    },
    {
      "id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 8,
      "title": "1. Sachin Tendulkar 2013",
      "topics": [],
      "start_page": 14,
      "end_page": 26,
      "content": "FootBall \nFootball has been a very popular game all over the world \nsince ages. Also commonly known as soccer, it is a game \nthat involves kicking a ball with the foot to score a point. \nIt is played between two teams with a spherical ball on a \nrectangular field of grass or green artificial turf. There is a \ngoal post at each end of the rectangular field and errected \nat the middle of base line. Points are scored by moving the \nball to an opposing team’s end of the field and putting it \nbetween two goal posts. Players are required to move the ball \nby kicking, dribbling, carrying, and passing. The team that \nscores more points than the other by the end of the match \nwins the game.\nHistory\nAccording to FIFA (Federation International de Football \nAssociation), the “very earliest form of the game was played \nin china during the second and third centuries. The game \nwas later developed in England and the rules of football were \nformulated in India, football began its journey when the \nBritish rulers brought it with them and in no time it became \npopular in the masses. The first recorded game here took place \nbetween the ‘Calcutta Club of Civilians’ and the ‘Gentlemen \nof Barrackpore’ in 1854. The first ever football club in India, \nthe ‘Calcutta Football Club’ was founded in 1872. The first \nfootball association, “the Indian Football Association” (IFA) \nwas established in Calcutta in 1893, though there was no \nIndian on its board till 1930s. It was later, replaced by All India \nFootball Federation (AIFF). The Durand Cup Tournament is \nthe oldest in India and the one of the oldest in the world, was \nstarted in Shimla in 1888. The decade of 1951 to 1962 is \nknown as the golden era in the history of Indian football, as \nthe country put up commendable performances in a number \nof international competitions. India won gold medals in 1951 \nand 1962 Asian Games, held at New Delhi and Jakarta.\n68-70 cm\nCircumference\nof football\nFig. 6.14: Specifications of \nfootball\nChap-6.indd   93 8/24/2020   11:39:32 AM\n2024-25\n\n--- Page 18 ---\nHealtH and PHysical education - class X\n94\nFig. 6.15: Children playing football\n90-120m\nHalfway Line\nCentre Circle\nCentre Spot\nRadius\n9.15m\nPenalty Area\nPenalty\nSpotGoal Area\nGoal45-90m Goal Line\nRadius9.15m\n40.3m\n16.5m\n11m\n5.5m\n16.5m\n7.32m\n2.45m\n10 yds\nFig. 6.16: Specifications of football ground\nField measurements\nAs per international standard, the length of the rectangular \nfootball field (pitch) is in the range of 100 to 110 m (110 to \n120 yards) and the width is in the range of 65 to 75 m (70 \nto 80 yards). There are also goal posts at the back of each \nfootball zone. One way to score is to kick the football through \nthe goal posts. The ball must go between the uprights and \nover the crossbar. \nChap-6.indd   94 8/24/2020   11:39:34 AM\n2024-25\n\n--- Page 19 ---\nTeam Games and sporTs I\n95\nGoal post\nDistance between the posts is 7.32 meter whereas the height \nof the goal post is 2.44 meter.\nRules\nAccording to the official rules of football guide, the players \nneed to execute the game in a fair and accepted manner. The \nfootball match is played in two halves of 45 minutes each. \nThere are several rules in the game of football regarding the \nfield, players, penalties, offence and defence. \nStart and restart of play\nA coin toss takes place before the game starts, the winner of \nthe toss will get the choice of choosing the end to attack. At \nthe kick-off, all players from each side must be in their own \nhalves of the field. The kick-off takes place on the centre spot \nin the centre circle. The player who kicks off cannot touch it \nagain until another player has made contact.\nPunishment for offences\nIf the player persistently offends during a match, the referee \ncan choose to take action. First the Yellow Card as a caution \nis shown to a player. Any offence after the second one leads \nto Red card. If they showed a red card to a player it means \nthat player is expelled from the match. A straight red card (no \nprevious caution) can be shown for extreme offences, such \nas, serious foul play, violent conduct, spitting, deliberately \nhandling the ball to prevent a goal, a professional foul (denying \na goal scoring opportunity) and insulting language and/or \ngestures.\nFree kicks\nWhenever a free kick is taken, the players on the opposite \nside must be at least 10 yards away from the ball until it \nis kicked. If this rule is not adhered to, the kick is retaken. \nThere are two types of free kicks awarded, depending on the \nnature of the offence: (i) Direct Free Kick — allows the team \nto take a direct shot at the opponent`s goal. (ii) Indirect Free \nKick — a direct strike on goal is not permitted. It means a \nsecond player has to touch the ball after the kick is taken to \nscore a goal.\nPenalty kick\nA penalty kick is awarded for offences taking place in the \npenalty and goal areas. A nominated member of the team is \nallowed to strike at goal from the penalty spot, with only the \ngoalkeeper to beat. The goalkeeper must remain on his line \nuntil the ball has been kicked, and all other players must be \noutside the penalty area behind the penalty spot. After the \nChap-6.indd   95 8/24/2020   11:39:34 AM\n2024-25\n\n--- Page 20 ---\nHealtH and PHysical education - class X\n96\nplayer has taken the kick, that player cannot strike the ball \nagain without another player touching the ball.\nThrow-in\nA throw-in is awarded when the whole ball crosses the touch \nline (conceded by the team who last touched the ball). It \nis delivered on the field of play with both hands and from \nbehind and over the player’s head. Otherwise it is deemed to \nbe a foul throw and a throw-in is given to the opposition. It \ncannot go directly to the goalkeeper’s hands (if on the same \nteam). A goal cannot be scored directly from a throw-in.\nCorner kick\nA corner kick is awarded once the whole ball crosses the goal \nline of the opposition, after touching one of their players. \nA kick is taken from the corner of whichever side the ball \ntravelled over the field. Opponents must be 10 yards from \nthe corner arc and the kicker cannot touch the ball a second \ntime without having touched by any other player.\nFundamental skills\nReceiving\nReceiving a ball on the ground is different than receiving a \nball in air. Keep your eye on the ball, select the foot to receive \nthe ball, don’t stop the ball, prepare it for new action or move, \nshot, dribble, pass.\nPassing\nPassing involves giving the ball to partners. Perfect decision \nmaking is required before a perfect pass. Before pass,  \nsee the target, approach the ball, and look at the ball holding \nthe head steady. Strike the correct area of the ball with \nlacked ankle, make sure of follow through and transfer of \nweight forward.\nShooting\nShooting uses the same elements as used in passing, the \ndifference is that the ball is to be passed to the goal keeper to \nconvert the score for the team. Player should look up to see \nthe position of goal keeper, choosing the area to shoot the \nball while make a proper contact with the ball with proper \nfollow through.\nTrapping\nIt is a method of gaining control of the ball. Trapping uses \nthe feet, thigh, or chest to bring the ball to the ground.\nChap-6.indd   96 8/24/2020   11:39:34 AM\n2024-25\n\n--- Page 21 ---\nTeam Games and sporTs I\n97\nTechniques and lead-up activities\nThe students already learnt the fundamental techniques of \nplaying football in the previous classes. Now let us discuss a \nfew lead-up activities to develop these techniques.\nBall control\nFive versus two in 30m x 20m area. Players make two touches \nonly to retain possession of the ball. \nDribbling\nFour quarters of the area are numbered. One player dribbles \nin one quarter and passes the ball to quarter number 2 \nand so on. Reaching last quarter, the player without losing \nthe ball gets points. If ball is lost in any quarter, the other \nteams start anti clockwise and then enter in to the next three \nquarters. \nPassing\nNumber of players—four. Rectangle measures 5m × 20m or \n10m × 30 m, one ball.\nHeading\nTwo versus two, Goal of 8 yards, Centre line 5 yards from \neach goal.\nShooting\nShooting board is a place along the penalty spot, arranged \ninside the penalty area. \nTackling\nOne versus one, 10m × 10m area, time 2 minutes. \nThrow-ins\nThrow-in is a competition between two players.\nGoal keeper\nA goal keeper also acts as a defence but is allowed to catch \nor touch the ball with hands within the penalty box (D-area). \nA goal keeper is usually the last man standing at the goal to \nprevent opponents from scoring the goal. \nArjuna awardees\nS.No. Name of Player Year\n1 P.K. Banerjee 1961\n2 C.P. Singh 1971\nChap-6.indd   97 8/24/2020   11:39:34 AM\n2024-25\n\n--- Page 22 ---\nHealtH and PHysical education - class X\n98\n3 Sudhir Karmakar 1981\n4 Baichung Bhutia 1998\n5 Oinam Bembem Devi 2017\nHoCkey\nIntroduction\nField Hockey is a team game, in which a team of players \nattempt to score goals by hitting/Scooping, pushing or \nflicking a ball into an opposing team’s goal using curved \nsticks. However, the name Field Hockey is used in countries \nin which the word Hockey is generally reserved for another \nform of hockey, such as ice hockey or street hockey. \nThe players should learn and practice the basic skills of \ndribbling, passing, tapping and hitting. They should learn \nhow to attack and score goals and how to work with others \nto defend and stop goals from being scored. To do this they \nneed to learn how to keep possession by dribbling effectively \nand moving the ball accurately and quickly between players. \nAs they progress, skills should become more consistent and \nefficient, and the players should be introduced to set play \nsituations. \nFig. 6.17: Players playing hockey\nHistory\nThe history of the game of hockey has its roots well laid in the \nworld’s early civilisations. One of the oldest known sports, the \nhockey game is believed to be in existence about 1200 years \nbefore the Ancient Games of Olympia. Right from Arabs, \nGreeks, Romans, and Persians to Ethiopians, every country \nplayed with a variation of the game. While some played it just \nChap-6.indd   98 8/24/2020   11:39:36 AM\n2024-25\n\n--- Page 23 ---\nTeam Games and sporTs I\n99\nfor recreation, the others had the opinion that hockey would \nmake them better warriors. Even though many ancient \ncivilisations played hockey in different variations, the modern \ngame of field hockey was developed in the British Isles in the \n19th century. It was introduced in India by the British Army \nregiments and the game soon became popular. It was during \nthis time that the London Hockey Association was formed \nand the rules for playing hockey were standardised. In 1924, \nthe International Hockey Federation (FIH) was founded and \nthree years later, the International Federation of Women’s \nHockey followed.\nIn India, the first hockey club came up in Calcutta in \n1885-86 and soon Bombay and Punjab followed. Making \nits Olympic debut at the 1928 Amsterdam Games, Indian \nhockey team won its first Olympic gold, without conceding \na single goal. The hallmark of this ruthless domination was \nthe wizardry of Indian hockey legend, Dhyan Chand, who \nmesmerised the Amsterdam crowd with his dazzling skills. \nFrom 1928 to 1956, India won six consecutive Olympic gold \nmedals, while winning 24 consecutive matches. It was the \ngolden era of Indian hockey, when India produced some of \nthe finest players the game has ever seen.\nField measurements\n91.40 m\n55 m\n22.9 m\nCentre line\n22.9 m\nPenalty Spot\n22.9 m\n14.63 m\n6.4 m\n5.5 m\n5 m\nFig. 6.18: Specification of hockey field\nChap-6.indd   99 8/24/2020   11:39:36 AM\n2024-25\n\n--- Page 24 ---\nHealtH and PHysical education - class X\n100\nHockey is played on a 91.40 m × 55 m rectangular field.  \nAt each end there is a goal 2.14 m high 1.20 m deep and \n3.66 m wide measured from the inner sides of the posts and \ncrossbar, and the goal post is surrounded by an approximately \nsemi-circular area 14.63 m from the goal bounded by \na solid line. A spot 0.15m in diameter, called the penalty  \nspot, is marked with its centre 6.40 m from the centre of \neach goal.\nEquipment\nEach player carries a stick, normally a little over 3 feet (90 \ncentimeters) long, 2 inches wide and traditionally made \nof wood but now often made with fiberglass, Kevlar and \ncarbon fiber composites, with a rounded handle flattening \nout on one side and with a hook at the bottom.\nRules\nThe rules set by the International Hockey Federation FIH \nare used worldwide.\nGeneral play\nPrior to the start of the game, a coin is tossed and the \nwinning captain can choose a starting end or start with \nthe ball. The game time is divided into four quarters of 15 \nminutes each 15-02-15-10-15-2-15. At the start of each \nquarter as well as after goals are scored, play is started \nwith a pass from the centre of the field.\nField players may only play the ball with the flat side \nof the stick. Tackling is permitted as long as the tackler \ndoes not make contact with the attacker or his stick \nbefore playing the ball (contact after the tackle may also \nbe penalised if the tackle was made from a position where \ncontact was inevitable). Further, the player with the ball \nmay not deliberately use his body or stick to shield the \nball from a legitimate tackle.\nWhen the ball passes over the sidelines, it is returned to \nplay from sideline either by individual player by himself or \nwith a push or hit, taken by a member of the team whose \nplayers were not the last to touch the ball before crossing \nthe sideline. If it crosses the goal line after last touched \nby an attacker, a 15 mt hit or pass can be made by any \nplayer of the defending team. A 15 mt hit is also awarded \nfor offenses committed by the attacking side within  \n15 mt of the end, of the pitch they are attacking. \nFree hits\nFree hits are awarded when offences are committed outside \nthe scoring circles. The ball may be hit or pushed once in \nany direction by the team offended against. Opponents \nChap-6.indd   100 8/24/2020   11:39:36 AM\n2024-25\n\n--- Page 25 ---\nTeam Games and sporTs I\n101\nmust move 5 mt away from the ball when a free hit is \nawarded, and for attacking free hits within 5 mt of the circle, \nall attackers other than the one taking the hit must also be \n5 mt away. \nCorner\nA corner is awarded if the ball goes over the backline after \nlast being touched by a defender. Corners are played by \nthe attacking team and involve a free hit from the 22.90  \nmeter line.\nPenalty corner\nThe penalty corner is set play that is awarded against \na defending team when any offence is committed in the \ndefensive circle, and may be awarded when a deliberate \noffence is committed in the defending 23 m area, or when the \ndefending team deliberately plays the ball over the back line. \nPenalty stroke\nA penalty stroke is awarded when defenders commit a \ndeliberate foul in the circle which deprives an attacker of \npossession or the opportunity to play the ball. This penalty \nis being taken by a single attacker against the goalkeeper, \nand is taken from a spot 6.4 m from the penalty spot and \ndirectly in front of the goal. The goalkeeper must stand with \nheels on the goal line, and cannot move his feet until the ball \nis played. \nOn the umpire’s whistle, the striker may push or flick the \nball at the goal, which the goalkeeper attempts to save. The \nplayer taking the penalty shot may not touch the ball twice. \nHitting or dragging or tapping the ball is also forbidden. If \nthe shot is saved, play is restarted with 15 mt hit to the \ndefenders; if a goal is scored, play is restarted from the centre \nline. Time is stopped for the Penalty stroke.\nDangerous play\nIf the ball is raised off the ground in a manner that is, in the \numpire’s opinion, dangerous, the ball is turned over to the \nother team and they receive a free hit from the point of contact. \nTie breaker (shootout)\nIn case of a draw match, penalty shootout is conducted. \nThe winners will be decided by 5 penalty shootouts by each \nteam and the team which scores highest number of goals \nis declared the winner. The shootout will start at 22.90 mt. \nline in front of the shooter and should be completed within 8 \nseconds after the umpire’s whistle. The goalkeeper will start \ndefence from goal line.\nChap-6.indd   101 8/24/2020   11:39:36 AM\n2024-25\n\n--- Page 26 ---\nHealtH and PHysical education - class X\n102\nArjuna awardees\nS.No. Name of Player Year\n1 Prithipal Singh 1961\n2 Sunita Puri 1966\n3 P. Krishnamurthy 1971\n4 Versha Soni 1981\n5 Dhanraj Pillai 1995\n6 Baljeet Singh Saini 2000\n7 Mamta Kharab 2002\n8 Ritu Saini and Rani Rampal 2016\n9 S.V. Sunil 2017\n10 Savita Punia 2018\n11 Manpreet Singh 2018\nVolleyBall\nVolleyball is a net game that involves two teams of 12 players \n(six playing and six substitutes). Each team works together \nto hit an inflated ball over a high net. Each team tries to \nscore points by grounding the ball on the other team’s court. \nVolleyball is a rebound game where one cannot hold or catch \nthe ball; every contact must be a rebound action. It is essential \nfor the player to be in the right place at the right time if \nthe game is to be played in a controlled manner. Therefore,  \ngood anticipation and movement skills should be taught \nto players. At competency level, students should learn and \npractice the basic skills of sending and receiving the ball over \na high net. They should play simple 3 touch volleyball games \nworking as a team to keep the ball in play and ground it on \nthe opponent’s side of the court.\nHistory\nOriginally named Mintonette, it was created as a gentle indoor \nsport for older players to be able to exert a bit of athletic \neffort by keeping the ball in the air. The idea of using a net \nwas borrowed from tennis. It was raised to a height above \nthe average man’s height. During a demonstration game, \nsomeone remarked that the players seemed to be volleying \nthe ball back and forth over the net, and perhaps “volleyball” \nwould be a more descriptive name for the sport. The game \nof Volleyball was invented by William G. Morgan in the year \n1895 in Holyoke, Massachusetts by YMCA (USA). It was \ninvented as a recreational game. This game was brought to \nIndia more than 85 years ago when some physical education \nChap-6.indd   102 8/24/2020   11:39:36 AM\n2024-25\n\n--- Page 27 ---\nTeam Games and sporTs I\n103\nteachers had been abroad and were trained in different  \ngames including Volleyball. YMCA College of Physical \nEducation, Madras, took this game seriously and students \ntrained there have taken the game to other parts of  \nthe country.\nFig. 6.19: Players playing volleyball\nMeasurements\nSide Line\nEndline Endline\n9m\n3-8m\n9m\nService Zone\nBack Zone\nFront\nZone\nFront\nZone\nBack Zone\nAttack line\nCentrelineand net\nAttack line\n3m 3m 3-8m\n9m\nService Zone\n9m\nA Antenna\nFig. 6.20: Specifications of volleyball court\nChap-6.indd   103 8/24/2020   11:39:38 AM\n2024-25\n\n--- Page 28 ---\nHealtH and PHysical education - class X\n104\nNETR Posts\nThe net is 2.43 mt high for men and 2.24 mt high for women. \nIt is doubled vertically over the center line. It is 1 m wide and \n9.5-10 m long end is 10 cm more bleak mesh. The antenna \nis a flexible rod 1.8 m long and 10 mm. in diameter centered \nfixed an side line near pole. The top on antenna extends \n80 cm above the net. The 2.55 m high posts are placed  \n0.5 m – 1.0 m out side the side line.\nRules\nVolleyball is a fast game played by two teams of 6 players \neach. It can be played indoors or outdoors. A player \non one of the teams begins a ‘rally’ by serving the ball \nfrom behind the back line of the court, over the net, \nand into the receiving team’s court. The receiving team \nmust not let the ball be grounded within their court. \nThe rally continues, with each team allowed up to three \nconsecutive touches, until either a team grounds the ball \non the opponent’s court and wins the rally or a team \ncommits a fault and loses the rally. The team that wins \nthe rally is awarded a point, and serves the ball to start \nthe next rally. The ball is usually played with the hands \nor arms, but players can legally strike or push the ball \nwith any part of the body.\nCommon faults include —\n • catching and throwing the ball; \n • two consecutive contacts with the ball made by the "
    },
    {
      "id": "0c1e0cef-ce64-436c-beeb-bd8a35460a0e",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 11,
      "title": "3. How does playing basketball help us in the improvement of our",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": "health?"
    },
    {
      "id": "bb20dce2-f530-45b5-aa7a-21f2d78f2baf",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 14,
      "title": "6. How can you improve your performance in the game of basketball?",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": " II. Fill in the Blanks"
    },
    {
      "id": "94cf0e19-6f10-486f-bc0e-64cf0a78e23a",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 19,
      "title": "5. Duration of team time out is _____________ .",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": " III. State whether True or False"
    },
    {
      "id": "fee7555a-ded5-49ca-9096-10414751052a",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 24,
      "title": "5. After five fouls player has to leave the court.",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": " IV. Assess your Performance by the following Activities"
    },
    {
      "id": "d539e05d-4c21-401b-83ed-ab1022e7d8bb",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 27,
      "title": "3. Shooting Test: Shooting for 30 seconds from under the basket",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": "position\nCriCket\n I. Answer the following Questions"
    },
    {
      "id": "d87dcbb3-2b5c-466c-b506-480db69aa15a",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 29,
      "title": "2. What has been the impact of Twenty20 form of cricket on Test",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": "Matches?\nChap-6.indd   107 8/24/2020   11:39:45 AM\n2024-25\n\n--- Page 32 ---\nHealtH and PHysical education - class X\n108\n II. Fill in the Blanks"
    },
    {
      "id": "39cbc956-4e41-4933-9771-3aee66c4043a",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 30,
      "title": "1. Cricket became an international game with the formation of",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": "the  _____________  in 1909. "
    },
    {
      "id": "77ab7acd-2255-4562-920d-35b6e1986c89",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 31,
      "title": "2. The name of Imperial Cricket Conference was changed to",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": "_____________ to enable countries outside the Common Wealth \nto become its members. "
    },
    {
      "id": "8ba555f8-70cd-43a4-aae6-0f5b205631b5",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 32,
      "title": "3. The International Cricket Council (ICC) staged the first limited",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": "over Cricket World Cup in _____________ ."
    },
    {
      "id": "f4e12bb1-42f1-4559-9f2c-7226d63a3395",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 33,
      "title": "4. The lines that delineate the width of the court are called the",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": "_____________ ."
    },
    {
      "id": "59e0e0ff-d307-4e46-8b9a-430e9770b173",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 34,
      "title": "5. The Indian Cricket Control Board came into being towards the",
      "topics": [],
      "start_page": 26,
      "end_page": 26,
      "content": "end of _____________ ."
    },
    {
      "id": "0e3bb44f-f852-4e72-99a8-7a0b0b8d4cb6",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 35,
      "title": "6. The National Cricket Championship known as _____________",
      "topics": [],
      "start_page": 26,
      "end_page": 27,
      "content": "Trophy, named after Prince Ranjit Singhji of Nawanagar.\nFootBall \n I. Answer the following Questions"
    },
    {
      "id": "d181ac78-e97e-4ad7-8e3f-fd4db09a7eb8",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 36,
      "title": "1. What is the stipulated size of the field for playing football according",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "to the international standard?"
    },
    {
      "id": "9438f4b8-41b4-491a-90f3-a6b990254057",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 37,
      "title": "2. How many players constitute a football team and what are their",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "positions?"
    },
    {
      "id": "33d0de70-6222-4f1e-bcf7-b6fee416e050",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 39,
      "title": "4. What role does the Referee play? Who are the other officials in the",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "football match?"
    },
    {
      "id": "9a67c699-fa71-4082-9e19-06a7aee1e5d3",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 40,
      "title": "5. What is the official duration of a football match? How far can it be",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "extended and why?"
    },
    {
      "id": "ada5c93a-f1d7-443a-bcb0-6c5c0ec60401",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 41,
      "title": "6. On how many occasions is the kick-off used during a football",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "match?"
    },
    {
      "id": "2d3da14c-4231-4e4a-a701-fd105c7afc21",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 42,
      "title": "7. What are the penalties that the Referee can award against offences",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "during the match?"
    },
    {
      "id": "5a1c2d39-c780-4818-bbae-692331030936",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 43,
      "title": "8. What are the rules regarding free kick, penalty kick, throw-in and",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "corner kick?"
    },
    {
      "id": "d45aab37-4a74-44ab-b8a2-e6d65ff5cec7",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 44,
      "title": "9. What are the norms of fair play in football for footballers and",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "spectators?\n II. Fill in the Blanks"
    },
    {
      "id": "5594273f-c879-4958-a3ea-2000cf342cde",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 45,
      "title": "1. The first ever football club in India, the _____________ was founded",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "in 1872."
    },
    {
      "id": "51b16fb4-5c50-4be1-a873-efbf40f636d4",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 46,
      "title": "2. The first football association, known as Indian Football",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "Association” (IFA) which was established in 1893 was replaced \nby _____________ ."
    },
    {
      "id": "119af04d-4c56-451d-adb1-0340437b6c61",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 47,
      "title": "3. The decade of 1951 to 1962 is known as the _____________ era in",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "the history of Indian football.\nChap-6.indd   108 8/24/2020   11:39:45 AM\n2024-25\n\n--- Page 33 ---\nTeam Games and sporTs I\n109"
    },
    {
      "id": "19a4c53c-03fa-46fa-9684-ab0778aa7d50",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 48,
      "title": "4. India became the first Asian nation to reach the Olympic football",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "semifinals in the _____________ Olympics."
    },
    {
      "id": "1f83bbb5-c010-4af8-aabc-3154946c4ee8",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 49,
      "title": "5. The Asian Football Confederation (AFC) was formed in the Second",
      "topics": [],
      "start_page": 27,
      "end_page": 27,
      "content": "Asian Games held in Manila in _____________ .\nHoCkey \n I. Answer the following Questions"
    },
    {
      "id": "90dd2d19-1ce9-49fe-aede-d90c2a86c460",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 51,
      "title": "2. What are the rules of the game in respect of (i) field, (ii) players,",
      "topics": [],
      "start_page": 27,
      "end_page": 28,
      "content": "(iii) equipment, (iv) free hits, (v) long corner, (vi) short corner, and \n(vii) penalty stroke?\n II. Fill in the Blanks\n (a) If the ball is raised off the ground in a manner that is, in the \numpire’s opinion, dangerous, the ball is turned over to the  \n_____________ and they receive a _____________ from the point  \nof contact. \n (b) Hockey uses a three-tier card system of warnings and suspensions \nand these are known as (i) _____________ card, (ii) _____________ \ncard, and (iii) _____________ card.\n (c) The procedure laid down in FIH tournament regulations for tie \nbreaker mandates _____________ minutes each way of “golden \ngoal” extra time (i.e. the game ends as soon as one team \nscores). If scores are still levelled, the game will be decided  \nwith  _____________. \nVolleyBall\n I. Answer the following Questions"
    },
    {
      "id": "6ccc3523-4a3f-4bb9-b259-791970292086",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 55,
      "title": "4. How can you improve your performance in the game of",
      "topics": [],
      "start_page": 28,
      "end_page": 28,
      "content": "volleyball?\n II. Fill in the blanks"
    },
    {
      "id": "8ea59e95-1c64-4c73-8370-7a7e8d2d8403",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 57,
      "title": "2. Volleyball is a fast game played by two teams of _____________",
      "topics": [],
      "start_page": 28,
      "end_page": 28,
      "content": "players each. "
    },
    {
      "id": "e3a36e3d-7b26-4e40-8dbc-69c315310155",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 58,
      "title": "3. When the rally continues, each team is allowed upto _____________",
      "topics": [],
      "start_page": 28,
      "end_page": 28,
      "content": "consecutive touches. \nChap-6.indd   109 8/24/2020   11:39:45 AM\n2024-25\n\n--- Page 34 ---\nHealtH and PHysical education - class X\n110\n III. State whether True or False"
    },
    {
      "id": "30f3ac1c-f85c-425c-a049-9d28f83ac8ea",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 61,
      "title": "3. Three consecutive contacts with the ball made by the same team",
      "topics": [],
      "start_page": 28,
      "end_page": 28,
      "content": "are allowed."
    },
    {
      "id": "c66cc4d3-2a0c-4b36-bf03-bad977b69de7",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 62,
      "title": "4. Two consecutive contacts with the ball made by the same player",
      "topics": [],
      "start_page": 28,
      "end_page": 28,
      "content": "are allowed. "
    },
    {
      "id": "1fc1dd7a-6a5f-4ab5-adb3-1675e2e6fbcb",
      "textbook_id": "cc73dc8b-2337-4f18-898b-708e1f1a48b9",
      "chapter_number": 63,
      "title": "5. The player touches the net during play.",
      "topics": [],
      "start_page": 28,
      "end_page": 28,
      "content": "Chap-6.indd   110 8/24/2020   11:39:45 AM\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "4f674da8-c0f7-42aa-a255-28ece6900c1b",
      "chapter_id": "d5b7e70f-5416-4a6e-98c9-ac3a2942a99c",
      "chunk_index": 0,
      "content": "Basketball court measurements\nFig. 6.2: Basketball court, a basket and a basketball\n28m\n15m\n1.575m\n0.90m Sideline Throw-in line\n8.325m\nThreePointLine\n0.15m\n6.75mNo-chargeSemi-Circle\n3.6m\nCentreCircle\nEndline Centre line\nRestricted\nArea\nEndline\nSideline\nBasketball is played on a rectangular court, which should \nbe an indoor wooden court or an outdoor concrete court \nhaving two side lines and two end lines. The dimensions \nof basketball court is 28 x15 meters. The court is divided \n18 inch\nwide Diameter\nChap-6.indd   78 8/24/2020   11:39:23 AM\n2024-25\n\n--- Page 3 ---\nTeam Games and sporTs I\n79\ninto two sections, called half-courts, by the mid-court line, \nwhich is where the game starts with a jump ball. A jump \nball is when a referee throws the ball up at center circle to \ndetermine which team gets possession. Two players from \nopposing teams jump up to tap the ball out of the circle in \norder to gain control over the ball take the game forward. The \nbasketball posts are located at the opposite ends of the court.\nRules\nDuration of a Match (Total 4 Quarters)\nPlay Rest Play Half time Play Rest Play\n10 min 2 min 10 min 15 min 10 min 2 min 10 min\n • The duration of the game of each quarter is ten \nminutes with 2 minutes rest between 1st and 2nd \nquarter and 3rd and 4th quarter, also 15 minutes \nrest between 2nd and 3rd quarter. Extra time period \nis of about 5 minutes. Teams exchange the side after \nhalf time. The clock is stopped while the play is not \nactive. Therefore, it takes longer time to complete the \ngame than the allotted time.\n • A team must consist of twelve (12) members. But \nonly five players from each team may be on the court \nat one time. Substitutions are unlimited but can only \nbe done when the play is stopped. \n • The team with the ball, attempting to score in \ntheir basket is ‘on offense’, the team that prevents \nopposite team from scoring is ‘on defence’. The ball is \nmoved in two ways: either dribbling or by passing to \nteammates. If the ball goes out of the court, the ball \npossession is given to the opposite team. \n • For both men’s and women’s teams, a standard \nuniform consists of a pair of shorts and a jersey \nwith a clearly visible bib number, printed on both \nthe front and back. Players should wear appropriate \nshoes that provide extra ankle support. \n • The game is controlled by the officials consisting \nof the three (3) referees, out of which one (1) is the \noverall incharge and the other four (4) table officials \nare responsible for keeping other records of each \nteams scoring, timekeeping, individual and team \nfouls, player substitutions, alternating possession \narrow, and stop–and-go-clock, etc.\n • The essential equipment in basketball game is the \nball, clocks, score sheets, scoreboard(s), alternating \npossession arrows and other required equipments.\n • An attempt to unfairly disadvantage an opponent \nthrough physical contact is illegal and called a foul. \nChap-6.indd   79 8/24/2020   11:39:23 AM\n2024-25",
      "content_type": "text",
      "token_count": 746,
      "page_number": 2
    },
    {
      "id": "f14675ee-d0cb-4160-a65d-299e83cfc0da",
      "chapter_id": "d5b7e70f-5416-4a6e-98c9-ac3a2942a99c",
      "chunk_index": 1,
      "content": "--- Page 4 ---\nHealtH and PHysical education - class X\n80\nPlayers who are fouled either get ball possession or \nare awarded one or two free throws and one point \nis awarded for successfully converting a free throw, \nwhich is attempted from a line 15 feet (4.6 m) from \nthe basket. Each player is allowed 5 personal fouls \nbefore they are disqualified from the game. At this \npoint they no longer remain a part of the game.\n • Two points are awarded when a basket is scored \nduring the game but three points are awarded when \na basket is scored from outside the 6.25 mtrs line. \nFundamental skills\nWe are well aware that, to play any game one has to learn \nsome skills. Similarly to play basketball game a player \nshould learn the following fundamental skills. \nDribbling\nIt is important to penetrate to score a basket, move the \nball across the court, get away from the defenders, and \nfind a good passing lane. There are different types of \ndribbling — \n • basic dribble\n • low dribbling\n • high dribble\n • behind the back\n • crossover dribble \n • change-of-pace\n • between the legs dribble\nPassing\nA good offensive attack requires accurate passing from \nplayers. It helps find an open man, to find a good shooter \nor to get away from a defender. There are several types of \npasses used in basketball, either one hand or both hand \npass —\n • Overhead \n • Chest \n • Push \n • Baseball \n • Off-the-dribble \n • Bounce \n • Shoulder \n • Hook \nFig. 6.3: Dribbling\nChap-6.indd   80 8/24/2020   11:39:24 AM\n2024-25\n\n--- Page 5 ---\nTeam Games and sporTs I\n81\nFig. 6.4: Passing\n18 inch\nwide Diameter\nShooting\nFig. 6.5: Shooting\nThe objective of the game is to win by scoring maximum \npoints. Therefore, improving the team’s shooting is \nimportant to win a game. Shooting with either one hand \nor both hands is done in the following ways —\n • Jump shot \n • Dunk shot\n • Free throw \n • Layup\n • Three-point shot \n • Hook shot\nChap-6.indd   81 8/24/2020   11:39:25 AM\n2024-25",
      "content_type": "text",
      "token_count": 490,
      "page_number": 2
    },
    {
      "id": "5b83d648-73dd-4457-9b22-136a0b73759a",
      "chapter_id": "d5b7e70f-5416-4a6e-98c9-ac3a2942a99c",
      "chunk_index": 2,
      "content": "--- Page 6 ---\nHealtH and PHysical education - class X\n82\nDefence\nFig. 6.6: Defence\nThe game of basketball allows a variety of defences to be \ndeployed in an effort to disrupt and combat offensive \nplays. Here are examples of the three basic categories of \nteam defences. In addition, each category comprises of an \nassortment of different variations.\n • Man to man defence: Man-to-man defences match \nup the defenders against specific offensive players. \nDefenders are usually assigned to be matched up with \noffensive players by size and ability.\n • Zone Defence: In Zone defence, defenders are assigned \nto guard specific areas on the court. Zones are named \nor designated by their player alignments.\n • Combined Defence: A third type of defence that can be \ndeployed is the combination defence. With combina-\ntion defences, some of the players are assigned to play \nman-to-man while the rest of the defenders play zone. \nCombination defences are usually deployed in an effort \nto stop or neutralise great individual offensive players. \nRebounding\nThe objective of rebounding is to successfully gain possession \nof the basketball after a missed field point or free throw, as it \nrebounds from the ring or backboard. This plays a major role \nin the game, as most possessions end when a team misses \na shot. There are two categories of rebounds: offensive \nrebounds, in which the ball is recovered by the offensive side \nand does not change possession, and defensive rebounds, \nin which the defending team gains possession of the loose \nball. The majority of rebounds are defensive, as the team \non defence tends to be in better position to recover missed \nshots.\nChap-6.indd   82 8/24/2020   11:39:26 AM\n2024-25\n\n--- Page 7 ---\nTeam Games and sporTs I\n83\nFig. 6.7: Rebounding\nArjun awardees\nS.No. Name of Player Year",
      "content_type": "example",
      "token_count": 454,
      "page_number": 5
    },
    {
      "id": "802b9967-a4ed-430e-a0a8-c28f094f21c4",
      "chapter_id": "c22be10e-71fa-4ae8-8072-a86e62921355",
      "chunk_index": 0,
      "content": "CriCket\nIntroduction\nCricket is a bat and ball game played between two teams \non a field, at the centre of which is a rectangular pitch. One \nteam bats, trying to defend the wicket and scoring as many \nruns as possible. The other team bowls and fields, trying to \ndismiss the batsmen and thus limiting the runs scored by \nthe batting team. A run is scored by the striking batsman \nhitting the ball with his bat, running to the opposite end \nof the pitch and touching the crease there without being \ndismissed. The teams switch between batting and fielding at \nthe end of an inning.\nChap-6.indd   83 8/24/2020   11:39:26 AM\n2024-25\n\n--- Page 8 ---\nHealtH and PHysical education - class X\n84\nHistory\nThe game of cricket, as it is played today, has its origin in the \nsouth eastern part of England. Cricket became a generally \nadopted sport in the second half of the seventeenth century. \nThe Hambeldon club which was founded in about 1750’s \nhad played a significant part in the evolution of the game. \nIt was superseded by the Marylebone Cricket Club (M.C.C) \nwith its headquarters at Lords, London. Cricket became \nan international game with the formation of the Imperial \nCricket Conference (I.C.C) in 1909. The name of Imperial \nCricket Conference was changed to International Cricket \nConference (later, Council) to enable countries outside the \ncommon wealth to become its members. The first Limited \nOver International cricket match was played in 1971 at \nMelbourne. The governing International Cricket Council (ICC) \nsaw its potential and staged the first limited over Cricket \nWorld Cup in 1975. The first edition of limited over Cricket \nworld cup won by West Indies. \nIn the 21st century, a new limited over form, Twenty 20, \nhas made an immediate impact. The first T-20 international \nmatch took place on August 5 2004, between the women’s \nteams of England and New Zealand. The first T-20 \ninternational match between men’s teams was played on \nFebruary 17 2005, between Australia and New Zealand. The \nfirst T-20 World Cup was played in South Africa in 2007. \nIndia won the first edition of T-20 World Cup.\nAn all India team went on a tour of England in 1911 under \nMaharaja Bhupinder Singh of Patiala. The Indian Cricket \nControl Board came into being towards the end of 1928. The \nnational championship for the Ranji Trophy began in 1935. \nIndia entered the international arena and played its first official \nTest against England in 1932. Meanwhile Prince Ranjit Singhji \nof Nawanagar who had gone to England for further studies, \nmade a remarkable name for himself in the game of cricket. \nMeasurement\nMin 122cm\nMin3.66 m2.64 m 3.05 m\nReturn Crease\nStumps\nBowling Crease\nPopping Crease\n20.12 m (22 yds)\nFig. 6.8: Specifications of cricket ground\nChap-6.indd   84 8/24/2020   11:39:26 AM\n2024-25",
      "content_type": "text",
      "token_count": 702,
      "page_number": 5
    },
    {
      "id": "5bb3069a-3da0-488d-a87d-4535463fcc3f",
      "chapter_id": "c22be10e-71fa-4ae8-8072-a86e62921355",
      "chunk_index": 1,
      "content": "--- Page 9 ---\nTeam Games and sporTs I\n85\nWays to score runs\nThe aim of the batsmen is to score runs. One of the main \ncricket rules for batsmen to score runs is that they must \nrun to the pitch at each other’s end (from one end to the \nother), hence score one run. Cricket rules state that, they \nmay run multiple runs per shot. As well as while running \nthey can also score runs by hitting boundaries. A batsman \nhits a boundary and scores 4 or 6 runs. A four and six both \nare scored by hitting the ball. If it crosses the boundary \nafter touching the ground it is considered as four and if \nthe ball crosses boundary before touching the ground it is \nconsidered as six. Cricket rules also state that once a 4 or 6 \nhas been scored any runs physically scored by the batsman \nby running between the wickets are null and void. \nOther ways runs can be scored according to the cricket \nrules include no balls, wide balls, byes and leg byes. Cricket \nrules state that all runs scored by these methods are awarded \nto the batting team but not the individual batters.\n • A No Ball can be declared for many reasons: If the \nheel of the bowler’s front foot lands on or in front of \nthe popping crease or if the bowler’s back foot touches \nthen outside the return crease the ball is declared no \nball. If the bowler bowls the ball from the wrong place, \nthe ball is declared dangerous (often happens when \nbowled at the batsmen’s body on the full), bounces \nmore than twice or rolls before reaching the batsman \nor if fielders are standing in illegal positions. The \nbatsman can hit a No ball and score runs off it but \ncannot be out from a No ball except if they are run \nout, hit the ball twice, handle the ball or obstruct the \nfield. The batsman gains any runs scored off the no \nball for his shot while the team also gains one run for \nthe no ball itself.\n • A Wide Ball will be declared if the umpire thinks the \nbatsman did not have a reasonable opportunity to \nscore off the delivery. However if the delivery is bowled \nover the batsmen’s head it will not be declared a wide \nbut a no ball. Umpires are much stricter on wide \ndeliveries in the shorter format of the game while being \nmuch more relaxed in test cricket. A wide delivery will \nadd one run to the batting team and any runs scored \nby the batsman. The batsman is not supposed to be \ndeclared ‘out’ off a wide delivery except if they are \nstumped, run out, handle the ball, hit their wicket or \nobstruct the field.\n • A Bye is where a ball that isn’t a no ball or wide passes \nthe striking batsman and runs are scored without the \nbatsman hitting the ball.\nChap-6.indd   85 8/24/2020   11:39:26 AM\n2024-25",
      "content_type": "text",
      "token_count": 666,
      "page_number": 5
    },
    {
      "id": "5e8a6681-2abd-4276-90ab-c5d34480d3fd",
      "chapter_id": "c22be10e-71fa-4ae8-8072-a86e62921355",
      "chunk_index": 2,
      "content": "--- Page 10 ---\nHealtH and PHysical education - class X\n86\n • A Leg Bye  is where runs are scored by hitting the \nbatsman, but not the bat and the ball is not a no ball \nor wide. However no runs can be scored if the striking \nbatsman didn’t attempt to play a shot or if he was \navoiding the ball.\nTypes of ‘out’ in cricket\nWays batsmen can be given ‘Out’ according to cricket rules:\nThere are a number of different ways a batsman can be given \nout in the game of cricket. When a bowler gets a batsman \nout it is said that the bowler gets a ‘wicket’. Following are the \ndifferent ways, a batsman can be given out according to the \nrules of cricket:\nFig. 6.9: Bowled\n • Bowled – Cricket rules state that if the ball is bowled \nand hits the striking batsman’s wickets the batsman is \ngiven out (as long as at least one bail is removed by the \nball). It does not matter whether the ball has touched \nthe batsman’s bat, gloves, body or any other part of \nthe batsman. However, the ball is not allowed to have \ntouched another player or umpire before hitting the \nwickets.\n • Caught – Cricket rules state that if a batsman while \nplaying the ball, either it touches his bat, hand or glove \nholding the bat then the batsman can be caught out. \nThis is done by the fielders, wicket keeper or bowler \ncatching the ball on the full (before it bounces). If this \nis done then cricket rules state the batsman is out.\n • Leg before Wicket (LBW) – If the ball is bowled and \nhits the .batsman first without touching the bat, then \nan LBW decision is possible. However for the umpire to \ngive this out he must first look at some of the factors \nstated in the cricket rules. The first thing the umpire \nChap-6.indd   86 8/24/2020   11:39:28 AM\n2024-25",
      "content_type": "text",
      "token_count": 433,
      "page_number": 5
    },
    {
      "id": "b41b0706-5487-4721-8160-239c1d8d1888",
      "chapter_id": "c22be10e-71fa-4ae8-8072-a86e62921355",
      "chunk_index": 3,
      "content": "--- Page 11 ---\nTeam Games and sporTs I\n87\nneed to decide is that if is not a no ball, would the ball \nhave hit the wickets if the batsman was not there. If his, \nanswer to this is yes and the ball was not pitched on \nthe leg side of the wicket he can safely give the batsman \nout. However, if the ball hits the batsman outside the \nline of off stump while he was attempting to play a \nstroke then he is not out.\n • Stumped – A batsman can be given out according to \ncricket rules when the wicketkeeper puts down his \nwicket while, he is out of his crease and not attempting \na run (if he is attempting a run it would be a run out).\n • Retired Out – A batsman leaves the field without the \npermission of umpire for any resource like, illness, \ninjury etc. Than is given as retired out. \n • Run Out – Cricket rules state that a batsman is out \nif no part of his bat or body is grounded behind the \npopping crease while the ball is in play and the wicket \nis fairly put down by the fielding side.\n • Hit Wicket – Cricket rules specify that if a batsman \nhits his wicket down with his bat or body after the \nbowler has entered his delivery stride and the ball is in \nplay then he is out. \n • Handled the Ball – Cricket rules allow the batsman \nto be given out if he willingly handles the ball with the \nhand that is not touching the bat without the consent \nof the opposition or umpire.\n • Timed Out – An incoming batsman must be ready to \nface a ball or be at the non strikers end with his partner \nwithin three minutes of the outgoing batsman being \ndismissed. If this is not done the incoming batsman \ncan be given timed out.\n • Hit the Ball Twice – Cricket rules state that if a \nbatsman hits a ball twice other than for the purpose \nof protecting his wicket or with consent from the \nopposition, he is out.\n • Obstructing the Field – A batsman is out if he \nintentionally obstructs the opposition by word or action\nThere are many other cricket rules. However these are \nmost of the basics and will get you well on your way to playing \nthe game. Many of the more advanced rules and laws can be \nlearned along the way and are not vital to general play.\nIf any batsman leaves the field of play without the Umpire’s \nconsent for any reason other than injury or incapacity, \nhe may resume the innings only with the consent of the \nopposing captain. If he fails to resume his innings, he is out. \nFor the purposes of calculating a batting average, retired out \nis considered a dismissal.\nChap-6.indd   87 8/24/2020   11:39:28 AM\n2024-25",
      "content_type": "text",
      "token_count": 633,
      "page_number": 5
    },
    {
      "id": "73d49952-a142-4a47-ae09-76f20cf67b08",
      "chapter_id": "c22be10e-71fa-4ae8-8072-a86e62921355",
      "chunk_index": 4,
      "content": "--- Page 12 ---\nHealtH and PHysical education - class X\n88\nRules\n • Cricket is a game played between two teams consisting \nof eleven players each. There is also a reserve player \ncalled a twelfth man, who can only be utilized as fielder.\n • The twelfth man is not allowed to ball, bat, and wicket \nkeeping or captain the team. His sole duty is to act as \na substitute fielder.\n • Two umpires are placed on the playing field while there \nis also a third umpire off the field who is in charge of \nvideo decisions.\n • When the call is too close for the on field umpires \nthen they refer it to the third umpire who reviews slow \nmotion video replays to make a decision.\nFundamental skills\nBatting skills\nBeing a batsman he must have good wrist power, eye co-\nordination, Endurance, speed, Excellent reaction ability and \nStatistics for cricket.\nFig. 6.10: Batting skill\nChap-6.indd   88 8/24/2020   11:39:30 AM\n2024-25",
      "content_type": "text",
      "token_count": 228,
      "page_number": 5
    },
    {
      "id": "6ec62d3b-0667-41c0-921c-47e449c3f31a",
      "chapter_id": "c22be10e-71fa-4ae8-8072-a86e62921355",
      "chunk_index": 5,
      "content": "--- Page 13 ---\nTeam Games and sporTs I\n89\nBatting techniques\n•\t Defence •\t Drive\n•\t Pull •\t Cut\n•\t Hook •\t Sweep\nFront foot defence\n • The front foot defence is played when the ball is bowled \nat a good length, which is not over-pitched enough for \na drive and not short enough to go on the back foot. \n • The front foot should move as close as possible to \nthe pitch of the ball with the left shoulder and left \nelbow leading the body in the direction of the ball.\n • The weight of the body is on the front foot with \nthe knee bent and the head should be over the bat \nwatching the point of contact. The bat is kept angled \nand very close to the front pad to prevent the ball \ngoing through bat and pad. \n • The top hand is firm at the top of the handle while the \nbottom hand is relaxed, with the thumb and index \nfinger loosely holding the bat. The back leg should \nbe fully extended with the heel raised off the ground \nbut remaining parallel to the crease.\n • The weight of the back foot should be on the inside \nof the right toe and care should be taken not to turn \nit or drag it out of the crease. \n • The front foot defensive stroke can be played with \nthe bat slightly behind or in front of the pad depend-\ning on the nature of the wicket and the proficiency \nof the bowler. \nOff drive\n • Off drive is played to an over-pitched ball in line with \nthe off stump or marginally outside. \n • Like the forward defence, the left shoulder and elbow \nlead the body with the front foot going as close as \npossible to the pitch of the ball. The bat comes down \nin and arc from the top of the back lift and strikes the \nball just in front of the left foot. \n • After impact, the bat must continue in the arc and finish \nover the left shoulder. The follow through can also be \nchecked at shoulder height, keeping the bat face open. \n • The head is kept straight and still throughout the shot \nand the top hand and elbow controls the direction of \nthe shot. At the time of impact the head should be \nover the ball with the body weight balanced on the \nfront foot. The full face of the bat must hit the ball and \non \ncompletion, the batsman must be well balanced. \nChap-6.indd   89 8/24/2020   11:39:30 AM\n2024-25",
      "content_type": "text",
      "token_count": 552,
      "page_number": 5
    },
    {
      "id": "a0cc35d8-ee8b-4a5d-8532-b679fa784b17",
      "chapter_id": "c22be10e-71fa-4ae8-8072-a86e62921355",
      "chunk_index": 6,
      "content": "--- Page 14 ---\nHealtH and PHysical education - class X\n90\nStraight drive\n • This shot is played exactly in the same way as an off \ndrive but with the difference is that it is played to a over \npitched ball in and around the line of middle stump \nand the front foot must point down the wicket and the \nbody must be turned slightly and the shoulders opened \nout to allow the free swing of the bat. \nOn drive\n • On drive is played to a over-pitched ball on and around \nthe leg stump. \n • This has been considered to be a difficult shot to play. \nThe basic principles of a drive apply here too, though \nthe swing of the bat is an arc from slips to mid- on \nwith the front pointing down the wicket. \n • The front foot should be placed outside the line of ball \nwith the shoulders turned and the impact is just in \nfront of the left toe. The follow through is generally \nchecked below shoulder height.\nBack foot defence\n • The back foot defensive stroke is played to a short-\npitched ball in line with the stumps, which is not \nshort enough to play and attacking shot.\n • The back foot is moved back and across to the line \nof the ball with the front naturally following it. The \nbat is brought down close to the body with the head \nsteady and over the ball. \n • The back foot must remain parallel to the crease as \nfar as possible to maintain the sideways position of \nthe body with the top hand firm and in control, and \nthe bottom hand holding the bat loosely.\n • To keep the bat straight, the left elbow is held high \nnext to the head. Care should be taken to maintain \nthe balance at the time of playing the ball and to \nremain ‘side-on’ as this presents a smaller target for \nshort rising deliveries. \n • The back foot defence can also be played with the \nbody beside the line of the ball, but here the batsman \nmust resist the temptation to follow the movement of \nthe ball away from him. \nBowling skills\nBowling is as important as batting. The ball is defended by \na batsman to save his wicket. When the ball is bowled to a \nbatsman it is called as a ball or delivery.\nFig. 6.11: Bowling Skills\nChap-6.indd   90 8/24/2020   11:39:31 AM\n2024-25",
      "content_type": "text",
      "token_count": 536,
      "page_number": 5
    },
    {
      "id": "d04eaa15-773a-44be-bca3-427e6d32a78e",
      "chapter_id": "c22be10e-71fa-4ae8-8072-a86e62921355",
      "chunk_index": 7,
      "content": "--- Page 15 ---\nTeam Games and sporTs I\n91\nTypes of bowling\nFast bowling Spin bowling\nSeam bowling Off spin\nSwing bowling Leg spin\nBouncer Chinaman\nIn swinger Doosra \nLeg cutter Googly\nOff cutter Arm ball\nSwing bowling\n • When a ball of a fast or medium fast bowler deviator in \nair either on leg side (in swing) or on off side (out swing) \nit is turned in air as swing bowling.\nOutswing\n • For out swing bowling, the ball is held with the index \nand middle finger and thumb below the seam, which \nis upright & angled towards the slips with the shiny \nsurface on the right (for right hand bowler).\n • For effective out swing bowling, the bowler should bowl \nas close as possible to the stumps.\n • The wrist is cocked and when the ball is released the \nseam must be vertical and goes down the pitch upright. \nThe two fingers should stay behind the seam as long as \npossible. \nInswing\n • Here, the ball is held by the two fingers and the thumb \nunderneath it, with the seam upright and angle towards \nfine leg. \n • The shiny side is on the left side and the fingers may \nalso have a slight gap between them.\nWicket keeping\nThe wicket keeper plays an important role in cricket. \nA good wicket keeper can save a number of runs for his team.  \nHis function is to stop deliveries, which the batsman is \nunable to play or passed by batsman.\nFielding\nIn 21st century, fielding is a key point to win the match.  \nA player requires more hard work, practice and flexibility to \nbecome a good fielder.\nFig. 6.12: Wicket keeping\nChap-6.indd   91 8/24/2020   11:39:32 AM\n2024-25\n\n--- Page 16 ---\nHealtH and PHysical education - class X\n92\n3rd Man\nLeg Slips\nFine leg\nSlips\nGully\nPoint\nCover Point\nCover\nExtra Cover\nMid off Mid on\nMid Wicket\nSquare Leg\nBowler\nWK\nDeep\nSquare\nDeep\nMid Wicket\nDeep Extra\nCover\nLong off Long on\nFig. 6.13: Fielding\nArjuna awardee\nS.No. Name of Player Year\n1 Sachin Tendulkar 1994\n2 Sourav Ganguly 1997\n3 Rahul Dravid 1998\n4 Mithali Raj 2003\n5 Anju Jain 2005\n6 Anjum Chopra 2006\n7 Jhulan Goswami 2010\nChap-6.indd   92 8/24/2020   11:39:32 AM\n2024-25\n\n--- Page 17 ---\nTeam Games and sporTs I\n93\n8 Virat Kohli 2013\n9 Harmanpreet Kaur 2017\n10 Smriti Mandhana 2018\nBharat Ratna\nS.No. Name of Player Year",
      "content_type": "text",
      "token_count": 553,
      "page_number": 14
    },
    {
      "id": "22331ae2-41ac-4883-8e1c-4013816b5643",
      "chapter_id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "chunk_index": 0,
      "content": "FootBall \nFootball has been a very popular game all over the world \nsince ages. Also commonly known as soccer, it is a game \nthat involves kicking a ball with the foot to score a point. \nIt is played between two teams with a spherical ball on a \nrectangular field of grass or green artificial turf. There is a \ngoal post at each end of the rectangular field and errected \nat the middle of base line. Points are scored by moving the \nball to an opposing team’s end of the field and putting it \nbetween two goal posts. Players are required to move the ball \nby kicking, dribbling, carrying, and passing. The team that \nscores more points than the other by the end of the match \nwins the game.\nHistory\nAccording to FIFA (Federation International de Football \nAssociation), the “very earliest form of the game was played \nin china during the second and third centuries. The game \nwas later developed in England and the rules of football were \nformulated in India, football began its journey when the \nBritish rulers brought it with them and in no time it became \npopular in the masses. The first recorded game here took place \nbetween the ‘Calcutta Club of Civilians’ and the ‘Gentlemen \nof Barrackpore’ in 1854. The first ever football club in India, \nthe ‘Calcutta Football Club’ was founded in 1872. The first \nfootball association, “the Indian Football Association” (IFA) \nwas established in Calcutta in 1893, though there was no \nIndian on its board till 1930s. It was later, replaced by All India \nFootball Federation (AIFF). The Durand Cup Tournament is \nthe oldest in India and the one of the oldest in the world, was \nstarted in Shimla in 1888. The decade of 1951 to 1962 is \nknown as the golden era in the history of Indian football, as \nthe country put up commendable performances in a number \nof international competitions. India won gold medals in 1951 \nand 1962 Asian Games, held at New Delhi and Jakarta.\n68-70 cm\nCircumference\nof football\nFig. 6.14: Specifications of \nfootball\nChap-6.indd   93 8/24/2020   11:39:32 AM\n2024-25\n\n--- Page 18 ---\nHealtH and PHysical education - class X\n94\nFig. 6.15: Children playing football\n90-120m\nHalfway Line\nCentre Circle\nCentre Spot\nRadius\n9.15m\nPenalty Area\nPenalty\nSpotGoal Area\nGoal45-90m Goal Line\nRadius9.15m\n40.3m\n16.5m\n11m\n5.5m\n16.5m\n7.32m\n2.45m\n10 yds\nFig. 6.16: Specifications of football ground\nField measurements\nAs per international standard, the length of the rectangular \nfootball field (pitch) is in the range of 100 to 110 m (110 to \n120 yards) and the width is in the range of 65 to 75 m (70 \nto 80 yards). There are also goal posts at the back of each \nfootball zone. One way to score is to kick the football through \nthe goal posts. The ball must go between the uprights and \nover the crossbar. \nChap-6.indd   94 8/24/2020   11:39:34 AM\n2024-25",
      "content_type": "text",
      "token_count": 703,
      "page_number": 14
    },
    {
      "id": "0f3ac732-28cc-4043-8a95-42c0566bf205",
      "chapter_id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "chunk_index": 1,
      "content": "--- Page 19 ---\nTeam Games and sporTs I\n95\nGoal post\nDistance between the posts is 7.32 meter whereas the height \nof the goal post is 2.44 meter.\nRules\nAccording to the official rules of football guide, the players \nneed to execute the game in a fair and accepted manner. The \nfootball match is played in two halves of 45 minutes each. \nThere are several rules in the game of football regarding the \nfield, players, penalties, offence and defence. \nStart and restart of play\nA coin toss takes place before the game starts, the winner of \nthe toss will get the choice of choosing the end to attack. At \nthe kick-off, all players from each side must be in their own \nhalves of the field. The kick-off takes place on the centre spot \nin the centre circle. The player who kicks off cannot touch it \nagain until another player has made contact.\nPunishment for offences\nIf the player persistently offends during a match, the referee \ncan choose to take action. First the Yellow Card as a caution \nis shown to a player. Any offence after the second one leads \nto Red card. If they showed a red card to a player it means \nthat player is expelled from the match. A straight red card (no \nprevious caution) can be shown for extreme offences, such \nas, serious foul play, violent conduct, spitting, deliberately \nhandling the ball to prevent a goal, a professional foul (denying \na goal scoring opportunity) and insulting language and/or \ngestures.\nFree kicks\nWhenever a free kick is taken, the players on the opposite \nside must be at least 10 yards away from the ball until it \nis kicked. If this rule is not adhered to, the kick is retaken. \nThere are two types of free kicks awarded, depending on the \nnature of the offence: (i) Direct Free Kick — allows the team \nto take a direct shot at the opponent`s goal. (ii) Indirect Free \nKick — a direct strike on goal is not permitted. It means a \nsecond player has to touch the ball after the kick is taken to \nscore a goal.\nPenalty kick\nA penalty kick is awarded for offences taking place in the \npenalty and goal areas. A nominated member of the team is \nallowed to strike at goal from the penalty spot, with only the \ngoalkeeper to beat. The goalkeeper must remain on his line \nuntil the ball has been kicked, and all other players must be \noutside the penalty area behind the penalty spot. After the \nChap-6.indd   95 8/24/2020   11:39:34 AM\n2024-25",
      "content_type": "text",
      "token_count": 597,
      "page_number": 14
    },
    {
      "id": "11139e58-8f4a-4bc7-918b-3ae2c196a2de",
      "chapter_id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "chunk_index": 2,
      "content": "--- Page 20 ---\nHealtH and PHysical education - class X\n96\nplayer has taken the kick, that player cannot strike the ball \nagain without another player touching the ball.\nThrow-in\nA throw-in is awarded when the whole ball crosses the touch \nline (conceded by the team who last touched the ball). It \nis delivered on the field of play with both hands and from \nbehind and over the player’s head. Otherwise it is deemed to \nbe a foul throw and a throw-in is given to the opposition. It \ncannot go directly to the goalkeeper’s hands (if on the same \nteam). A goal cannot be scored directly from a throw-in.\nCorner kick\nA corner kick is awarded once the whole ball crosses the goal \nline of the opposition, after touching one of their players. \nA kick is taken from the corner of whichever side the ball \ntravelled over the field. Opponents must be 10 yards from \nthe corner arc and the kicker cannot touch the ball a second \ntime without having touched by any other player.\nFundamental skills\nReceiving\nReceiving a ball on the ground is different than receiving a \nball in air. Keep your eye on the ball, select the foot to receive \nthe ball, don’t stop the ball, prepare it for new action or move, \nshot, dribble, pass.\nPassing\nPassing involves giving the ball to partners. Perfect decision \nmaking is required before a perfect pass. Before pass,  \nsee the target, approach the ball, and look at the ball holding \nthe head steady. Strike the correct area of the ball with \nlacked ankle, make sure of follow through and transfer of \nweight forward.\nShooting\nShooting uses the same elements as used in passing, the \ndifference is that the ball is to be passed to the goal keeper to \nconvert the score for the team. Player should look up to see \nthe position of goal keeper, choosing the area to shoot the \nball while make a proper contact with the ball with proper \nfollow through.\nTrapping\nIt is a method of gaining control of the ball. Trapping uses \nthe feet, thigh, or chest to bring the ball to the ground.\nChap-6.indd   96 8/24/2020   11:39:34 AM\n2024-25",
      "content_type": "text",
      "token_count": 513,
      "page_number": 14
    },
    {
      "id": "1827180c-9965-41af-a4a5-f69403cccbf6",
      "chapter_id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "chunk_index": 3,
      "content": "--- Page 21 ---\nTeam Games and sporTs I\n97\nTechniques and lead-up activities\nThe students already learnt the fundamental techniques of \nplaying football in the previous classes. Now let us discuss a \nfew lead-up activities to develop these techniques.\nBall control\nFive versus two in 30m x 20m area. Players make two touches \nonly to retain possession of the ball. \nDribbling\nFour quarters of the area are numbered. One player dribbles \nin one quarter and passes the ball to quarter number 2 \nand so on. Reaching last quarter, the player without losing \nthe ball gets points. If ball is lost in any quarter, the other \nteams start anti clockwise and then enter in to the next three \nquarters. \nPassing\nNumber of players—four. Rectangle measures 5m × 20m or \n10m × 30 m, one ball.\nHeading\nTwo versus two, Goal of 8 yards, Centre line 5 yards from \neach goal.\nShooting\nShooting board is a place along the penalty spot, arranged \ninside the penalty area. \nTackling\nOne versus one, 10m × 10m area, time 2 minutes. \nThrow-ins\nThrow-in is a competition between two players.\nGoal keeper\nA goal keeper also acts as a defence but is allowed to catch \nor touch the ball with hands within the penalty box (D-area). \nA goal keeper is usually the last man standing at the goal to \nprevent opponents from scoring the goal. \nArjuna awardees\nS.No. Name of Player Year\n1 P.K. Banerjee 1961\n2 C.P. Singh 1971\nChap-6.indd   97 8/24/2020   11:39:34 AM\n2024-25\n\n--- Page 22 ---\nHealtH and PHysical education - class X\n98\n3 Sudhir Karmakar 1981\n4 Baichung Bhutia 1998\n5 Oinam Bembem Devi 2017\nHoCkey\nIntroduction\nField Hockey is a team game, in which a team of players \nattempt to score goals by hitting/Scooping, pushing or \nflicking a ball into an opposing team’s goal using curved \nsticks. However, the name Field Hockey is used in countries \nin which the word Hockey is generally reserved for another \nform of hockey, such as ice hockey or street hockey. \nThe players should learn and practice the basic skills of \ndribbling, passing, tapping and hitting. They should learn \nhow to attack and score goals and how to work with others \nto defend and stop goals from being scored. To do this they \nneed to learn how to keep possession by dribbling effectively \nand moving the ball accurately and quickly between players. \nAs they progress, skills should become more consistent and \nefficient, and the players should be introduced to set play \nsituations. \nFig. 6.17: Players playing hockey\nHistory\nThe history of the game of hockey has its roots well laid in the \nworld’s early civilisations. One of the oldest known sports, the \nhockey game is believed to be in existence about 1200 years \nbefore the Ancient Games of Olympia. Right from Arabs, \nGreeks, Romans, and Persians to Ethiopians, every country \nplayed with a variation of the game. While some played it just \nChap-6.indd   98 8/24/2020   11:39:36 AM\n2024-25",
      "content_type": "text",
      "token_count": 724,
      "page_number": 14
    },
    {
      "id": "885f5528-c96a-45f8-82a4-59941557b89e",
      "chapter_id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "chunk_index": 4,
      "content": "--- Page 23 ---\nTeam Games and sporTs I\n99\nfor recreation, the others had the opinion that hockey would \nmake them better warriors. Even though many ancient \ncivilisations played hockey in different variations, the modern \ngame of field hockey was developed in the British Isles in the \n19th century. It was introduced in India by the British Army \nregiments and the game soon became popular. It was during \nthis time that the London Hockey Association was formed \nand the rules for playing hockey were standardised. In 1924, \nthe International Hockey Federation (FIH) was founded and \nthree years later, the International Federation of Women’s \nHockey followed.\nIn India, the first hockey club came up in Calcutta in \n1885-86 and soon Bombay and Punjab followed. Making \nits Olympic debut at the 1928 Amsterdam Games, Indian \nhockey team won its first Olympic gold, without conceding \na single goal. The hallmark of this ruthless domination was \nthe wizardry of Indian hockey legend, Dhyan Chand, who \nmesmerised the Amsterdam crowd with his dazzling skills. \nFrom 1928 to 1956, India won six consecutive Olympic gold \nmedals, while winning 24 consecutive matches. It was the \ngolden era of Indian hockey, when India produced some of \nthe finest players the game has ever seen.\nField measurements\n91.40 m\n55 m\n22.9 m\nCentre line\n22.9 m\nPenalty Spot\n22.9 m\n14.63 m\n6.4 m\n5.5 m\n5 m\nFig. 6.18: Specification of hockey field\nChap-6.indd   99 8/24/2020   11:39:36 AM\n2024-25",
      "content_type": "text",
      "token_count": 367,
      "page_number": 14
    },
    {
      "id": "ce819671-33b8-480f-a8a8-26469d2cd467",
      "chapter_id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "chunk_index": 5,
      "content": "--- Page 24 ---\nHealtH and PHysical education - class X\n100\nHockey is played on a 91.40 m × 55 m rectangular field.  \nAt each end there is a goal 2.14 m high 1.20 m deep and \n3.66 m wide measured from the inner sides of the posts and \ncrossbar, and the goal post is surrounded by an approximately \nsemi-circular area 14.63 m from the goal bounded by \na solid line. A spot 0.15m in diameter, called the penalty  \nspot, is marked with its centre 6.40 m from the centre of \neach goal.\nEquipment\nEach player carries a stick, normally a little over 3 feet (90 \ncentimeters) long, 2 inches wide and traditionally made \nof wood but now often made with fiberglass, Kevlar and \ncarbon fiber composites, with a rounded handle flattening \nout on one side and with a hook at the bottom.\nRules\nThe rules set by the International Hockey Federation FIH \nare used worldwide.\nGeneral play\nPrior to the start of the game, a coin is tossed and the \nwinning captain can choose a starting end or start with \nthe ball. The game time is divided into four quarters of 15 \nminutes each 15-02-15-10-15-2-15. At the start of each \nquarter as well as after goals are scored, play is started \nwith a pass from the centre of the field.\nField players may only play the ball with the flat side \nof the stick. Tackling is permitted as long as the tackler \ndoes not make contact with the attacker or his stick \nbefore playing the ball (contact after the tackle may also \nbe penalised if the tackle was made from a position where \ncontact was inevitable). Further, the player with the ball \nmay not deliberately use his body or stick to shield the \nball from a legitimate tackle.\nWhen the ball passes over the sidelines, it is returned to \nplay from sideline either by individual player by himself or \nwith a push or hit, taken by a member of the team whose \nplayers were not the last to touch the ball before crossing \nthe sideline. If it crosses the goal line after last touched \nby an attacker, a 15 mt hit or pass can be made by any \nplayer of the defending team. A 15 mt hit is also awarded \nfor offenses committed by the attacking side within  \n15 mt of the end, of the pitch they are attacking. \nFree hits\nFree hits are awarded when offences are committed outside \nthe scoring circles. The ball may be hit or pushed once in \nany direction by the team offended against. Opponents \nChap-6.indd   100 8/24/2020   11:39:36 AM\n2024-25",
      "content_type": "text",
      "token_count": 600,
      "page_number": 14
    },
    {
      "id": "b2e78905-8284-46e0-96ad-8d09589dbfd3",
      "chapter_id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "chunk_index": 6,
      "content": "--- Page 25 ---\nTeam Games and sporTs I\n101\nmust move 5 mt away from the ball when a free hit is \nawarded, and for attacking free hits within 5 mt of the circle, \nall attackers other than the one taking the hit must also be \n5 mt away. \nCorner\nA corner is awarded if the ball goes over the backline after \nlast being touched by a defender. Corners are played by \nthe attacking team and involve a free hit from the 22.90  \nmeter line.\nPenalty corner\nThe penalty corner is set play that is awarded against \na defending team when any offence is committed in the \ndefensive circle, and may be awarded when a deliberate \noffence is committed in the defending 23 m area, or when the \ndefending team deliberately plays the ball over the back line. \nPenalty stroke\nA penalty stroke is awarded when defenders commit a \ndeliberate foul in the circle which deprives an attacker of \npossession or the opportunity to play the ball. This penalty \nis being taken by a single attacker against the goalkeeper, \nand is taken from a spot 6.4 m from the penalty spot and \ndirectly in front of the goal. The goalkeeper must stand with \nheels on the goal line, and cannot move his feet until the ball \nis played. \nOn the umpire’s whistle, the striker may push or flick the \nball at the goal, which the goalkeeper attempts to save. The \nplayer taking the penalty shot may not touch the ball twice. \nHitting or dragging or tapping the ball is also forbidden. If \nthe shot is saved, play is restarted with 15 mt hit to the \ndefenders; if a goal is scored, play is restarted from the centre \nline. Time is stopped for the Penalty stroke.\nDangerous play\nIf the ball is raised off the ground in a manner that is, in the \numpire’s opinion, dangerous, the ball is turned over to the \nother team and they receive a free hit from the point of contact. \nTie breaker (shootout)\nIn case of a draw match, penalty shootout is conducted. \nThe winners will be decided by 5 penalty shootouts by each \nteam and the team which scores highest number of goals \nis declared the winner. The shootout will start at 22.90 mt. \nline in front of the shooter and should be completed within 8 \nseconds after the umpire’s whistle. The goalkeeper will start \ndefence from goal line.\nChap-6.indd   101 8/24/2020   11:39:36 AM\n2024-25",
      "content_type": "text",
      "token_count": 569,
      "page_number": 14
    },
    {
      "id": "fe4b7606-4705-48df-bed3-deb5ef13590f",
      "chapter_id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "chunk_index": 7,
      "content": "--- Page 26 ---\nHealtH and PHysical education - class X\n102\nArjuna awardees\nS.No. Name of Player Year\n1 Prithipal Singh 1961\n2 Sunita Puri 1966\n3 P. Krishnamurthy 1971\n4 Versha Soni 1981\n5 Dhanraj Pillai 1995\n6 Baljeet Singh Saini 2000\n7 Mamta Kharab 2002\n8 Ritu Saini and Rani Rampal 2016\n9 S.V. Sunil 2017\n10 Savita Punia 2018\n11 Manpreet Singh 2018\nVolleyBall\nVolleyball is a net game that involves two teams of 12 players \n(six playing and six substitutes). Each team works together \nto hit an inflated ball over a high net. Each team tries to \nscore points by grounding the ball on the other team’s court. \nVolleyball is a rebound game where one cannot hold or catch \nthe ball; every contact must be a rebound action. It is essential \nfor the player to be in the right place at the right time if \nthe game is to be played in a controlled manner. Therefore,  \ngood anticipation and movement skills should be taught \nto players. At competency level, students should learn and \npractice the basic skills of sending and receiving the ball over \na high net. They should play simple 3 touch volleyball games \nworking as a team to keep the ball in play and ground it on \nthe opponent’s side of the court.\nHistory\nOriginally named Mintonette, it was created as a gentle indoor \nsport for older players to be able to exert a bit of athletic \neffort by keeping the ball in the air. The idea of using a net \nwas borrowed from tennis. It was raised to a height above \nthe average man’s height. During a demonstration game, \nsomeone remarked that the players seemed to be volleying \nthe ball back and forth over the net, and perhaps “volleyball” \nwould be a more descriptive name for the sport. The game \nof Volleyball was invented by William G. Morgan in the year \n1895 in Holyoke, Massachusetts by YMCA (USA). It was \ninvented as a recreational game. This game was brought to \nIndia more than 85 years ago when some physical education \nChap-6.indd   102 8/24/2020   11:39:36 AM\n2024-25\n\n--- Page 27 ---\nTeam Games and sporTs I\n103\nteachers had been abroad and were trained in different  \ngames including Volleyball. YMCA College of Physical \nEducation, Madras, took this game seriously and students \ntrained there have taken the game to other parts of  \nthe country.\nFig. 6.19: Players playing volleyball\nMeasurements\nSide Line\nEndline Endline\n9m\n3-8m\n9m\nService Zone\nBack Zone\nFront\nZone\nFront\nZone\nBack Zone\nAttack line\nCentrelineand net\nAttack line\n3m 3m 3-8m\n9m\nService Zone\n9m\nA Antenna\nFig. 6.20: Specifications of volleyball court\nChap-6.indd   103 8/24/2020   11:39:38 AM\n2024-25",
      "content_type": "text",
      "token_count": 645,
      "page_number": 14
    },
    {
      "id": "9a1606be-6ec6-4432-9e70-f897c74f1735",
      "chapter_id": "deb91527-092a-4760-b9e5-e624e2fe3ee1",
      "chunk_index": 8,
      "content": "--- Page 28 ---\nHealtH and PHysical education - class X\n104\nNETR Posts\nThe net is 2.43 mt high for men and 2.24 mt high for women. \nIt is doubled vertically over the center line. It is 1 m wide and \n9.5-10 m long end is 10 cm more bleak mesh. The antenna \nis a flexible rod 1.8 m long and 10 mm. in diameter centered \nfixed an side line near pole. The top on antenna extends \n80 cm above the net. The 2.55 m high posts are placed  \n0.5 m – 1.0 m out side the side line.\nRules\nVolleyball is a fast game played by two teams of 6 players \neach. It can be played indoors or outdoors. A player \non one of the teams begins a ‘rally’ by serving the ball \nfrom behind the back line of the court, over the net, \nand into the receiving team’s court. The receiving team \nmust not let the ball be grounded within their court. \nThe rally continues, with each team allowed up to three \nconsecutive touches, until either a team grounds the ball \non the opponent’s court and wins the rally or a team \ncommits a fault and loses the rally. The team that wins \nthe rally is awarded a point, and serves the ball to start \nthe next rally. The ball is usually played with the hands \nor arms, but players can legally strike or push the ball \nwith any part of the body.\nCommon faults include —\n • catching and throwing the ball; \n • two consecutive contacts with the ball made by the",
      "content_type": "text",
      "token_count": 339,
      "page_number": 26
    },
    {
      "id": "a034f555-2f09-4ccb-b68a-32c2b0548589",
      "chapter_id": "0c1e0cef-ce64-436c-beeb-bd8a35460a0e",
      "chunk_index": 0,
      "content": "health?",
      "content_type": "text",
      "token_count": 1,
      "page_number": 26
    },
    {
      "id": "5392ebb4-3f39-4d37-a696-8b5e29412cc2",
      "chapter_id": "bb20dce2-f530-45b5-aa7a-21f2d78f2baf",
      "chunk_index": 0,
      "content": "II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 5,
      "page_number": 26
    },
    {
      "id": "44347502-5f62-4679-afe4-3df4d4523edf",
      "chapter_id": "94cf0e19-6f10-486f-bc0e-64cf0a78e23a",
      "chunk_index": 0,
      "content": "III. State whether True or False",
      "content_type": "text",
      "token_count": 8,
      "page_number": 26
    },
    {
      "id": "76854f65-0bb9-405d-b793-dd4885f9f1fe",
      "chapter_id": "fee7555a-ded5-49ca-9096-10414751052a",
      "chunk_index": 0,
      "content": "IV. Assess your Performance by the following Activities",
      "content_type": "text",
      "token_count": 13,
      "page_number": 26
    },
    {
      "id": "d1de157a-20aa-4dbb-b272-a7e8ffd9c415",
      "chapter_id": "d539e05d-4c21-401b-83ed-ab1022e7d8bb",
      "chunk_index": 0,
      "content": "position\nCriCket\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 12,
      "page_number": 26
    },
    {
      "id": "21d7674b-e1d1-494c-97af-ceb041e193a7",
      "chapter_id": "d87dcbb3-2b5c-466c-b506-480db69aa15a",
      "chunk_index": 0,
      "content": "Matches?\nChap-6.indd   107 8/24/2020   11:39:45 AM\n2024-25\n\n--- Page 32 ---\nHealtH and PHysical education - class X\n108\n II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 35,
      "page_number": 26
    },
    {
      "id": "225f9fa5-86ee-4333-8d0b-cd84a2883ae7",
      "chapter_id": "39cbc956-4e41-4933-9771-3aee66c4043a",
      "chunk_index": 0,
      "content": "the  _____________  in 1909.",
      "content_type": "text",
      "token_count": 7,
      "page_number": 26
    },
    {
      "id": "838873df-3704-48eb-8e28-e76321ef1f31",
      "chapter_id": "77ab7acd-2255-4562-920d-35b6e1986c89",
      "chunk_index": 0,
      "content": "_____________ to enable countries outside the Common Wealth \nto become its members.",
      "content_type": "text",
      "token_count": 20,
      "page_number": 26
    },
    {
      "id": "9fdc7f19-cb51-4277-adb6-8a82967b9c90",
      "chapter_id": "8ba555f8-70cd-43a4-aae6-0f5b205631b5",
      "chunk_index": 0,
      "content": "over Cricket World Cup in _____________ .",
      "content_type": "text",
      "token_count": 10,
      "page_number": 26
    },
    {
      "id": "4814154d-2f33-469d-86c4-e65f0227fbb9",
      "chapter_id": "f4e12bb1-42f1-4559-9f2c-7226d63a3395",
      "chunk_index": 0,
      "content": "_____________ .",
      "content_type": "text",
      "token_count": 3,
      "page_number": 26
    },
    {
      "id": "56035721-2b98-4db8-b087-f071ed2ee460",
      "chapter_id": "59e0e0ff-d307-4e46-8b9a-430e9770b173",
      "chunk_index": 0,
      "content": "end of _____________ .",
      "content_type": "text",
      "token_count": 5,
      "page_number": 26
    },
    {
      "id": "46b916ff-d599-4037-8a16-062eb2960a2e",
      "chapter_id": "0e3bb44f-f852-4e72-99a8-7a0b0b8d4cb6",
      "chunk_index": 0,
      "content": "Trophy, named after Prince Ranjit Singhji of Nawanagar.\nFootBall \n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 25,
      "page_number": 27
    },
    {
      "id": "2ababf0a-d8a0-4e89-a697-7bea7e7e72a3",
      "chapter_id": "d181ac78-e97e-4ad7-8e3f-fd4db09a7eb8",
      "chunk_index": 0,
      "content": "to the international standard?",
      "content_type": "text",
      "token_count": 7,
      "page_number": 27
    },
    {
      "id": "a1a63aab-a5a6-43b2-b59f-f04a646713d8",
      "chapter_id": "9438f4b8-41b4-491a-90f3-a6b990254057",
      "chunk_index": 0,
      "content": "positions?",
      "content_type": "text",
      "token_count": 2,
      "page_number": 27
    },
    {
      "id": "bd3dbfc2-c87c-41cd-b285-8fdd6741ac6d",
      "chapter_id": "33d0de70-6222-4f1e-bcf7-b6fee416e050",
      "chunk_index": 0,
      "content": "football match?",
      "content_type": "text",
      "token_count": 3,
      "page_number": 27
    },
    {
      "id": "5a8b2bb1-afff-44f2-a9de-a4860107e112",
      "chapter_id": "9a67c699-fa71-4082-9e19-06a7aee1e5d3",
      "chunk_index": 0,
      "content": "extended and why?",
      "content_type": "text",
      "token_count": 4,
      "page_number": 27
    },
    {
      "id": "7d6ffb25-2389-4a8a-8be6-c78d647d9e2f",
      "chapter_id": "ada5c93a-f1d7-443a-bcb0-6c5c0ec60401",
      "chunk_index": 0,
      "content": "match?",
      "content_type": "text",
      "token_count": 1,
      "page_number": 27
    },
    {
      "id": "3cc8e045-890a-4ddc-ba62-c20ac31bf559",
      "chapter_id": "2d3da14c-4231-4e4a-a701-fd105c7afc21",
      "chunk_index": 0,
      "content": "during the match?",
      "content_type": "text",
      "token_count": 4,
      "page_number": 27
    },
    {
      "id": "82a45e91-6c9d-4021-aedb-5d5010a18abb",
      "chapter_id": "5a1c2d39-c780-4818-bbae-692331030936",
      "chunk_index": 0,
      "content": "corner kick?",
      "content_type": "text",
      "token_count": 3,
      "page_number": 27
    },
    {
      "id": "a28a850f-a793-45cd-83f7-ea48154cff32",
      "chapter_id": "d45aab37-4a74-44ab-b8a2-e6d65ff5cec7",
      "chunk_index": 0,
      "content": "spectators?\n II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 8,
      "page_number": 27
    },
    {
      "id": "29762269-f6f8-4b70-a6c0-bdc576b0ee8b",
      "chapter_id": "5594273f-c879-4958-a3ea-2000cf342cde",
      "chunk_index": 0,
      "content": "in 1872.",
      "content_type": "text",
      "token_count": 2,
      "page_number": 27
    },
    {
      "id": "0a513a24-e589-4df9-b68a-78080dfe6cc4",
      "chapter_id": "51b16fb4-5c50-4be1-a873-efbf40f636d4",
      "chunk_index": 0,
      "content": "Association” (IFA) which was established in 1893 was replaced \nby _____________ .",
      "content_type": "text",
      "token_count": 20,
      "page_number": 27
    },
    {
      "id": "09fa3a0c-c32d-4a29-b946-26d3dfb4774b",
      "chapter_id": "119af04d-4c56-451d-adb1-0340437b6c61",
      "chunk_index": 0,
      "content": "the history of Indian football.\nChap-6.indd   108 8/24/2020   11:39:45 AM\n2024-25\n\n--- Page 33 ---\nTeam Games and sporTs I\n109",
      "content_type": "text",
      "token_count": 31,
      "page_number": 27
    },
    {
      "id": "daa960f3-cf24-47e6-81e9-c87d882ec527",
      "chapter_id": "19a4c53c-03fa-46fa-9684-ab0778aa7d50",
      "chunk_index": 0,
      "content": "semifinals in the _____________ Olympics.",
      "content_type": "text",
      "token_count": 10,
      "page_number": 27
    },
    {
      "id": "252615af-b4cb-4681-934f-8fffc90b6116",
      "chapter_id": "1f83bbb5-c010-4af8-aabc-3154946c4ee8",
      "chunk_index": 0,
      "content": "Asian Games held in Manila in _____________ .\nHoCkey \n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 22,
      "page_number": 27
    },
    {
      "id": "7ea915a5-fc8b-40ec-9a8b-a78fa150f770",
      "chapter_id": "90dd2d19-1ce9-49fe-aede-d90c2a86c460",
      "chunk_index": 0,
      "content": "(iii) equipment, (iv) free hits, (v) long corner, (vi) short corner, and \n(vii) penalty stroke?\n II. Fill in the Blanks\n (a) If the ball is raised off the ground in a manner that is, in the \numpire’s opinion, dangerous, the ball is turned over to the  \n_____________ and they receive a _____________ from the point  \nof contact. \n (b) Hockey uses a three-tier card system of warnings and suspensions \nand these are known as (i) _____________ card, (ii) _____________ \ncard, and (iii) _____________ card.\n (c) The procedure laid down in FIH tournament regulations for tie \nbreaker mandates _____________ minutes each way of “golden \ngoal” extra time (i.e. the game ends as soon as one team \nscores). If scores are still levelled, the game will be decided  \nwith  _____________. \nVolleyBall\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 205,
      "page_number": 28
    },
    {
      "id": "4c3d68c7-c194-4751-ae69-055dd262b4f9",
      "chapter_id": "6ccc3523-4a3f-4bb9-b259-791970292086",
      "chunk_index": 0,
      "content": "volleyball?\n II. Fill in the blanks",
      "content_type": "text",
      "token_count": 8,
      "page_number": 28
    },
    {
      "id": "f349b80d-8e7a-425e-ad4d-beee5423b372",
      "chapter_id": "8ea59e95-1c64-4c73-8370-7a7e8d2d8403",
      "chunk_index": 0,
      "content": "players each.",
      "content_type": "text",
      "token_count": 3,
      "page_number": 28
    },
    {
      "id": "4827334b-3d6e-4e6a-8281-8a89c40d8a97",
      "chapter_id": "e3a36e3d-7b26-4e40-8dbc-69c315310155",
      "chunk_index": 0,
      "content": "consecutive touches. \nChap-6.indd   109 8/24/2020   11:39:45 AM\n2024-25\n\n--- Page 34 ---\nHealtH and PHysical education - class X\n110\n III. State whether True or False",
      "content_type": "text",
      "token_count": 41,
      "page_number": 28
    },
    {
      "id": "ceedc9b3-7223-44a0-a7b2-3b548a9804bd",
      "chapter_id": "30f3ac1c-f85c-425c-a049-9d28f83ac8ea",
      "chunk_index": 0,
      "content": "are allowed.",
      "content_type": "text",
      "token_count": 3,
      "page_number": 28
    },
    {
      "id": "a6a88137-2ab1-4c2e-a3d6-c07c4412f2b6",
      "chapter_id": "c66cc4d3-2a0c-4b36-bf03-bad977b69de7",
      "chunk_index": 0,
      "content": "are allowed.",
      "content_type": "text",
      "token_count": 3,
      "page_number": 28
    },
    {
      "id": "9f4759f6-0365-4150-b006-e131ec18d70b",
      "chapter_id": "1fc1dd7a-6a5f-4ab5-adb3-1675e2e6fbcb",
      "chunk_index": 0,
      "content": "Chap-6.indd   110 8/24/2020   11:39:45 AM\n2024-25",
      "content_type": "text",
      "token_count": 12,
      "page_number": 28
    }
  ]
}