{
  "textbook": {
    "id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
    "file_name": "Class X Science NCERT - Ch 00 - The Human Eye and.pdf",
    "title": "The Human Eye and",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 10,
    "file_size_mb": 1.6763200759887695,
    "status": "ready",
    "processed_at": "2025-09-28T10:54:51.940626",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 00 - The Human Eye and.pdf"
  },
  "chapters": [
    {
      "id": "4b8652f8-53c2-4058-abab-64ad8cba95db",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 2,
      "title": "2. A person with a myopic eye cannot see objects beyond 1.2 m distinctly.",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "What should be the type of the corrective lens used to restore proper\nvision?"
    },
    {
      "id": "5dc55b5c-b62b-4bac-a9d4-0600e215ed61",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 3,
      "title": "3. What is the far point and near point of the human eye with normal",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "vision?"
    },
    {
      "id": "de3d5d5f-d93f-428e-b333-50ab51053068",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 4,
      "title": "4. A student has difficulty reading the blackboard while sitting in the last",
      "topics": [],
      "start_page": 4,
      "end_page": 10,
      "content": "row. What could be the defect the child is suffering from? How can it be\ncorrected?\n2024-25\n\n--- Page 5 ---\nThe Human Eye and the Colourful World 165\n10.3 REFRACTION OF LIGHT THROUGH A PRISM10.3 REFRACTION OF LIGHT THROUGH A PRISM10.3 REFRACTION OF LIGHT THROUGH A PRISM10.3 REFRACTION OF LIGHT THROUGH A PRISM10.3 REFRACTION OF LIGHT THROUGH A PRISM\nYou have learnt how light gets r efracted thr\nough a rectangular glass\nslab. For parallel refracting surfaces, as in a glass slab, the emergent ray\nis parallel to the incident ray.  However, it is slightly displaced laterally.\nHow would light get refracted through a transparent prism? Consider a\ntriangular glass prism. It has two triangular bases and three rectangular\nlateral surfaces. These surfaces are inclined to each other. The angle\nbetween its two lateral faces is called the angle of the prism. Let us now\ndo an activity to study the refraction of light through a triangular glass\nprism.\n/square6Eyes must be removed within 4-6 hours after death. Inform the nearest eye bank\nimmediately.\n/square6The eye bank team will remove the eyes at the home of the deceased or at a hospital.\n/square6Eye removal takes only 10-15 minutes. It is a simple process and does not lead to\nany disfigurement.\n/square6Persons who were infected with or died because of AIDS, Hepatitis B or C, rabies,\nacute leukaemia, tetanus, cholera, meningitis or encephalitis cannot donate eyes.\nAn eye bank collects, evaluates and distributes the donated eyes. All eyes donated are\nevaluated using strict medical standards. Those donated eyes found unsuitable for\ntransplantation are used for valuable research and medical education. The identities\nof both the donor and the recipient remain confidential.\nOne pair of eyes gives vision to up to FOUR CORNEAL BLIND PEOPLE.\nActivity 10.1Activity 10.1Activity 10.1Activity 10.1Activity 10.1\n/square6Fix a sheet of white paper on a drawing board using drawing pins.\n/square6Place a glass prism on it in such a way that it rests on its triangular\nbase. Trace the outline of the prism using a pencil.\n/square6Draw a straight line PE inclined to one of the refracting surfaces,\nsay AB, of the prism.\n/square6Fix two pins, say at points P and Q, on the line PE as shown in\nFig. 10.4.\n/square6Look for the images of the pins, fixed at P and Q, through the\nother face AC.\n/square6Fix two more pins, at points R and S, such that the pins at R and\nS and the images of the pins at P and Q lie on the same straight\nline.\n/square6Remove the pins and the glass prism.\n/square6The line PE meets the boundary of the prism at point E\n(see Fig. 10.4). Similarly, join and produce the points R and S.  Let\nthese lines meet the boundary of the prism at E and F, respectively.\nJoin E and F.\n/square6Draw perpendiculars to the refracting surfaces AB and AC of the\nprism at points E and F , respectively.\n/square6Mark the angle of incidence ( ∠ i), the angle of refraction ( ∠ r) and\nthe angle of emergence ( ∠ e) as shown in Fig. 10.4.\n2024-25\n\n--- Page 6 ---\nScience166\nActivity 10.2Activity 10.2Activity 10.2Activity 10.2Activity 10.2\n/square6Take a thick sheet of cardboard and make a small hole or narrow\nslit in its middle.\n/square6Allow sunlight to fall on the narrow slit. This gives a narrow beam\nof white light.\n/square6Now, take a glass prism and allow the light from the slit to fall on\none of its faces as shown in Fig. 10.5.\n/square6Turn the prism slowly until the light that comes out of it appears\non a nearby screen.\n/square6What do you observe? Y ou will find a beautiful band of colours.\nWhy does this happen?\nHere PE is the incident ray, EF is the refracted ray and FS is the\nemergent ray. You may note that a ray of light is entering fr\nom air to\nglass at the first surface AB. The light ray on refraction has bent towards\nthe normal. At the second surface AC, the light ray has entered from\nglass to air. Hence it has bent away from normal. Compare the angle of\nincidence and the angle of refraction at each refracting surface of the\nprism. Is this similar to the kind of bending that occurs in a glass slab?\nThe peculiar shape of the prism makes the emergent ray bend at an\nangle to the direction of the incident ray. This angle is called the angle of\ndeviation. In this case ∠ D is the angle of deviation. Mark the angle of\ndeviation in the above activity and measure it.\n10.4 DISPERSION OF WHITE LIGHT BY A GL10.4 DISPERSION OF WHITE LIGHT BY A GL10.4 DISPERSION OF WHITE LIGHT BY A GL10.4 DISPERSION OF WHITE LIGHT BY A GL10.4 DISPERSION OF WHITE LIGHT BY A GL ASS PRISM ASS PRISMASS PRISM ASS PRISMASS PRISM\nYou must have seen and appreciated the spectacular colours in a rainbow.\nHow could the white light of the Sun give us various colours of the\nrainbow? Before we take up this question, we shall first go back to the\nrefraction of light through a prism. The inclined refracting surfaces of a\nglass prism show exciting phenomenon.  Let us find it out through an\nactivity.\nPE – Incident ray ∠ i – Angle of incidence\nEF – Refracted ray ∠ r – Angle of refraction\nFS – Emergent ray ∠ e – Angle of emergence\n∠ A – Angle of the prism ∠ D – Angle of deviation\nFigure 10.4Figure 10.4Figure 10.4Figure 10.4Figure 10.4  Refraction of light through a triangular glass prism\n2024-25\n\n--- Page 7 ---\nThe Human Eye and the Colourful World 167\nThe prism has probably split the incident\nwhite light into a band of colours.  Note the\ncolours that appear at the two ends of the\ncolour band. What is the sequence of colours\nthat you see on the screen? The various\ncolours seen are Violet, Indigo, Blue, Green,\nYellow, Orange and Red, as shown in\nFig. 10.5. The acronym VIBGYOR will help\nyou to remember the sequence of colours.\nThe band of the coloured components of a\nlight beam is called its spectrum. You might\nnot be able to see all the colours separately.\nYet something makes each colour distinct from the other. The splitting\nof light into its component colours is called dispersion.\nYou have seen that white light is dispersed\ninto its seven-colour components by a prism.\nWhy do we get these colours? Different colours\nof light bend through different angles with\nrespect to the incident ray, as they pass\nthrough a prism. The red light bends the least\nwhile the violet the most. Thus the rays of each\ncolour emerge along different paths and thus\nbecome distinct. It is the band of distinct\ncolours that we see in a spectrum.\nIsaac Newton was the first to use a glass prism to obtain\nthe spectrum of sunlight. He tried to split the colours of\nthe spectrum of white light further by using another similar\nprism. However, he could not get any mor e colours. He\nthen placed a second identical prism in an inverted position\nwith respect to the first prism, as shown in Fig. 10.6. This\nallowed all the colours of the spectrum to pass through\nthe second prism. He found a beam of white light emerging\nfrom the other side of the second prism. This observation\ngave Newton the idea that the sunlight is made up of seven\ncolours.\nAny light that gives a spectrum similar to that of\nsunlight is often referred to as white light.\nA rainbow is a natural spectrum appearing in the sky\nafter a rain shower (Fig. 10.7). It is caused by dispersion\nof sunlight by tiny water droplets, present in the\natmosphere. A rainbow is always formed in a direction\nopposite to that of the Sun. The water droplets act like\nsmall prisms. They refract and disperse the incident\nsunlight, then reflect it internally, and finally refract it\nagain when it comes out of the raindrop (Fig. 10.8). Due\nto the dispersion of light and internal reflection, different\ncolours reach the observer’s eye.\nYou can also see a rainbow on a sunny day when\nyou look at the sky through a waterfall or through a water\nfountain, with the Sun behind you.\nFigure 10.5 Figure 10.5 Figure 10.5 Figure 10.5 Figure 10.5 Dispersion of white light by the glass prism\nFigure 10.6 Figure 10.6 Figure 10.6 Figure 10.6 Figure 10.6 Recombination of the spectrum of\nwhite light\nFigure 10.7 Figure 10.7 Figure 10.7 Figure 10.7 Figure 10.7 Rainbow in the sky\nFigure 10.8 Figure 10.8 Figure 10.8 Figure 10.8 Figure 10.8 Rainbow formation\nSunlight\nRaindrop\n2024-25\n\n--- Page 8 ---\nScience168\nFigure 10.10Figure 10.10Figure 10.10Figure 10.10Figure 10.10\nAtmospheric refraction\neffects at sunrise and\nsunset\n10.5   \n   ATMOSPHERIC REFRACTION\nYou might have observed the apparent random wavering or\nflickering of objects seen through a turbulent stream of hot air\nrising above a fire or a radiator. The air just above the fire becomes\nhotter than the air further up. The hotter air is lighter (less dense)\nthan the cooler air above it, and has a refractive index slightly\nless than that of the cooler air. Since the physical conditions of\nthe refracting medium (air) are not stationary, the apparent\nposition of the object, as seen through the hot air, fluctuates.\nThis wavering is thus an effect of atmospheric refraction (refraction\nof light by the earth’s atmosphere) on a small scale in our local\nenvironment. The twinkling of stars is a similar phenomenon on\na much larger scale. Let us see how we can explain it.\nTwinkling of stars\nThe twinkling of a star is due to atmospheric refraction of starlight. The\nstarlight, on entering the earth’s atmosphere, undergoes refraction\ncontinuously before it reaches the earth. The atmospheric refraction\noccurs in a medium of gradually changing refractive index. Since the\natmosphere bends starlight towards the normal, the apparent position\nof the star is slightly different from its actual position. The star appears\nslightly higher (above) than its actual position when viewed near the\nhorizon (Fig. 10.9). Further, this apparent position of the star is not\nstationary, but keeps on changing slightly, since the physical conditions\nof the earth’s atmosphere are not stationary, as was the case in the\nprevious paragraph. Since the stars are very distant, they approximate\npoint-sized sources of light. As the path of rays of light coming from\nthe star goes on varying slightly, the apparent position of the star\nfluctuates and the amount of starlight entering the eye flickers –  the\nstar sometimes appears brighter, and at some other time, fainter, which\nis the twinkling effect.\nWhy don’t the planets twinkle? The planets are much\ncloser to the earth, and are thus seen as extended sources.\nIf we consider a planet as a collection of a large number\nof point-sized sources of light, the total variation in the\namount of light entering our eye from all the individual\npoint-sized sources will average out to zero, thereby\nnullifying the twinkling effect.\nAdvance sunrise and delayed sunset\nThe Sun is visible to us about 2 minutes before the actual\nsunrise, and about 2 minutes after the actual sunset\nbecause of atmospheric refraction. By actual sunrise, we\nmean the actual crossing of the horizon by the Sun. Fig.\n10.10 shows the actual and apparent positions of the\nSun with respect to the horizon. The time difference\nbetween actual sunset and the apparent sunset is about\n2 minutes. The apparent flattening of the Sun’s disc at\nsunrise and sunset is also due to the same phenomenon.\nFigure 10.9Figure 10.9Figure 10.9Figure 10.9Figure 10.9\nApparent star position\ndue to atmospheric\nrefraction\n2024-25\n\n--- Page 9 ---\nThe Human Eye and the Colourful World 169\n10.6  SC ATTERING OF LIGHT\nThe interplay of light with objects around us gives rise to several\nspectacular phenomena in nature. The blue colour of the sky, colour of\nwater in deep sea, the reddening of the sun at sunrise and the sunset\nare some of the wonderful phenomena we are familiar with. In the previous\nclass, you have learnt about the scattering of light by colloidal particles.\nThe path of a beam of light passing through a true solution is not visible.\nHowever, its path becomes visible through a colloidal solution where the\nsize of the particles is relatively larger.\n10.6.1 Tyndall Effect\nThe earth’s atmosphere is a heterogeneous mixture of minute particles.\nThese particles include smoke, tiny water droplets, suspended particles\nof dust and molecules of air . When a beam of light strikes such fine\nparticles, the path of the beam becomes visible. The light reaches us,\nafter being reflected diffusely by these particles. The phenomenon of\nscattering of light by the colloidal particles gives rise to Tyndall effect\nwhich you have studied in Class IX. This phenomenon is seen when a\nfine beam of sunlight enters a smoke-filled room through a small hole.\nThus, scattering of light makes the particles visible. Tyndall effect can\nalso be observed when sunlight passes through a canopy of a dense\nforest.  Here, tiny water droplets in the mist scatter light.\nThe colour of the scattered light depends on the size of the scattering\nparticles. Very fine particles scatter mainly blue light while particles of\nlarger size scatter light of longer wavelengths.  If the size of the scattering\nparticles is large enough, then, the scattered light may even appear\nwhite.\n10.6.2 Why is the colour of the clear Sky Blue?\nThe molecules of air and other fine particles in the atmosphere have size\nsmaller than the wavelength of visible light. These are more effective in\nscattering light of shorter wavelengths at the blue end than light of longer\nwavelengths at the red end. The red light has a wavelength about 1.8\ntimes greater than blue light. Thus, when sunlight passes through the\natmosphere, the fine particles in air scatter the blue colour (shorter\nwavelengths) more strongly than red. The scattered blue light enters\nour eyes. If the earth had no atmosphere, there would not have been\nany scattering. Then, the sky would have looked dark.  The sky appears\ndark to passengers flying at very high altitudes, as scattering is not\nprominent at such heights.\nYou might have observed that ‘danger’ signal lights are red in colour.\nDo you know why? The red is least scattered by fog or smoke.  Therefore,\nit can be seen in the same colour at a distance.\n2024-25\n\n--- Page 10 ---\nScience170\nWhat you have learnt\n/square6The ability of the eye to focus on both near and distant objects, by adjusting its\nfocal length, is called the accommodation of the eye.\n/square6The smallest distance, at which the eye can see objects clearly without strain, is\ncalled the near point of the eye or the least distance of distinct vision.  For a young\nadult with normal vision, it is about 25 cm.\n/square6The common refractive defects of vision include myopia, hypermetropia and\npresbyopia. Myopia (short-sightedness – the image of distant objects is focussed\nbefore the r etina) is corr ected by using a concave lens of suitable power .\nHypermetropia (far-sightedness – the image of nearby objects is focussed beyond\nthe retina) is corr\nected by using a convex lens of suitable power. The eye loses its\npower of accommodation at old age.\n/square6The splitting of white light into its component colours is called dispersion.\n/square6Scattering of light causes the blue colour of sky.\nEXERCISES"
    },
    {
      "id": "cf2a69dd-93ac-4dfd-aa62-b489fb433827",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 5,
      "title": "1. The human eye can focus on objects at different distances by adjusting the focal",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "length of the eye lens. This is due to\n (a) presbyopia. (b) accommodation.\n(c) near-sightedness. (d) far-sightedness."
    },
    {
      "id": "38c9b36e-223d-40d3-a708-bb185f75e654",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 6,
      "title": "2. The human eye forms the image of an object at  its",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": " (a) cornea. (b)  iris. (c)  pupil. (d)  retina."
    },
    {
      "id": "664d9442-af34-4a2a-a1e1-03f25d7807bf",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 7,
      "title": "3. The least distance of distinct vision for a young adult with normal vision is about",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": " (a) 25 m. (b)  2.5 cm. (c)  25 cm. (d)  2.5 m."
    },
    {
      "id": "3305d68d-0029-47d3-bbcb-f3daec3bfd28",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 8,
      "title": "4. The change in focal length of an eye lens is caused by the action of the",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": " (a) pupil. (b)  retina. (c) ciliary muscles. (d)  iris."
    },
    {
      "id": "61cb09e1-8e70-4cc7-846a-cba0f69d6f65",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 9,
      "title": "5. A person needs a lens of power –5.5 dioptres for correcting his distant vision. For",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "correcting his near vision he needs a lens of power +1.5 dioptre. What is the focal\nlength of the lens required for correcting (i) distant vision, and (ii) near vision?"
    },
    {
      "id": "8ead1d44-6b07-4bc2-b561-2fba27f5e859",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 10,
      "title": "6. The far point of a myopic person is 80 cm in front of the eye. What is the nature and",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "power of the lens required to correct the problem?"
    },
    {
      "id": "20cce5cc-9f34-4558-96ba-35737276d890",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 11,
      "title": "7. Make a diagram to show how hypermetropia is corrected. The near point of a",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "hypermetropic eye is 1 m. What is the power of the lens required to correct this\ndefect? Assume that the near point of the normal eye is 25 cm."
    },
    {
      "id": "840c85b4-d2c0-4531-a46b-a925e130efe0",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 13,
      "title": "9. What happens to the image distance in the eye when we increase the distance of an",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "object from the eye?"
    },
    {
      "id": "0b6b299a-af8f-4d1f-867f-e7125aa21f9a",
      "textbook_id": "c6c7dfbc-2050-4152-ba3b-90e80be30ee5",
      "chapter_number": 16,
      "title": "12. Why does the sky appear dark instead of blue to an astronaut?",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "21f5be78-6fdb-4b1b-b5bd-7c5326f880e1",
      "chapter_id": "4b8652f8-53c2-4058-abab-64ad8cba95db",
      "chunk_index": 0,
      "content": "What should be the type of the corrective lens used to restore proper\nvision?",
      "content_type": "text",
      "token_count": 19,
      "page_number": 4
    },
    {
      "id": "52ea65fd-bc6c-40cc-a52c-2cea90d24cc1",
      "chapter_id": "5dc55b5c-b62b-4bac-a9d4-0600e215ed61",
      "chunk_index": 0,
      "content": "vision?",
      "content_type": "text",
      "token_count": 1,
      "page_number": 4
    },
    {
      "id": "b4f20850-0c29-4dba-b4a4-bea807c74efd",
      "chapter_id": "de3d5d5f-d93f-428e-b333-50ab51053068",
      "chunk_index": 0,
      "content": "row. What could be the defect the child is suffering from? How can it be\ncorrected?\n2024-25\n\n--- Page 5 ---\nThe Human Eye and the Colourful World 165\n10.3 REFRACTION OF LIGHT THROUGH A PRISM10.3 REFRACTION OF LIGHT THROUGH A PRISM10.3 REFRACTION OF LIGHT THROUGH A PRISM10.3 REFRACTION OF LIGHT THROUGH A PRISM10.3 REFRACTION OF LIGHT THROUGH A PRISM\nYou have learnt how light gets r efracted thr\nough a rectangular glass\nslab. For parallel refracting surfaces, as in a glass slab, the emergent ray\nis parallel to the incident ray.  However, it is slightly displaced laterally.\nHow would light get refracted through a transparent prism? Consider a\ntriangular glass prism. It has two triangular bases and three rectangular\nlateral surfaces. These surfaces are inclined to each other. The angle\nbetween its two lateral faces is called the angle of the prism. Let us now\ndo an activity to study the refraction of light through a triangular glass\nprism.\n/square6Eyes must be removed within 4-6 hours after death. Inform the nearest eye bank\nimmediately.\n/square6The eye bank team will remove the eyes at the home of the deceased or at a hospital.\n/square6Eye removal takes only 10-15 minutes. It is a simple process and does not lead to\nany disfigurement.\n/square6Persons who were infected with or died because of AIDS, Hepatitis B or C, rabies,\nacute leukaemia, tetanus, cholera, meningitis or encephalitis cannot donate eyes.\nAn eye bank collects, evaluates and distributes the donated eyes. All eyes donated are\nevaluated using strict medical standards. Those donated eyes found unsuitable for\ntransplantation are used for valuable research and medical education. The identities\nof both the donor and the recipient remain confidential.\nOne pair of eyes gives vision to up to FOUR CORNEAL BLIND PEOPLE.\nActivity 10.1Activity 10.1Activity 10.1Activity 10.1Activity 10.1\n/square6Fix a sheet of white paper on a drawing board using drawing pins.\n/square6Place a glass prism on it in such a way that it rests on its triangular\nbase. Trace the outline of the prism using a pencil.\n/square6Draw a straight line PE inclined to one of the refracting surfaces,\nsay AB, of the prism.\n/square6Fix two pins, say at points P and Q, on the line PE as shown in\nFig. 10.4.\n/square6Look for the images of the pins, fixed at P and Q, through the\nother face AC.\n/square6Fix two more pins, at points R and S, such that the pins at R and\nS and the images of the pins at P and Q lie on the same straight\nline.\n/square6Remove the pins and the glass prism.\n/square6The line PE meets the boundary of the prism at point E\n(see Fig. 10.4). Similarly, join and produce the points R and S.  Let\nthese lines meet the boundary of the prism at E and F, respectively.\nJoin E and F.\n/square6Draw perpendiculars to the refracting surfaces AB and AC of the\nprism at points E and F , respectively.\n/square6Mark the angle of incidence ( ∠ i), the angle of refraction ( ∠ r) and\nthe angle of emergence ( ∠ e) as shown in Fig. 10.4.\n2024-25",
      "content_type": "text",
      "token_count": 749,
      "page_number": 4
    },
    {
      "id": "883b7133-b594-475a-8eb2-4109629e20d4",
      "chapter_id": "de3d5d5f-d93f-428e-b333-50ab51053068",
      "chunk_index": 1,
      "content": "--- Page 6 ---\nScience166\nActivity 10.2Activity 10.2Activity 10.2Activity 10.2Activity 10.2\n/square6Take a thick sheet of cardboard and make a small hole or narrow\nslit in its middle.\n/square6Allow sunlight to fall on the narrow slit. This gives a narrow beam\nof white light.\n/square6Now, take a glass prism and allow the light from the slit to fall on\none of its faces as shown in Fig. 10.5.\n/square6Turn the prism slowly until the light that comes out of it appears\non a nearby screen.\n/square6What do you observe? Y ou will find a beautiful band of colours.\nWhy does this happen?\nHere PE is the incident ray, EF is the refracted ray and FS is the\nemergent ray. You may note that a ray of light is entering fr\nom air to\nglass at the first surface AB. The light ray on refraction has bent towards\nthe normal. At the second surface AC, the light ray has entered from\nglass to air. Hence it has bent away from normal. Compare the angle of\nincidence and the angle of refraction at each refracting surface of the\nprism. Is this similar to the kind of bending that occurs in a glass slab?\nThe peculiar shape of the prism makes the emergent ray bend at an\nangle to the direction of the incident ray. This angle is called the angle of\ndeviation. In this case ∠ D is the angle of deviation. Mark the angle of\ndeviation in the above activity and measure it.\n10.4 DISPERSION OF WHITE LIGHT BY A GL10.4 DISPERSION OF WHITE LIGHT BY A GL10.4 DISPERSION OF WHITE LIGHT BY A GL10.4 DISPERSION OF WHITE LIGHT BY A GL10.4 DISPERSION OF WHITE LIGHT BY A GL ASS PRISM ASS PRISMASS PRISM ASS PRISMASS PRISM\nYou must have seen and appreciated the spectacular colours in a rainbow.\nHow could the white light of the Sun give us various colours of the\nrainbow? Before we take up this question, we shall first go back to the\nrefraction of light through a prism. The inclined refracting surfaces of a\nglass prism show exciting phenomenon.  Let us find it out through an\nactivity.\nPE – Incident ray ∠ i – Angle of incidence\nEF – Refracted ray ∠ r – Angle of refraction\nFS – Emergent ray ∠ e – Angle of emergence\n∠ A – Angle of the prism ∠ D – Angle of deviation\nFigure 10.4Figure 10.4Figure 10.4Figure 10.4Figure 10.4  Refraction of light through a triangular glass prism\n2024-25",
      "content_type": "exercise",
      "token_count": 563,
      "page_number": 4
    },
    {
      "id": "e4c53e79-823f-47c3-9cff-632a33340fa2",
      "chapter_id": "de3d5d5f-d93f-428e-b333-50ab51053068",
      "chunk_index": 2,
      "content": "--- Page 7 ---\nThe Human Eye and the Colourful World 167\nThe prism has probably split the incident\nwhite light into a band of colours.  Note the\ncolours that appear at the two ends of the\ncolour band. What is the sequence of colours\nthat you see on the screen? The various\ncolours seen are Violet, Indigo, Blue, Green,\nYellow, Orange and Red, as shown in\nFig. 10.5. The acronym VIBGYOR will help\nyou to remember the sequence of colours.\nThe band of the coloured components of a\nlight beam is called its spectrum. You might\nnot be able to see all the colours separately.\nYet something makes each colour distinct from the other. The splitting\nof light into its component colours is called dispersion.\nYou have seen that white light is dispersed\ninto its seven-colour components by a prism.\nWhy do we get these colours? Different colours\nof light bend through different angles with\nrespect to the incident ray, as they pass\nthrough a prism. The red light bends the least\nwhile the violet the most. Thus the rays of each\ncolour emerge along different paths and thus\nbecome distinct. It is the band of distinct\ncolours that we see in a spectrum.\nIsaac Newton was the first to use a glass prism to obtain\nthe spectrum of sunlight. He tried to split the colours of\nthe spectrum of white light further by using another similar\nprism. However, he could not get any mor e colours. He\nthen placed a second identical prism in an inverted position\nwith respect to the first prism, as shown in Fig. 10.6. This\nallowed all the colours of the spectrum to pass through\nthe second prism. He found a beam of white light emerging\nfrom the other side of the second prism. This observation\ngave Newton the idea that the sunlight is made up of seven\ncolours.\nAny light that gives a spectrum similar to that of\nsunlight is often referred to as white light.\nA rainbow is a natural spectrum appearing in the sky\nafter a rain shower (Fig. 10.7). It is caused by dispersion\nof sunlight by tiny water droplets, present in the\natmosphere. A rainbow is always formed in a direction\nopposite to that of the Sun. The water droplets act like\nsmall prisms. They refract and disperse the incident\nsunlight, then reflect it internally, and finally refract it\nagain when it comes out of the raindrop (Fig. 10.8). Due\nto the dispersion of light and internal reflection, different\ncolours reach the observer’s eye.\nYou can also see a rainbow on a sunny day when\nyou look at the sky through a waterfall or through a water\nfountain, with the Sun behind you.\nFigure 10.5 Figure 10.5 Figure 10.5 Figure 10.5 Figure 10.5 Dispersion of white light by the glass prism\nFigure 10.6 Figure 10.6 Figure 10.6 Figure 10.6 Figure 10.6 Recombination of the spectrum of\nwhite light\nFigure 10.7 Figure 10.7 Figure 10.7 Figure 10.7 Figure 10.7 Rainbow in the sky\nFigure 10.8 Figure 10.8 Figure 10.8 Figure 10.8 Figure 10.8 Rainbow formation\nSunlight\nRaindrop\n2024-25",
      "content_type": "text",
      "token_count": 727,
      "page_number": 4
    },
    {
      "id": "b4bb3c6d-2e40-4008-85a6-938c545a1120",
      "chapter_id": "de3d5d5f-d93f-428e-b333-50ab51053068",
      "chunk_index": 3,
      "content": "--- Page 8 ---\nScience168\nFigure 10.10Figure 10.10Figure 10.10Figure 10.10Figure 10.10\nAtmospheric refraction\neffects at sunrise and\nsunset\n10.5   \n   ATMOSPHERIC REFRACTION\nYou might have observed the apparent random wavering or\nflickering of objects seen through a turbulent stream of hot air\nrising above a fire or a radiator. The air just above the fire becomes\nhotter than the air further up. The hotter air is lighter (less dense)\nthan the cooler air above it, and has a refractive index slightly\nless than that of the cooler air. Since the physical conditions of\nthe refracting medium (air) are not stationary, the apparent\nposition of the object, as seen through the hot air, fluctuates.\nThis wavering is thus an effect of atmospheric refraction (refraction\nof light by the earth’s atmosphere) on a small scale in our local\nenvironment. The twinkling of stars is a similar phenomenon on\na much larger scale. Let us see how we can explain it.\nTwinkling of stars\nThe twinkling of a star is due to atmospheric refraction of starlight. The\nstarlight, on entering the earth’s atmosphere, undergoes refraction\ncontinuously before it reaches the earth. The atmospheric refraction\noccurs in a medium of gradually changing refractive index. Since the\natmosphere bends starlight towards the normal, the apparent position\nof the star is slightly different from its actual position. The star appears\nslightly higher (above) than its actual position when viewed near the\nhorizon (Fig. 10.9). Further, this apparent position of the star is not\nstationary, but keeps on changing slightly, since the physical conditions\nof the earth’s atmosphere are not stationary, as was the case in the\nprevious paragraph. Since the stars are very distant, they approximate\npoint-sized sources of light. As the path of rays of light coming from\nthe star goes on varying slightly, the apparent position of the star\nfluctuates and the amount of starlight entering the eye flickers –  the\nstar sometimes appears brighter, and at some other time, fainter, which\nis the twinkling effect.\nWhy don’t the planets twinkle? The planets are much\ncloser to the earth, and are thus seen as extended sources.\nIf we consider a planet as a collection of a large number\nof point-sized sources of light, the total variation in the\namount of light entering our eye from all the individual\npoint-sized sources will average out to zero, thereby\nnullifying the twinkling effect.\nAdvance sunrise and delayed sunset\nThe Sun is visible to us about 2 minutes before the actual\nsunrise, and about 2 minutes after the actual sunset\nbecause of atmospheric refraction. By actual sunrise, we\nmean the actual crossing of the horizon by the Sun. Fig.\n10.10 shows the actual and apparent positions of the\nSun with respect to the horizon. The time difference\nbetween actual sunset and the apparent sunset is about\n2 minutes. The apparent flattening of the Sun’s disc at\nsunrise and sunset is also due to the same phenomenon.\nFigure 10.9Figure 10.9Figure 10.9Figure 10.9Figure 10.9\nApparent star position\ndue to atmospheric\nrefraction\n2024-25",
      "content_type": "text",
      "token_count": 771,
      "page_number": 4
    },
    {
      "id": "c9468fbe-54f2-47c3-821f-c1547e7d172d",
      "chapter_id": "de3d5d5f-d93f-428e-b333-50ab51053068",
      "chunk_index": 4,
      "content": "--- Page 9 ---\nThe Human Eye and the Colourful World 169\n10.6  SC ATTERING OF LIGHT\nThe interplay of light with objects around us gives rise to several\nspectacular phenomena in nature. The blue colour of the sky, colour of\nwater in deep sea, the reddening of the sun at sunrise and the sunset\nare some of the wonderful phenomena we are familiar with. In the previous\nclass, you have learnt about the scattering of light by colloidal particles.\nThe path of a beam of light passing through a true solution is not visible.\nHowever, its path becomes visible through a colloidal solution where the\nsize of the particles is relatively larger.\n10.6.1 Tyndall Effect\nThe earth’s atmosphere is a heterogeneous mixture of minute particles.\nThese particles include smoke, tiny water droplets, suspended particles\nof dust and molecules of air . When a beam of light strikes such fine\nparticles, the path of the beam becomes visible. The light reaches us,\nafter being reflected diffusely by these particles. The phenomenon of\nscattering of light by the colloidal particles gives rise to Tyndall effect\nwhich you have studied in Class IX. This phenomenon is seen when a\nfine beam of sunlight enters a smoke-filled room through a small hole.\nThus, scattering of light makes the particles visible. Tyndall effect can\nalso be observed when sunlight passes through a canopy of a dense\nforest.  Here, tiny water droplets in the mist scatter light.\nThe colour of the scattered light depends on the size of the scattering\nparticles. Very fine particles scatter mainly blue light while particles of\nlarger size scatter light of longer wavelengths.  If the size of the scattering\nparticles is large enough, then, the scattered light may even appear\nwhite.\n10.6.2 Why is the colour of the clear Sky Blue?\nThe molecules of air and other fine particles in the atmosphere have size\nsmaller than the wavelength of visible light. These are more effective in\nscattering light of shorter wavelengths at the blue end than light of longer\nwavelengths at the red end. The red light has a wavelength about 1.8\ntimes greater than blue light. Thus, when sunlight passes through the\natmosphere, the fine particles in air scatter the blue colour (shorter\nwavelengths) more strongly than red. The scattered blue light enters\nour eyes. If the earth had no atmosphere, there would not have been\nany scattering. Then, the sky would have looked dark.  The sky appears\ndark to passengers flying at very high altitudes, as scattering is not\nprominent at such heights.\nYou might have observed that ‘danger’ signal lights are red in colour.\nDo you know why? The red is least scattered by fog or smoke.  Therefore,\nit can be seen in the same colour at a distance.\n2024-25",
      "content_type": "text",
      "token_count": 680,
      "page_number": 4
    },
    {
      "id": "dcdda0d7-0c59-41f1-9d4f-4e103acdf0f8",
      "chapter_id": "de3d5d5f-d93f-428e-b333-50ab51053068",
      "chunk_index": 5,
      "content": "--- Page 10 ---\nScience170\nWhat you have learnt\n/square6The ability of the eye to focus on both near and distant objects, by adjusting its\nfocal length, is called the accommodation of the eye.\n/square6The smallest distance, at which the eye can see objects clearly without strain, is\ncalled the near point of the eye or the least distance of distinct vision.  For a young\nadult with normal vision, it is about 25 cm.\n/square6The common refractive defects of vision include myopia, hypermetropia and\npresbyopia. Myopia (short-sightedness – the image of distant objects is focussed\nbefore the r etina) is corr ected by using a concave lens of suitable power .\nHypermetropia (far-sightedness – the image of nearby objects is focussed beyond\nthe retina) is corr\nected by using a convex lens of suitable power. The eye loses its\npower of accommodation at old age.\n/square6The splitting of white light into its component colours is called dispersion.\n/square6Scattering of light causes the blue colour of sky.\nEXERCISES",
      "content_type": "exercise",
      "token_count": 253,
      "page_number": 10
    },
    {
      "id": "97bbbb1f-d18f-4a3b-af22-5464c750511a",
      "chapter_id": "cf2a69dd-93ac-4dfd-aa62-b489fb433827",
      "chunk_index": 0,
      "content": "length of the eye lens. This is due to\n (a) presbyopia. (b) accommodation.\n(c) near-sightedness. (d) far-sightedness.",
      "content_type": "text",
      "token_count": 29,
      "page_number": 10
    },
    {
      "id": "37f354c8-b9c0-49f9-8123-cd4696662d95",
      "chapter_id": "38c9b36e-223d-40d3-a708-bb185f75e654",
      "chunk_index": 0,
      "content": "(a) cornea. (b)  iris. (c)  pupil. (d)  retina.",
      "content_type": "text",
      "token_count": 11,
      "page_number": 10
    },
    {
      "id": "e378cdbb-df79-4b3b-920e-9395ad0897e9",
      "chapter_id": "664d9442-af34-4a2a-a1e1-03f25d7807bf",
      "chunk_index": 0,
      "content": "(a) 25 m. (b)  2.5 cm. (c)  25 cm. (d)  2.5 m.",
      "content_type": "text",
      "token_count": 11,
      "page_number": 10
    },
    {
      "id": "01ff30c7-e140-432d-ac25-f25dd702749c",
      "chapter_id": "3305d68d-0029-47d3-bbcb-f3daec3bfd28",
      "chunk_index": 0,
      "content": "(a) pupil. (b)  retina. (c) ciliary muscles. (d)  iris.",
      "content_type": "text",
      "token_count": 13,
      "page_number": 10
    },
    {
      "id": "9f35ef50-5221-4621-8ae0-bdf680c03a04",
      "chapter_id": "61cb09e1-8e70-4cc7-846a-cba0f69d6f65",
      "chunk_index": 0,
      "content": "correcting his near vision he needs a lens of power +1.5 dioptre. What is the focal\nlength of the lens required for correcting (i) distant vision, and (ii) near vision?",
      "content_type": "text",
      "token_count": 42,
      "page_number": 10
    },
    {
      "id": "24c8cb87-debe-44b7-bae4-2174faca8a9b",
      "chapter_id": "8ead1d44-6b07-4bc2-b561-2fba27f5e859",
      "chunk_index": 0,
      "content": "power of the lens required to correct the problem?",
      "content_type": "exercise",
      "token_count": 12,
      "page_number": 10
    },
    {
      "id": "79dbe13f-b44b-4e3c-8ec3-56fd277ae890",
      "chapter_id": "20cce5cc-9f34-4558-96ba-35737276d890",
      "chunk_index": 0,
      "content": "hypermetropic eye is 1 m. What is the power of the lens required to correct this\ndefect? Assume that the near point of the normal eye is 25 cm.",
      "content_type": "text",
      "token_count": 35,
      "page_number": 10
    },
    {
      "id": "23a74a73-b169-48eb-8008-b2fc003bb00c",
      "chapter_id": "840c85b4-d2c0-4531-a46b-a925e130efe0",
      "chunk_index": 0,
      "content": "object from the eye?",
      "content_type": "text",
      "token_count": 5,
      "page_number": 10
    },
    {
      "id": "c245620b-d56a-43a0-ade1-14b6154d6f8c",
      "chapter_id": "0b6b299a-af8f-4d1f-867f-e7125aa21f9a",
      "chunk_index": 0,
      "content": "2024-25",
      "content_type": "text",
      "token_count": 1,
      "page_number": 10
    }
  ]
}