{
  "textbook": {
    "id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
    "file_name": "Class X Science NCERT - Ch 03 - COOH), sodium hydroxide (NaOH), calcium.pdf",
    "title": "COOH), sodium hydroxide (NaOH), calcium",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 20,
    "file_size_mb": 2.8757009506225586,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:08.074643",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 03 - COOH), sodium hydroxide (NaOH), calcium.pdf"
  },
  "chapters": [
    {
      "id": "8a485c43-c6da-40f5-bf50-af6066639230",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 1,
      "title": "1. You have been pr ovided with thr ee test tubes. One of them contains",
      "topics": [],
      "start_page": 1,
      "end_page": 5,
      "content": "distilled water and the other two contain an acidic solution and a basic\nsolution, r espectively. If you ar e given only r ed litmus paper , how will\nyou identify the contents of each test tube?\n/square6Collect the following solutions from the science laboratory–\nhydrochloric acid (HCl),  sulphuric acid (H2SO4), nitric acid (HNO3),\nacetic acid (CH 3COOH), sodium hydroxide (NaOH), calcium\nhydroxide [Ca(OH) 2], potassium hydroxide (KOH), magnesium\nhydroxide [Mg(OH)2], and ammonium hydroxide (NH 4OH).\n/square6Put a drop of each of the above solutions on a watch-glass one by\none and test with a drop of the indicators shown in Table 2.1.\n/square6What change in colour did you observe with red litmus, blue litmus,\nphenolphthalein and methyl orange solutions for each of the\nsolutions taken?\n/square6Tabulate your observations in Table 2.1.\nTable 2.1\nSample Red Blue Phenolph- Methyl\nsolution litmus litmus -thalein      orange\nsolution solution solution solution\nActivity 2.2Activity 2.2Activity 2.2Activity 2.2Activity 2.2\n/square6Take some finely chopped onions in a plastic bag along with some\nstrips of clean cloth. T ie up the bag tightly and leave over night in\nthe fridge. The cloth strips can now be used to test for acids and\nbases.\n/square6Take two of these cloth strips and check their odour .\n/square6Keep them on a clean surface and put a few drops of dilute HCl\nsolution on one strip and a few drops of dilute NaOH solution on\nthe other.\n2024-25\n\n--- Page 3 ---\nAcids, Bases and Salts 19\nWhich of these – vanilla, onion and clove, can be used as olfactory\nindicators on the basis of your observations?\nLet us do some more activities to understand the chemical properties\nof acids and bases.\n2.1.2 How do Acids and Bases React with Metals?\n/square6Rinse both cloth strips with water and again check their odour .\n/square6Note your observations.\n/square6Now take some dilute vanilla essence and clove oil and check their\nodour.\n/square6Take some dilute HCl solution in one test tube and dilute NaOH\nsolution in another . Add a few dr ops of dilute vanilla essence to\nboth test tubes and shake well. Check the odour once again and\nrecord changes in odour , if any.\n/square6Similarly, test the change in the odour of clove oil with dilute HCl\nand dilute NaOH solutions and record your observations.\nActivity 2.3Activity 2.3Activity 2.3Activity 2.3Activity 2.3\nCAUTION: This activity needs the teacher’s assistance.\n/square6Set the apparatus as shown in Fig. 2.1.\n/square6Take about 5 mL of dilute sulphuric acid in a test tube and add a\nfew pieces of zinc granules to it.\n/square6What do you observe on the surface of zinc granules?\n/square6Pass the gas being evolved through the soap solution.\n/square6Why are bubbles  formed in the soap solution?\n/square6Take a burning candle near a gas filled bubble.\n/square6What do you observe?\n/square6Repeat this Activity with some more acids like HCl, HNO 3 and\nCH3COOH.\n/square6Are the observations in all the cases the same or different?\nFigure 2.1Figure 2.1Figure 2.1Figure 2.1Figure 2.1 Reaction of zinc granules with dilute sulphuric acid and testing hydrogen\ngas by burning\n2024-25\n\n--- Page 4 ---\nScience20\n Note that the metal in the above reactions displaces hydrogen atoms\nfrom the acids as hydrogen gas and forms a compound called a salt.\nThus, the reaction of a metal with an acid can be summarised as –\nAcid + Metal →  Salt + Hydrogen gas\nCan you now write the equations for the reactions you have observed?\nActivity 2.4Activity 2.4Activity 2.4Activity 2.4Activity 2.4\nThe reactions occurring in the above Activity are written as –\nTest tube A: Na CO HCl(aq) Cl(aq) H O(l) + CO2 3 2 2(s) N a (g)+ → +2 2\nTest tube B: NaHCO HCl(aq) Cl(aq) H O(l) + CO3 2 2(s) Na (g)+ → +\nOn passing the carbon dioxide gas evolved through lime water,\nCa(OH) CO H O(l)2 2 2(aq) (g) CaCO s 3+ → +( )\n(Lime water) (White precipitate)\n/square6Place a few pieces of granulated zinc metal in a test tube.\n/square6Add 2 mL of sodium hydroxide solution and warm the contents\nof the test tube.\n/square6Repeat the rest of the steps as in Activity 2.3 and record your\nobservations.\nThe reaction that takes place can be written as follows.\n2NaOH(aq) + Zn(s) →  Na2ZnO2(s) + H2(g)\n      (Sodium zincate)\nYou find again that hydr ogen is formed in the reaction. However,\nsuch reactions are not possible with all metals.\n2.1.3 How do Metal Carbonates and Metal\nHydrogencarbonates React with Acids?\nActivity 2.5Activity 2.5Activity 2.5Activity 2.5Activity 2.5\n/square6Take two test tubes, label them as A\nand B.\n/square6Take about 0.5 g of sodium carbonate\n(Na2CO3) in test tube A and about\n0.5 g of sodium hydrogencarbonate\n(NaHCO3) in test tube B.\n/square6Add about 2 mL of dilute HCl to both\nthe test tubes.\n/square6What do you observe?\n/square6Pass the gas produced in each case\nthrough lime water (calcium\nhydroxide solution) as shown in\nFig. 2.2 and record your observations.\nFigure 2.2Figure 2.2Figure 2.2Figure 2.2Figure 2.2\nPassing carbon dioxide gas\nthrough calcium hydroxide\nsolution\n2024-25\n\n--- Page 5 ---\nAcids, Bases and Salts 21\nActivity 2.6Activity 2.6Activity 2.6Activity 2.6Activity 2.6\n/square6Take about 2 mL of dilute NaOH solution in a test tube and add\ntwo drops of phenolphthalein solution.\n/square6What is the colour of the solution?\n/square6Add dilute HCl solution to the above solution drop by drop.\n/square6Is there any colour change for the reaction mixture?\n/square6Why did the colour of phenolphthalein change after the addition\nof an acid?\n/square6Now add a few drops of NaOH to the above mixture.\n/square6Does the pink colour of phenolphthalein reappear?\n/square6Why do you think this has happened?\nOn passing excess carbon dioxide the following reaction takes place:\nCaCO s Ca(HCO aq3 3( ) ) ( )+ →H O(l)+ CO (g) 2 2 2\n(Soluble in water)\nLimestone, chalk and marble are different forms of calcium carbonate.\nAll metal carbonates and hydrogencarbonates react with acids to give a\ncorresponding salt, carbon dioxide and water.\nThus, the reaction can be summarised as –\nIn the above Activity, we have observed that the effect of a base is\nnullified by an acid and vice-versa. The reaction taking place is written as –\nNaOH(aq) + HCl(aq) →  NaCl(aq) + H2O(l)\nThe reaction between an acid and a base to give a salt and water is\nknown as a neutralisation reaction. In general, a neutralisation reaction\ncan be written as –\nBase + Acid →  Salt + Water\n2.1.5 Reaction of Metallic Oxides with Acids\nActivity 2.7Activity 2.7Activity 2.7Activity 2.7Activity 2.7\n/square6Take a small amount of copper oxide in a beaker and add dilute\nhydrochloric acid slowly while stirring.\n/square6Note the colour of the solution. What has happened to the copper\noxide?\nYou will notice that the colour of the solution becomes blue-green\nand the copper oxide dissolves. The blue-green colour of the solution is\ndue to the formation of copper(II) chloride in the reaction. The general\nreaction between a metal oxide and an acid can be written as –\nMetal oxide + Acid →  Salt + Water\nMetal carbonate/Metal hydrogencarbonate + Acid →  Salt + Carbon dioxide + Water\n2.1.4 How do Acids and Bases React with each other?\n2024-25\n\n--- Page 6 ---\nScience22\nNow write and balance the equation for the above reaction. Since\nmetallic oxides react with acids to give salts and water, similar to the\nreaction of a base with an acid, metallic oxides are said to be basic oxides.\n2.1.6 Reaction of a Non-metallic Oxide with Base\nYou saw the reaction between carbon dioxide and calcium hydroxide\n(lime water) in Activity 2.5. Calcium hydroxide, which is a base, reacts\nwith carbon dioxide to produce a salt and water. Since this is similar to\nthe reaction between a base and an acid, we can conclude that non-\nmetallic oxides are acidic in nature.\nQUESTIONS\n?"
    },
    {
      "id": "3ff69711-79ad-4921-b926-9e9ebff03fe1",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 2,
      "title": "1. Why should curd and sour substances not be kept in brass and copper",
      "topics": [],
      "start_page": 5,
      "end_page": 5,
      "content": "vessels?"
    },
    {
      "id": "f9161e58-9013-44e6-a79c-079c8b30aa15",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 3,
      "title": "2. Which gas is usually liberated when an acid reacts with a metal?",
      "topics": [],
      "start_page": 5,
      "end_page": 5,
      "content": "Illustrate with an example. How will you test for the presence of\nthis gas?"
    },
    {
      "id": "34bad1f7-1582-4dc1-a724-278a20689c0b",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 4,
      "title": "3. Metal compound A reacts with dilute hydrochloric acid to produce",
      "topics": [],
      "start_page": 5,
      "end_page": 8,
      "content": "effervescence. The gas evolved extinguishes a bur ning candle. W rite a\nbalanced chemical equation for the reaction if one of the compounds\nformed is calcium chloride.\n2.2 WHA2.2 WHA2.2 WHA2.2 WHA2.2 WHA T DO ALL ACIDS AND ALL BASES HAT DO ALL ACIDS AND ALL BASES HAT DO ALL ACIDS AND ALL BASES HAT DO ALL ACIDS AND ALL BASES HAT DO ALL ACIDS AND ALL BASES HA VE IN\nVE INVE IN VE INVE IN\nCOMMON?COMMON?COMMON?COMMON?COMMON?\nIn Section 2.1 we have seen that all acids have similar chemical\nproperties. What leads to this similarity in properties? We saw in Activity\n2.3 that all acids generate hydrogen gas on reacting with metals, so\nhydrogen seems to be common to all acids. Let us perform an Activity to\ninvestigate whether all compounds containing hydrogen are acidic.\nActivity 2.8Activity 2.8Activity 2.8Activity 2.8Activity 2.8\n/square6Take solutions of glucose, alcohol,\nhydrochloric acid, sulphuric acid, etc.\n/square6Fix two nails on a cork, and place the cork in\na 100 mL beaker .\n/square6Connect the nails to the two terminals of a\n6 volt battery through a bulb and a switch, as\nshown in Fig. 2.3.\n/square6Now pour some dilute HCl in the beaker and\nswitch on the current.\n/square6Repeat with dilute sulphuric acid.\n/square6What do you observe?\n/square6Repeat the experiment separately with\nglucose and alcohol solutions. What do you\nobserve now?\n/square6Does the bulb glow in all cases?\nFigure 2.3Figure 2.3Figure 2.3Figure 2.3Figure 2.3\nAcid solution in water\nconducts electricity\n2024-25\n\n--- Page 7 ---\nAcids, Bases and Salts 23\nThe bulb will start glowing in the case of acids, as shown in Fig. 2.3.\nBut you will observe that glucose and alcohol solutions do not conduct\nelectricity. Glowing of the bulb indicates that there is a flow of electric\ncurrent through the solution. The electric current is carried through the\nacidic solution by ions.\nAcids contain H+ ion as cation and anion such as Cl–  in HCl, N\nO3\n–  in\nHNO3, SO2–\n4\n in H2SO4, CH3COO– in CH3COOH. Since the cation present in\nacids is H+, this suggests that acids produce hydrogen ions, H+(aq), in\nsolution, which are responsible for their acidic properties.\nRepeat the same Activity using alkalis such as sodium hydroxide, calcium\nhydroxide, etc. What can you conclude from the results of this Activity?\n2.2.1 What Happens to an Acid or a Base in a Water Solution?\nDo acids produce ions only in aqueous solution? Let us test this.\nActivity 2.9Activity 2.9Activity 2.9Activity 2.9Activity 2.9\n/square6Take about 1g solid NaCl in a clean and\ndry test tube and set up the apparatus as\nshown in Fig. 2.4.\n/square6Add some concentrated sulphuric acid to\nthe test tube.\n/square6What do you observe? Is there a gas coming\nout of the delivery tube?\n/square6Test the gas evolved successively with dry\nand wet blue litmus paper .\n/square6In which case does the litmus paper change\ncolour?\n/square6On the basis of the above Activity, what do\nyou infer about the acidic character of:\n(i) dry HCl gas\n(ii) HCl solution?\nFigure 2.4 Figure 2.4 Figure 2.4 Figure 2.4 Figure 2.4 Preparation of HCl gas\nThis experiment suggests that hydrogen ions in HCl are produced\nin the presence of water. The separation of H+ ion from HCl molecules\ncannot occur in the absence of water.\nHCl + H2O →  H3O+ + Cl–\nHydrogen ions cannot exist alone, but they exist after combining\nwith water molecules. Thus hydrogen ions must always be shown as\nH+(aq) or hydronium ion (H3O+).\nH+ + H2O →  H3O+\nWe have seen that acids give H3O+ or H+(aq) ion in water. Let us see\nwhat happens when a base is dissolved in water.\nNaOH(s) H O2 →    Na+ (aq) + OH– (aq)\nNote to teachers: If the climate is very humid, you will have to pass the gas produced\nthrough a guard tube (drying tube) containing calcium chloride to dry the gas.\n2024-25\n\n--- Page 8 ---\nScience24\nKOH(s) K (aq)+OH (aq)H O2 + →  –\nMg(OH)2(s) H O2 →   Mg2+(aq)+2OH– (aq)\nBases generate hydroxide (OH– ) ions in water. Bases which are soluble\nin water are called alkalis.\nDo You\nKnow?\nAll bases do not dissolve in water. An alkali is a base that dissolves in water. They\nare soapy to touch, bitter and corrosive. Never taste or touch them as they may\ncause harm. Which of the bases in the Table 2.1 are alkalis?\nNow as we have identified that all acids generate H +(aq) and all\nbases generate OH\n–\n(aq), we can view the neutralisation reaction as\nfollows –\nAcid + Base → Salt + Water\nH  X + M  OH →  MX + HOH\nH+(aq) + OH\n–\n (aq) →  H2O(l)\nLet us see what is involved when water is mixed with an acid or a base.\nActivity 2.10Activity 2.10Activity 2.10Activity 2.10Activity 2.10\n/square6Take 10 mL water in a beaker .\n/square6Add a few drops of concentrated H 2SO4 to it and swirl the\nbeaker slowly.\n/square6Touch the base of the beaker .\n/square6Is there a change in temperature?\n/square6Is this an exothermic or endothermic process?\n/square6Repeat the above Activity with sodium hydroxide pellets\nand record your observations.Figure 2.5Figure 2.5Figure 2.5Figure 2.5Figure 2.5\nWarning sign displayed\non containers containing\nconcentrated acids and\nbases The process of dissolving an acid or a base in water is a highly\nexothermic one. Care must be taken while mixing concentrated nitric\nacid or sulphuric acid with water. The acid must always be added slowly\nto water with constant stirring. If water is added to a concentrated acid,\nthe heat generated may cause the mixture to splash out and cause burns.\nThe glass container may also break due to excessive local heating. Look\nout for the warning sign (shown in Fig. 2.5) on the can of concentrated\nsulphuric acid and on the bottle of sodium hydroxide pellets.\nMixing an acid or base with water results in decrease in the\nconcentration of ions (H3O+/OH– ) per unit volume. Such a process is\ncalled dilution and the acid or the base is said to be diluted.\n2024-25\n\n--- Page 9 ---\nAcids, Bases and Salts 25\n2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?\nWe know how acid-base indicators can be used to distinguish between\nan acid and a base. We have also learnt in the previous section about\ndilution and decrease in concentration of H+ or OH–  ions in solutions.\nCan we quantitatively find the amount of these ions present in a solution?\nCan we judge how strong a given acid or base is?\nWe can do this by making use of a universal indicator, which is a\nmixture of several indicators. The universal indicator shows different\ncolours at different concentrations of hydrogen ions in a solution.\nA scale for measuring hydrogen ion concentration in a solution, called\npH scale has been developed. The p in pH stands for ‘potenz’ in German,\nmeaning power. On the pH scale we can measur e pH generally from\n0 (very acidic) to 14 (very alkaline). pH should be thought of simply as a\nnumber which indicates the acidic or basic nature of a solution. Higher\nthe hydronium ion concentration, lower is the pH value.\nThe pH of a neutral solution is 7. Values less than 7 on the pH scale\nrepresent an acidic solution. As the pH value increases from 7 to 14, it\nrepresents an increase in OH–  ion concentration in the solution, that is,\nincrease in the strength of alkali (Fig. 2.6). Generally paper impregnated\nwith the universal indicator is used for measuring pH.\nQUESTIONS\n?"
    },
    {
      "id": "7bbb1527-ad81-45c2-bec2-61b546d26b4a",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 5,
      "title": "1. Why do HCl, HNO 3, etc., show acidic characters in aqueous solutions",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "while solutions of compounds like alcohol and glucose do not show acidic\ncharacter?"
    },
    {
      "id": "0cf2577b-9ad1-4552-9695-006aa95cd1c6",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 8,
      "title": "4. While diluting an acid, why is it recommended that the acid should be",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "added to water and not water to the acid?"
    },
    {
      "id": "7be857c4-e327-4e99-82b3-3f14ec5b1a9f",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 9,
      "title": "5. How is the concentration of hydronium ions (H 3O+) affected when a",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "solution of an acid is diluted?"
    },
    {
      "id": "d1c87e5a-0a13-44c6-a903-c36ec30da35b",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 10,
      "title": "6. How is the concentration of hydroxide ions (O H",
      "topics": [],
      "start_page": 8,
      "end_page": 11,
      "content": "–\n) affected when excess\nbase is dissolved in a solution of sodium hydroxide?\nFigure 2.6Figure 2.6Figure 2.6Figure 2.6Figure 2.6  Variation of pH with the change in concentration of  H+(aq) and OH– (aq) ions\n2024-25\n\n--- Page 10 ---\nScience26\nActivity 2.11Activity 2.11Activity 2.11Activity 2.11Activity 2.11\n/square6Test the pH values\nof solutions given in\nTable 2.2.\n/square6Record your observations.\n/square6What is the nature of each\nsubstance on the basis of\nyour observations?\nFigure 2.7 Figure 2.7 Figure 2.7 Figure 2.7 Figure 2.7 pH of some common substances shown on a pH paper (colours are only a rough guide)\nThe strength of acids and bases depends on the number of H+ ions\nand OH– ions produced, respectively. If we take hydrochloric acid and\nacetic acid of the same concentration, say one molar, then these produce\ndifferent amounts of hydrogen ions. Acids that give rise to more H+ ions\nare said to be strong acids, and acids that give less H+ ions are said to be\nweak acids. Can you now say what weak and strong bases are?\n2.3.1 Impor2.3.1 Impor2.3.1 Impor2.3.1 Impor2.3.1 Impor tance of pH in Evertance of pH in Evertance of pH in Evertance of pH in Evertance of pH in Ever yday Life yday Lifeyday Lifeyday Lifeyday Life\nAre plants and animals pH sensitive?\nOur body works within the pH range of 7.0 to 7.8. Living organisms can\nsurvive only in a narrow range of pH change. When pH of rain water is\nless than 5.6, it is called acid rain. When acid rain flows into the rivers, it\nlowers the pH of the river water. The survival of aquatic life in such rivers\nbecomes difficult.\nTable 2.2\n S. Solution Colour of Approx- Nature of\nNo. pH paper -imate substance\npH value\n1 Saliva (before meal)\n2 Saliva (after meal)\n3 Lemon juice\n4 Colourless aerated\ndrink\n5 Carrot juice\n6 Coffee\n7 Tomato juice\n8 Tap water\n9 1M NaOH\n10 1M HCl\n2024-25\n\n--- Page 11 ---\nAcids, Bases and Salts 27\nWhat is the pH of the soil in your backyard?\nPlants require a specific pH range for their healthy growth. To find out\nthe pH required for the healthy growth of a plant, you can collect the soil\nfrom various places and check the pH in the manner described below in\nActivity 2.12. Also, you can note down which plants are growing in the\nregion from which you have collected the soil.\nAcids in other planets\nThe atmosphere of venus is made up of thick white and yellowish clouds of\nsulphuric acid. Do you think life can exist on this planet?\nActivity 2.12Activity 2.12Activity 2.12Activity 2.12Activity 2.12\n/square6Put about 2 g soil in a test tube and add 5 mL water to it.\n/square6Shake the contents of the test tube.\n/square6Filter the contents and collect the filtrate in a test tube.\n/square6Check the pH of this filtrate with the help of universal\nindicator paper .\n/square6What can you conclude about the ideal soil pH for the growth of\nplants in your region?\npH in our digestive system\nIt is very interesting to note that our stomach produces hydrochloric\nacid. It helps in the digestion of food without harming the stomach.\nDuring indigestion the stomach produces too much acid and this causes\npain and irritation. To get rid of this pain, people use bases called\nantacids. One such remedy must have been suggested by you at the\nbeginning of this Chapter. These antacids neutralise the excess acid.\nMagnesium hydroxide (Milk of magnesia), a mild base, is often used for\nthis purpose.\npH change as the cause of tooth decay\nTooth decay starts when the pH of the mouth is lower than 5.5. Tooth\nenamel, made up of calcium hydroxyapatite (a crystalline form of calcium\nphosphate) is the hardest substance in the body. It does not dissolve in\nwater, but is corroded when the pH in the mouth is below 5.5. Bacteria\npresent in the mouth produce acids by degradation of sugar and food\nparticles remaining in the mouth after eating. The best way to prevent\nthis is to clean the mouth after eating food. Using toothpastes, which are\ngenerally basic, for cleaning the teeth can neutralise the excess acid and\nprevent tooth decay.\nSelf defence by animals and plants through chemical warfare\nHave you ever been stung by a honey-bee? Bee-sting leaves an acid\nwhich  causes pain and irritation. Use of a mild base like baking soda\non the stung area gives relief. Stinging hair of nettle leaves inject\nmethanoic acid causing burning pain.\nDo You\nKnow?\n2024-25\n\n--- Page 12 ---\nScience28\n2.4 MORE ABOUT SAL2.4 MORE ABOUT SAL2.4 MORE ABOUT SAL2.4 MORE ABOUT SAL2.4 MORE ABOUT SAL TS TSTSTSTS\nIn the previous sections we have seen the formation of salts during\nvarious reactions. Let us understand more about their preparation,\nproperties and uses.\n2.4.1 Family of Salts\nActivity 2.13Activity 2.13Activity 2.13Activity 2.13Activity 2.13\n/square6Write the chemical for mulae of the salts given below.\nPotassium sulphate, sodium sulphate, calcium sulphate,\nmagnesium sulphate, copper sulphate, sodium chloride, sodium\nnitrate, sodium carbonate and ammonium chloride.\nNature provides neutralisation options\nNettle is a herbaceous plant which grows in the wild. Its leaves have stinging hair,\nwhich cause painful stings when touched accidentally. This is due to the methanoic\nacid secreted by them. A traditional remedy is rubbing the\narea with the leaf of the dock plant, which often grows beside\nthe nettle in the wild. Can you guess the nature of the dock\nplant? So next time you know what to look out for if you\naccidentally touch a nettle plant while trekking. Are you aware\nof any other effective traditional remedies for such stings?\nTable 2.3 Some naturally occurring acids\nNatural source Acid Natural source Acid\nVinegar Acetic acid Sour milk (Curd) Lactic acid\nOrange Citric acid Lemon Citric acid\nTamarind Tartaric acid Ant sting Methanoic acid\nTomato Oxalic acid Nettle sting Methanoic acid\nQUESTIONS"
    },
    {
      "id": "16baa7f1-ac74-4e9b-98a0-bb34e36ea618",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 11,
      "title": "1. You have two solutions, A and B. The pH of solution A is 6 and pH of",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "solution B is 8. Which solution has more hydrogen ion concentration?\nWhich of this is acidic and which one is basic?"
    },
    {
      "id": "2049ebb0-cfab-46e7-a72d-2ef6dd823974",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 12,
      "title": "2. What effect does the concentration of H +(aq) ions have on the nature of the",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "solution?"
    },
    {
      "id": "d124ef44-97d0-4c9b-abea-6f15077c927c",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 14,
      "title": "4. Under what soil condition do you think a farmer would treat the soil of his",
      "topics": [],
      "start_page": 11,
      "end_page": 15,
      "content": "fields with quick lime (calcium oxide) or slaked lime (calcium hydroxide) or\nchalk (calcium carbonate)?\n?\nDo You Know?\n2024-25\n\n--- Page 13 ---\nAcids, Bases and Salts 29\n/square6Identify the acids and bases from which the above salts may be\nobtained.\n/square6Salts having the same positive or negative radicals are said to\nbelong to a family.  For example, NaCl and Na 2SO4 belong to the\nfamily of sodium salts.  Similarly, NaCl and KCl belong to the family\nof chloride salts.  How many families can you identify among the\nsalts given in this Activity?\n2.4.2 pH of Salts\nActivity 2.14Activity 2.14Activity 2.14Activity 2.14Activity 2.14\n/square6Collect the following salt samples – sodium chloride, potassium\nnitrate, aluminium chloride, zinc sulphate, copper sulphate,\nsodium acetate, sodium carbonate and sodium hydrogencarbonate\n(some other salts available can also be taken).\n/square6Check their solubility in water (use distilled water only).\n/square6Check the action of these solutions on litmus and find the pH\nusing a pH paper .\n/square6Which of the salts are acidic, basic or neutral?\n/square6Identify the acid or base used to form the salt.\n/square6Report your observations in Table 2.4.\nSalts of a strong acid and a strong base\nare neutral with pH value of 7. On the other\nhand, salts of a strong acid and weak base\nare acidic with pH value less than 7 and those\nof a strong base and weak acid are basic in\nnature, with pH value more than 7.\n2.4.3 Chemicals from Common Salt\nBy now you have learnt that the salt formed\nby the combination of hydrochloric acid and\nsodium hydroxide solution is called sodium\nchloride. This is the salt that you use in food.\nYou must have observed in the above Activity\nthat it is a neutral salt.\nSeawater contains many salts dissolved\nin it. Sodium chloride is separated from these\nsalts. Deposits of solid salt are also found in\nseveral parts of the world. These large crystals\nare often brown due to impurities. This is\ncalled rock salt. Beds of rock salt were formed\nwhen seas of bygone ages dried up. Rock salt\nis mined like coal.\nYou must have heard about Mahatma Gandhi’s Dandi March. Did\nyou know that sodium chloride was such an important symbol in our\nstruggle for freedom?\nTable 2.4\nSalt pH Acid used Base used\n2024-25\n\n--- Page 14 ---\nScience30\nCommon salt — A raw material for chemicals\nThe common salt thus obtained is an important raw material for various\nmaterials of daily use, such as sodium hydroxide, baking soda, washing\nsoda, bleaching powder and many more. Let us see how one substance\nis used for making all these different substances.\nSodium hydroxide\nWhen electricity is passed through an aqueous solution of sodium\nchloride (called brine), it decomposes to form sodium hydroxide. The\nprocess is called the chlor-alkali process because of the products formed–\nchlor for chlorine and alkali for sodium hydroxide.\n2NaCl(aq) + 2H2O(l) →  2NaOH(aq) + Cl2(g) + H2(g)\nChlorine gas is given off at the anode, and hydrogen gas at the cathode.\nSodium hydroxide solution is formed near the cathode. The three\nproducts produced in this process are all useful. Figure 2.8 shows the\ndifferent uses of these products.\nBleaching powder\nYou have already come to know that chlorine is produced during the\nelectrolysis of aqueous sodium chloride (brine). This chlorine gas is used\nfor the manufacture of bleaching powder. Bleaching powder is produced\nby the action of chlorine on dry slaked lime [Ca(OH)2]. Bleaching powder\nis represented as CaOCl 2, though the actual composition is quite\ncomplex.\nCa(OH)2 + Cl2 →  CaOCl2 + H2O\nFigure 2.8Figure 2.8Figure 2.8Figure 2.8Figure 2.8  Important products from the chlor-alkali process\n2024-25\n\n--- Page 15 ---\nAcids, Bases and Salts 31\nBleaching powder is used –\n(i) for bleaching cotton and linen in the textile industry, for bleaching\nwood pulp in paper factories and for bleaching washed clothes\nin laundry;\n(ii) as an oxidising agent in many chemical industries; and\n(iii) to make drinking water free from germs.\nBaking soda\nThe baking soda is commonly used in the kitchen for making tasty crispy\npakoras, etc. Sometimes it is added for faster cooking. The chemical\nname of the compound is sodium hydrogencarbonate (NaHCO 3). It is\nproduced using sodium chloride as one of the raw materials.\nNaCl + H O + CO + NH NH Cl + NaHCO2 2 3 4 3→\n(Ammonium (Sodium\nchloride) hydrogencarbonate)\nDid you check the pH of sodium hydrogencarbonate in Activity 2.14?\nCan you correlate why it can be used to neutralise an acid? It is a mild\nnon-corrosive basic salt. The following reaction takes place when it is\nheated during cooking –\n2NaHCO Na CO + H O+CO3 2 3 2 2\nHeat → \n(Sodium (Sodium\nhydrogencarbonate) carbonate)\nSodium hydrogencarbonate has got various uses in the household.\nUses of Baking soda\n(i) For making baking powder, which is a mixture of baking soda\n(sodium hydrogencarbonate) and a mild edible acid such as\ntartaric acid. When baking powder is heated or mixed in water,\nthe following reaction takes place –\nNaHCO3 + H+      →     CO2 + H2O + Sodium salt of acid\n         (From any acid)\nCarbon dioxide produced during the reaction can cause bread or\ncake to rise making them soft and spongy.\n(ii) Sodium hydrogencarbonate is also an ingredient in antacids.\nBeing alkaline, it neutralises excess acid in the stomach and\nprovides relief.\n(iii) It is also used in soda-acid fire extinguishers.\nWashing soda\nAnother chemical that can be obtained from sodium chloride is\nNa2CO3.10H2O (washing soda). Y ou have seen above that sodium\ncarbonate can be obtained by heating baking soda; recrystallisation of\nsodium carbonate gives washing soda. It is also a basic salt.\nNa CO H O Na CO H O\nSodium\ncar\nbonate\n2 3 2 2 3 210 10+ → .\n(\n)\n2024-25\n\n--- Page 16 ---\nScience32\nWhat does 10H2O signify? Does it make Na2CO3 wet? We will address\nthis question in the next section.\nSodium carbonate and sodium hydrogencarbonate are useful\nchemicals for many industrial processes as well.\nUses of washing soda\n(i) Sodium carbonate (washing soda) is used in glass, soap and\npaper industries.\n(ii) It is used in the manufacture of sodium compounds such as borax.\n(iii) Sodium carbonate can be used as a cleaning agent for domestic\npurposes.\n(iv) It is used for removing permanent hardness of water.\n2.4.4 Are the Crystals of Salts really Dry?\nActivity 2.15Activity 2.15Activity 2.15Activity 2.15Activity 2.15\n/square6Heat a few crystals of copper sulphate\nin a dry boiling tube.\n/square6What is the colour of the copper\nsulphate after heating?\n/square6Do you notice water droplets in the\nboiling tube? Where have these come\nfrom?\n/square6Add 2-3 drops of  water on the sample\nof copper sulphate obtained after\nheating.\n/square6What do you observe? Is the blue\ncolour of copper sulphate restored?\nFigure 2.9Figure 2.9Figure 2.9Figure 2.9Figure 2.9\nRemoving water\nof crystallisation\nCopper sulphate crystals which seem to be dry contain water of\ncrystallisation. When we heat the crystals, this water is removed and the\nsalt turns white.\nIf you moisten the crystals again with water, you will find that blue\ncolour of the crystals reappears.\nWater of crystallisation is the fixed number of water molecules present\nin one formula unit of a salt. Five water molecules are present in one\nformula unit of copper sulphate. Chemical formula for hydrated copper\nsulphate is Cu SO4. 5H2O. Now you would be able to answer the question\nwhether the molecule of Na2CO3.10H2O is wet.\nOne other salt, which possesses water of crystallisation is gypsum.\nIt has two water molecules as water of cyrstallisation. It has the chemical\nformula CaSO4.2H2O. Let us look into the use of this salt.\nPlaster of Paris\nOn heating gypsum at 373 K, it loses water molecules and becomes\ncalcium sulphate hemihydrate (\n4 2\n1CaSO . H O2 ). This is called Plaster of\n2024-25\n\n--- Page 17 ---\nAcids, Bases and Salts 33\nParis, the substance which doctors use as plaster for supporting\nfractured bones in the right position. Plaster of Paris is a white powder\nand on mixing with water , it changes to gypsum once again giving a\nhard solid mass.\nCaSO . 1\n2 H O +1 1\n2 H O CaSO .2H O4 2 2 4 2\n(Plaster of Paris) Gyps um)\n→\n(\nNote that only half a water molecule is shown to be attached as water\nof crystallisation. How can you get half a water molecule? It is written in\nthis form because two formula units of CaSO 4 share one molecule of\nwater. Plaster of Paris is used for making toys, materials for decoration\nand for making surfaces smooth. Try to find out why is calcium sulphate\nhemihydrate called ‘Plaster of Paris’ ?"
    },
    {
      "id": "085225f5-0e45-46e4-82d0-22d235fc484e",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 16,
      "title": "2. Name the substance which on treatment with chlorine yields bleaching",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "powder."
    },
    {
      "id": "bfa39f38-aacf-42e4-9428-c9a5d90370f6",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 18,
      "title": "4. What will happen if a solution of sodium hydrocarbonate is heated?",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "Give the equation of the reaction involved."
    },
    {
      "id": "74873dd2-00b2-400b-b6d0-accdd06dc99b",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 19,
      "title": "5. Write an equation to show the r eaction between Plaster of Paris and",
      "topics": [],
      "start_page": 15,
      "end_page": 16,
      "content": "water.\nQUESTIONS\n?\nWhat you have learnt\n/square6Acid-base indicators are dyes or mixtures of dyes which are used to indicate the\npresence of acids and bases.\n/square6Acidic nature of a substance is due to the formation of H +(aq) ions in solution.\nFormation of OH –(aq) ions in solution is responsible for the basic nature of a\nsubstance.\n/square6When an acid reacts with a metal, hydrogen gas is evolved and a corresponding\nsalt is formed.\n/square6When a base reacts with a metal, along with the evolution of hydrogen gas a salt is\nformed which has a negative ion composed of the metal and oxygen.\n/square6When an acid reacts with a metal carbonate or metal hydrogencarbonate, it gives\nthe corresponding salt, carbon dioxide gas and water.\n/square6Acidic and basic solutions in water conduct electricity because they produce\nhydrogen and hydroxide ions respectively.\n2024-25\n\n--- Page 18 ---\nScience34\n/square6The strength of an acid or an alkali can be tested by using a scale called the pH\nscale (0-14) which gives the measure of hydrogen ion concentration in a solution.\n/square6A neutral solution has a pH of exactly 7, while an acidic solution has a pH less\nthan 7 and a basic solution a pH more than 7.\n/square6Living beings carry out their metabolic activities within an optimal pH range.\n/square6Mixing concentrated acids or bases with water is a highly exothermic process.\n/square6Acids and bases neutralise each other to form corresponding salts and water.\n/square6Water of crystallisation is the fixed number of water molecules present in one formula\nunit of a salt.\n/square6Salts have various uses in everyday life and in industries.\nEXERCISES"
    },
    {
      "id": "b4ca88fc-f975-40d6-8f8b-7fc6f79ba575",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 20,
      "title": "1.  A solution turns red litmus blue, its pH is likely to be",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "(a) 1 (b) 4 (c) 5 (d) 10"
    },
    {
      "id": "5f7c3bf4-47aa-4b76-8b8d-ad5bdd52ad81",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 21,
      "title": "2. A solution reacts with crushed egg-shells to give a gas that turns lime-water milky.",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "The solution contains\n(a) NaCl (b) HCl (c) LiCl (d) KCl\n3. 10 mL of a solution of NaOH is found to be completely neutralised by 8 mL of a\ngiven solution of HCl. If we take 20 mL of the same solution of NaOH, the amount\nHCl solution (the same solution as before) required to neutralise it will be\n(a) 4 mL (b) 8 mL (c) 12 mL (d) 16 mL"
    },
    {
      "id": "0f6efadc-450c-4e03-82ba-a37a71ab0862",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 22,
      "title": "4. Which one of the following types of medicines is used for treating indigestion?",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "(a) Antibiotic\n(b) Analgesic\n(c) Antacid\n(d) Antiseptic"
    },
    {
      "id": "45ff3bf7-adf3-4a1c-a2de-640a4c464f37",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 23,
      "title": "5. Write wor d equations and then balanced equations for the reaction taking",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "place when –\n(a) dilute sulphuric acid reacts with zinc granules.\n(b) dilute hydrochloric acid reacts with magnesium ribbon.\n(c) dilute sulphuric acid reacts with aluminium powder.\n(d) dilute hydrochloric acid reacts with iron filings."
    },
    {
      "id": "5a9656d3-f78a-4021-ab30-2d3ba5d08135",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 24,
      "title": "6. Compounds such as alcohols and glucose also contain hydrogen but are not",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "categorised as acids. Describe an Activity to prove it."
    },
    {
      "id": "6e16a778-5edf-4af3-8844-8bbc1847803d",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 25,
      "title": "7. Why does distilled water not conduct electricity, whereas rain water does?",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "2024-25\n\n--- Page 19 ---\nAcids, Bases and Salts 35"
    },
    {
      "id": "8129da9b-8f34-4f51-97f8-4e4f3b1765b8",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 27,
      "title": "9. Five solutions A,B,C,D and E when tested with universal indicator showed pH as",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "4,1,11,7 and 9, respectively. Which solution is\n(a) neutral?\n(b) strongly alkaline?\n(c) strongly acidic?\n(d) weakly acidic?\n(e) weakly alkaline?\nArrange the pH in increasing order of hydrogen-ion concentration."
    },
    {
      "id": "1c6ce39b-f725-4617-ad41-ad8c88e4d3cf",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 28,
      "title": "10. Equal lengths of magnesium ribbons are taken in test tubes A and B. Hydrochloric",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "acid (HCl) is added to test tube A, while acetic acid (CH3COOH) is added to test\ntube B. Amount and concentration taken for both the acids are same. In which test\ntube will the fizzing occur more vigorously and why?"
    },
    {
      "id": "4c91688d-cf6d-4800-b953-9195e57f3919",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 29,
      "title": "11. Fresh milk has a pH of 6. How do you think the pH will change as it turns into",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "curd? Explain your answer."
    },
    {
      "id": "b983bf98-ff75-41ca-bcfd-4ac9b087feaa",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 30,
      "title": "12. A milkman adds a very small amount of baking soda to fresh milk.",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "(a) Why does he shift the pH of the fresh milk from 6 to slightly alkaline?\n(b) Why does this milk take a long time to set as curd?"
    },
    {
      "id": "41eb4116-b143-4484-a281-e29c647783e4",
      "textbook_id": "78f90cbb-f352-40df-b31a-3044e20e2e11",
      "chapter_number": 33,
      "title": "15. Give two important uses of  washing soda and baking soda.",
      "topics": [],
      "start_page": 17,
      "end_page": 17,
      "content": "(I) Prepare your own indicator\n/square6Crush beetroot in a mortar.\n/square6Add sufficient water to obtain the extract.\n/square6Filter the extract by the procedure learnt by you in earlier classes.\n/square6Collect the filtrate to test the substances you may have tasted earlier.\n/square6Arrange four test tubes in a test tube stand and label them as A,B,C and D. Pour\n2 mL each of lemon juice solution, soda-water, vinegar and baking soda solution\nin them respectively.\n/square6Put 2-3 drops of the beetroot extract in each test tube and note the colour change\nif any. Write your observation in a Table.\n/square6You can prepare indicators by using other natural materials like extracts of red\ncabbage leaves, coloured petals of some flowers such as Petunia, Hydrangea and\nGeranium.\nGroup  Activity\n2024-25\n\n--- Page 20 ---\nScience36\n(II) Preparing a soda-acid fire extinguisher\nThe reaction of acids with metal hydrogencarbonates is used in the fire extinguishers\nwhich produce carbon dioxide.\n/square6Take 20 mL of sodium hydrogencarbonate (NaHCO3) solution in a wash-bottle.\n/square6Suspend an ignition tube containing dilute sulphuric acid in the wash-bottle\n(Fig. 2.10).\n/square6Close the mouth of the wash-bottle.\n/square6Tilt the wash-bottle so that the acid from the ignition tube mixes with the sodium\nhydrogencarbonate solution below.\n/square6You will notice discharge coming out of the nozzle.\n/square6Direct this discharge on a burning candle. What happens?\nFigure 2.10Figure 2.10Figure 2.10Figure 2.10Figure 2.10 (a) Ignition tube containing dilute sulphuric acid suspended in a wash-bottle containing\nsodium hydrogencarbonate, (b) Discharge coming out of the nozzle\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "15d9b979-0389-4ba9-87a1-3dcd69ae984f",
      "chapter_id": "8a485c43-c6da-40f5-bf50-af6066639230",
      "chunk_index": 0,
      "content": "distilled water and the other two contain an acidic solution and a basic\nsolution, r espectively. If you ar e given only r ed litmus paper , how will\nyou identify the contents of each test tube?\n/square6Collect the following solutions from the science laboratory–\nhydrochloric acid (HCl),  sulphuric acid (H2SO4), nitric acid (HNO3),\nacetic acid (CH 3COOH), sodium hydroxide (NaOH), calcium\nhydroxide [Ca(OH) 2], potassium hydroxide (KOH), magnesium\nhydroxide [Mg(OH)2], and ammonium hydroxide (NH 4OH).\n/square6Put a drop of each of the above solutions on a watch-glass one by\none and test with a drop of the indicators shown in Table 2.1.\n/square6What change in colour did you observe with red litmus, blue litmus,\nphenolphthalein and methyl orange solutions for each of the\nsolutions taken?\n/square6Tabulate your observations in Table 2.1.\nTable 2.1\nSample Red Blue Phenolph- Methyl\nsolution litmus litmus -thalein      orange\nsolution solution solution solution\nActivity 2.2Activity 2.2Activity 2.2Activity 2.2Activity 2.2\n/square6Take some finely chopped onions in a plastic bag along with some\nstrips of clean cloth. T ie up the bag tightly and leave over night in\nthe fridge. The cloth strips can now be used to test for acids and\nbases.\n/square6Take two of these cloth strips and check their odour .\n/square6Keep them on a clean surface and put a few drops of dilute HCl\nsolution on one strip and a few drops of dilute NaOH solution on\nthe other.\n2024-25",
      "content_type": "text",
      "token_count": 365,
      "page_number": 1
    },
    {
      "id": "b15525db-89ba-4916-8953-f715401c3f8e",
      "chapter_id": "8a485c43-c6da-40f5-bf50-af6066639230",
      "chunk_index": 1,
      "content": "--- Page 3 ---\nAcids, Bases and Salts 19\nWhich of these – vanilla, onion and clove, can be used as olfactory\nindicators on the basis of your observations?\nLet us do some more activities to understand the chemical properties\nof acids and bases.\n2.1.2 How do Acids and Bases React with Metals?\n/square6Rinse both cloth strips with water and again check their odour .\n/square6Note your observations.\n/square6Now take some dilute vanilla essence and clove oil and check their\nodour.\n/square6Take some dilute HCl solution in one test tube and dilute NaOH\nsolution in another . Add a few dr ops of dilute vanilla essence to\nboth test tubes and shake well. Check the odour once again and\nrecord changes in odour , if any.\n/square6Similarly, test the change in the odour of clove oil with dilute HCl\nand dilute NaOH solutions and record your observations.\nActivity 2.3Activity 2.3Activity 2.3Activity 2.3Activity 2.3\nCAUTION: This activity needs the teacher’s assistance.\n/square6Set the apparatus as shown in Fig. 2.1.\n/square6Take about 5 mL of dilute sulphuric acid in a test tube and add a\nfew pieces of zinc granules to it.\n/square6What do you observe on the surface of zinc granules?\n/square6Pass the gas being evolved through the soap solution.\n/square6Why are bubbles  formed in the soap solution?\n/square6Take a burning candle near a gas filled bubble.\n/square6What do you observe?\n/square6Repeat this Activity with some more acids like HCl, HNO 3 and\nCH3COOH.\n/square6Are the observations in all the cases the same or different?\nFigure 2.1Figure 2.1Figure 2.1Figure 2.1Figure 2.1 Reaction of zinc granules with dilute sulphuric acid and testing hydrogen\ngas by burning\n2024-25",
      "content_type": "text",
      "token_count": 419,
      "page_number": 1
    },
    {
      "id": "e6187b3c-b7d5-4671-a0e3-e363b3461c7a",
      "chapter_id": "8a485c43-c6da-40f5-bf50-af6066639230",
      "chunk_index": 2,
      "content": "--- Page 4 ---\nScience20\n Note that the metal in the above reactions displaces hydrogen atoms\nfrom the acids as hydrogen gas and forms a compound called a salt.\nThus, the reaction of a metal with an acid can be summarised as –\nAcid + Metal →  Salt + Hydrogen gas\nCan you now write the equations for the reactions you have observed?\nActivity 2.4Activity 2.4Activity 2.4Activity 2.4Activity 2.4\nThe reactions occurring in the above Activity are written as –\nTest tube A: Na CO HCl(aq) Cl(aq) H O(l) + CO2 3 2 2(s) N a (g)+ → +2 2\nTest tube B: NaHCO HCl(aq) Cl(aq) H O(l) + CO3 2 2(s) Na (g)+ → +\nOn passing the carbon dioxide gas evolved through lime water,\nCa(OH) CO H O(l)2 2 2(aq) (g) CaCO s 3+ → +( )\n(Lime water) (White precipitate)\n/square6Place a few pieces of granulated zinc metal in a test tube.\n/square6Add 2 mL of sodium hydroxide solution and warm the contents\nof the test tube.\n/square6Repeat the rest of the steps as in Activity 2.3 and record your\nobservations.\nThe reaction that takes place can be written as follows.\n2NaOH(aq) + Zn(s) →  Na2ZnO2(s) + H2(g)\n      (Sodium zincate)\nYou find again that hydr ogen is formed in the reaction. However,\nsuch reactions are not possible with all metals.\n2.1.3 How do Metal Carbonates and Metal\nHydrogencarbonates React with Acids?\nActivity 2.5Activity 2.5Activity 2.5Activity 2.5Activity 2.5\n/square6Take two test tubes, label them as A\nand B.\n/square6Take about 0.5 g of sodium carbonate\n(Na2CO3) in test tube A and about\n0.5 g of sodium hydrogencarbonate\n(NaHCO3) in test tube B.\n/square6Add about 2 mL of dilute HCl to both\nthe test tubes.\n/square6What do you observe?\n/square6Pass the gas produced in each case\nthrough lime water (calcium\nhydroxide solution) as shown in\nFig. 2.2 and record your observations.\nFigure 2.2Figure 2.2Figure 2.2Figure 2.2Figure 2.2\nPassing carbon dioxide gas\nthrough calcium hydroxide\nsolution\n2024-25",
      "content_type": "text",
      "token_count": 472,
      "page_number": 1
    },
    {
      "id": "0f67c411-4f27-4858-a525-79c85e15e1c4",
      "chapter_id": "8a485c43-c6da-40f5-bf50-af6066639230",
      "chunk_index": 3,
      "content": "--- Page 5 ---\nAcids, Bases and Salts 21\nActivity 2.6Activity 2.6Activity 2.6Activity 2.6Activity 2.6\n/square6Take about 2 mL of dilute NaOH solution in a test tube and add\ntwo drops of phenolphthalein solution.\n/square6What is the colour of the solution?\n/square6Add dilute HCl solution to the above solution drop by drop.\n/square6Is there any colour change for the reaction mixture?\n/square6Why did the colour of phenolphthalein change after the addition\nof an acid?\n/square6Now add a few drops of NaOH to the above mixture.\n/square6Does the pink colour of phenolphthalein reappear?\n/square6Why do you think this has happened?\nOn passing excess carbon dioxide the following reaction takes place:\nCaCO s Ca(HCO aq3 3( ) ) ( )+ →H O(l)+ CO (g) 2 2 2\n(Soluble in water)\nLimestone, chalk and marble are different forms of calcium carbonate.\nAll metal carbonates and hydrogencarbonates react with acids to give a\ncorresponding salt, carbon dioxide and water.\nThus, the reaction can be summarised as –\nIn the above Activity, we have observed that the effect of a base is\nnullified by an acid and vice-versa. The reaction taking place is written as –\nNaOH(aq) + HCl(aq) →  NaCl(aq) + H2O(l)\nThe reaction between an acid and a base to give a salt and water is\nknown as a neutralisation reaction. In general, a neutralisation reaction\ncan be written as –\nBase + Acid →  Salt + Water\n2.1.5 Reaction of Metallic Oxides with Acids\nActivity 2.7Activity 2.7Activity 2.7Activity 2.7Activity 2.7\n/square6Take a small amount of copper oxide in a beaker and add dilute\nhydrochloric acid slowly while stirring.\n/square6Note the colour of the solution. What has happened to the copper\noxide?\nYou will notice that the colour of the solution becomes blue-green\nand the copper oxide dissolves. The blue-green colour of the solution is\ndue to the formation of copper(II) chloride in the reaction. The general\nreaction between a metal oxide and an acid can be written as –\nMetal oxide + Acid →  Salt + Water\nMetal carbonate/Metal hydrogencarbonate + Acid →  Salt + Carbon dioxide + Water\n2.1.4 How do Acids and Bases React with each other?\n2024-25\n\n--- Page 6 ---\nScience22\nNow write and balance the equation for the above reaction. Since\nmetallic oxides react with acids to give salts and water, similar to the\nreaction of a base with an acid, metallic oxides are said to be basic oxides.\n2.1.6 Reaction of a Non-metallic Oxide with Base\nYou saw the reaction between carbon dioxide and calcium hydroxide\n(lime water) in Activity 2.5. Calcium hydroxide, which is a base, reacts\nwith carbon dioxide to produce a salt and water. Since this is similar to\nthe reaction between a base and an acid, we can conclude that non-\nmetallic oxides are acidic in nature.\nQUESTIONS\n?",
      "content_type": "exercise",
      "token_count": 686,
      "page_number": 5
    },
    {
      "id": "f48ba6e8-7a57-49d2-b767-6c2c6859a174",
      "chapter_id": "3ff69711-79ad-4921-b926-9e9ebff03fe1",
      "chunk_index": 0,
      "content": "vessels?",
      "content_type": "text",
      "token_count": 2,
      "page_number": 5
    },
    {
      "id": "2cc3b861-86fa-4cf2-b863-a1c4b8a196b6",
      "chapter_id": "f9161e58-9013-44e6-a79c-079c8b30aa15",
      "chunk_index": 0,
      "content": "Illustrate with an example. How will you test for the presence of\nthis gas?",
      "content_type": "example",
      "token_count": 18,
      "page_number": 5
    },
    {
      "id": "39952c26-5094-4fed-8a57-7f4ed258c2da",
      "chapter_id": "34bad1f7-1582-4dc1-a724-278a20689c0b",
      "chunk_index": 0,
      "content": "effervescence. The gas evolved extinguishes a bur ning candle. W rite a\nbalanced chemical equation for the reaction if one of the compounds\nformed is calcium chloride.\n2.2 WHA2.2 WHA2.2 WHA2.2 WHA2.2 WHA T DO ALL ACIDS AND ALL BASES HAT DO ALL ACIDS AND ALL BASES HAT DO ALL ACIDS AND ALL BASES HAT DO ALL ACIDS AND ALL BASES HAT DO ALL ACIDS AND ALL BASES HA VE IN\nVE INVE IN VE INVE IN\nCOMMON?COMMON?COMMON?COMMON?COMMON?\nIn Section 2.1 we have seen that all acids have similar chemical\nproperties. What leads to this similarity in properties? We saw in Activity\n2.3 that all acids generate hydrogen gas on reacting with metals, so\nhydrogen seems to be common to all acids. Let us perform an Activity to\ninvestigate whether all compounds containing hydrogen are acidic.\nActivity 2.8Activity 2.8Activity 2.8Activity 2.8Activity 2.8\n/square6Take solutions of glucose, alcohol,\nhydrochloric acid, sulphuric acid, etc.\n/square6Fix two nails on a cork, and place the cork in\na 100 mL beaker .\n/square6Connect the nails to the two terminals of a\n6 volt battery through a bulb and a switch, as\nshown in Fig. 2.3.\n/square6Now pour some dilute HCl in the beaker and\nswitch on the current.\n/square6Repeat with dilute sulphuric acid.\n/square6What do you observe?\n/square6Repeat the experiment separately with\nglucose and alcohol solutions. What do you\nobserve now?\n/square6Does the bulb glow in all cases?\nFigure 2.3Figure 2.3Figure 2.3Figure 2.3Figure 2.3\nAcid solution in water\nconducts electricity\n2024-25",
      "content_type": "text",
      "token_count": 374,
      "page_number": 5
    },
    {
      "id": "4995835b-d492-4e4f-92a0-5eedaf1c8061",
      "chapter_id": "34bad1f7-1582-4dc1-a724-278a20689c0b",
      "chunk_index": 1,
      "content": "--- Page 7 ---\nAcids, Bases and Salts 23\nThe bulb will start glowing in the case of acids, as shown in Fig. 2.3.\nBut you will observe that glucose and alcohol solutions do not conduct\nelectricity. Glowing of the bulb indicates that there is a flow of electric\ncurrent through the solution. The electric current is carried through the\nacidic solution by ions.\nAcids contain H+ ion as cation and anion such as Cl–  in HCl, N\nO3\n–  in\nHNO3, SO2–\n4\n in H2SO4, CH3COO– in CH3COOH. Since the cation present in\nacids is H+, this suggests that acids produce hydrogen ions, H+(aq), in\nsolution, which are responsible for their acidic properties.\nRepeat the same Activity using alkalis such as sodium hydroxide, calcium\nhydroxide, etc. What can you conclude from the results of this Activity?\n2.2.1 What Happens to an Acid or a Base in a Water Solution?\nDo acids produce ions only in aqueous solution? Let us test this.\nActivity 2.9Activity 2.9Activity 2.9Activity 2.9Activity 2.9\n/square6Take about 1g solid NaCl in a clean and\ndry test tube and set up the apparatus as\nshown in Fig. 2.4.\n/square6Add some concentrated sulphuric acid to\nthe test tube.\n/square6What do you observe? Is there a gas coming\nout of the delivery tube?\n/square6Test the gas evolved successively with dry\nand wet blue litmus paper .\n/square6In which case does the litmus paper change\ncolour?\n/square6On the basis of the above Activity, what do\nyou infer about the acidic character of:\n(i) dry HCl gas\n(ii) HCl solution?\nFigure 2.4 Figure 2.4 Figure 2.4 Figure 2.4 Figure 2.4 Preparation of HCl gas\nThis experiment suggests that hydrogen ions in HCl are produced\nin the presence of water. The separation of H+ ion from HCl molecules\ncannot occur in the absence of water.\nHCl + H2O →  H3O+ + Cl–\nHydrogen ions cannot exist alone, but they exist after combining\nwith water molecules. Thus hydrogen ions must always be shown as\nH+(aq) or hydronium ion (H3O+).\nH+ + H2O →  H3O+\nWe have seen that acids give H3O+ or H+(aq) ion in water. Let us see\nwhat happens when a base is dissolved in water.\nNaOH(s) H O2 →    Na+ (aq) + OH– (aq)\nNote to teachers: If the climate is very humid, you will have to pass the gas produced\nthrough a guard tube (drying tube) containing calcium chloride to dry the gas.\n2024-25",
      "content_type": "exercise",
      "token_count": 567,
      "page_number": 5
    },
    {
      "id": "e782014b-38e6-4683-b9ec-7954d8fce11f",
      "chapter_id": "34bad1f7-1582-4dc1-a724-278a20689c0b",
      "chunk_index": 2,
      "content": "--- Page 8 ---\nScience24\nKOH(s) K (aq)+OH (aq)H O2 + →  –\nMg(OH)2(s) H O2 →   Mg2+(aq)+2OH– (aq)\nBases generate hydroxide (OH– ) ions in water. Bases which are soluble\nin water are called alkalis.\nDo You\nKnow?\nAll bases do not dissolve in water. An alkali is a base that dissolves in water. They\nare soapy to touch, bitter and corrosive. Never taste or touch them as they may\ncause harm. Which of the bases in the Table 2.1 are alkalis?\nNow as we have identified that all acids generate H +(aq) and all\nbases generate OH\n–\n(aq), we can view the neutralisation reaction as\nfollows –\nAcid + Base → Salt + Water\nH  X + M  OH →  MX + HOH\nH+(aq) + OH\n–\n (aq) →  H2O(l)\nLet us see what is involved when water is mixed with an acid or a base.\nActivity 2.10Activity 2.10Activity 2.10Activity 2.10Activity 2.10\n/square6Take 10 mL water in a beaker .\n/square6Add a few drops of concentrated H 2SO4 to it and swirl the\nbeaker slowly.\n/square6Touch the base of the beaker .\n/square6Is there a change in temperature?\n/square6Is this an exothermic or endothermic process?\n/square6Repeat the above Activity with sodium hydroxide pellets\nand record your observations.Figure 2.5Figure 2.5Figure 2.5Figure 2.5Figure 2.5\nWarning sign displayed\non containers containing\nconcentrated acids and\nbases The process of dissolving an acid or a base in water is a highly\nexothermic one. Care must be taken while mixing concentrated nitric\nacid or sulphuric acid with water. The acid must always be added slowly\nto water with constant stirring. If water is added to a concentrated acid,\nthe heat generated may cause the mixture to splash out and cause burns.\nThe glass container may also break due to excessive local heating. Look\nout for the warning sign (shown in Fig. 2.5) on the can of concentrated\nsulphuric acid and on the bottle of sodium hydroxide pellets.\nMixing an acid or base with water results in decrease in the\nconcentration of ions (H3O+/OH– ) per unit volume. Such a process is\ncalled dilution and the acid or the base is said to be diluted.\n2024-25",
      "content_type": "exercise",
      "token_count": 511,
      "page_number": 5
    },
    {
      "id": "e2bffbce-642c-4ae1-b6a0-bee392f4756d",
      "chapter_id": "34bad1f7-1582-4dc1-a724-278a20689c0b",
      "chunk_index": 3,
      "content": "--- Page 9 ---\nAcids, Bases and Salts 25\n2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?2.3 HOW STRONG ARE ACID OR BASE SOLUTIONS?\nWe know how acid-base indicators can be used to distinguish between\nan acid and a base. We have also learnt in the previous section about\ndilution and decrease in concentration of H+ or OH–  ions in solutions.\nCan we quantitatively find the amount of these ions present in a solution?\nCan we judge how strong a given acid or base is?\nWe can do this by making use of a universal indicator, which is a\nmixture of several indicators. The universal indicator shows different\ncolours at different concentrations of hydrogen ions in a solution.\nA scale for measuring hydrogen ion concentration in a solution, called\npH scale has been developed. The p in pH stands for ‘potenz’ in German,\nmeaning power. On the pH scale we can measur e pH generally from\n0 (very acidic) to 14 (very alkaline). pH should be thought of simply as a\nnumber which indicates the acidic or basic nature of a solution. Higher\nthe hydronium ion concentration, lower is the pH value.\nThe pH of a neutral solution is 7. Values less than 7 on the pH scale\nrepresent an acidic solution. As the pH value increases from 7 to 14, it\nrepresents an increase in OH–  ion concentration in the solution, that is,\nincrease in the strength of alkali (Fig. 2.6). Generally paper impregnated\nwith the universal indicator is used for measuring pH.\nQUESTIONS\n?",
      "content_type": "exercise",
      "token_count": 390,
      "page_number": 8
    },
    {
      "id": "d8b9d0e6-0645-4ce4-b91b-f4a006b54f1e",
      "chapter_id": "7bbb1527-ad81-45c2-bec2-61b546d26b4a",
      "chunk_index": 0,
      "content": "while solutions of compounds like alcohol and glucose do not show acidic\ncharacter?",
      "content_type": "text",
      "token_count": 20,
      "page_number": 8
    },
    {
      "id": "5ee502d5-2cd6-4dc6-8a2c-7bc0169425e1",
      "chapter_id": "0cf2577b-9ad1-4552-9695-006aa95cd1c6",
      "chunk_index": 0,
      "content": "added to water and not water to the acid?",
      "content_type": "text",
      "token_count": 10,
      "page_number": 8
    },
    {
      "id": "2e95b82b-be6a-42be-a814-2e2c49668ddd",
      "chapter_id": "7be857c4-e327-4e99-82b3-3f14ec5b1a9f",
      "chunk_index": 0,
      "content": "solution of an acid is diluted?",
      "content_type": "text",
      "token_count": 7,
      "page_number": 8
    },
    {
      "id": "9f624798-563a-45fa-8fb8-a078b5b87f72",
      "chapter_id": "d1c87e5a-0a13-44c6-a903-c36ec30da35b",
      "chunk_index": 0,
      "content": "–\n) affected when excess\nbase is dissolved in a solution of sodium hydroxide?\nFigure 2.6Figure 2.6Figure 2.6Figure 2.6Figure 2.6  Variation of pH with the change in concentration of  H+(aq) and OH– (aq) ions\n2024-25\n\n--- Page 10 ---\nScience26\nActivity 2.11Activity 2.11Activity 2.11Activity 2.11Activity 2.11\n/square6Test the pH values\nof solutions given in\nTable 2.2.\n/square6Record your observations.\n/square6What is the nature of each\nsubstance on the basis of\nyour observations?\nFigure 2.7 Figure 2.7 Figure 2.7 Figure 2.7 Figure 2.7 pH of some common substances shown on a pH paper (colours are only a rough guide)\nThe strength of acids and bases depends on the number of H+ ions\nand OH– ions produced, respectively. If we take hydrochloric acid and\nacetic acid of the same concentration, say one molar, then these produce\ndifferent amounts of hydrogen ions. Acids that give rise to more H+ ions\nare said to be strong acids, and acids that give less H+ ions are said to be\nweak acids. Can you now say what weak and strong bases are?\n2.3.1 Impor2.3.1 Impor2.3.1 Impor2.3.1 Impor2.3.1 Impor tance of pH in Evertance of pH in Evertance of pH in Evertance of pH in Evertance of pH in Ever yday Life yday Lifeyday Lifeyday Lifeyday Life\nAre plants and animals pH sensitive?\nOur body works within the pH range of 7.0 to 7.8. Living organisms can\nsurvive only in a narrow range of pH change. When pH of rain water is\nless than 5.6, it is called acid rain. When acid rain flows into the rivers, it\nlowers the pH of the river water. The survival of aquatic life in such rivers\nbecomes difficult.\nTable 2.2\n S. Solution Colour of Approx- Nature of\nNo. pH paper -imate substance\npH value\n1 Saliva (before meal)\n2 Saliva (after meal)\n3 Lemon juice\n4 Colourless aerated\ndrink\n5 Carrot juice\n6 Coffee\n7 Tomato juice\n8 Tap water\n9 1M NaOH\n10 1M HCl\n2024-25",
      "content_type": "exercise",
      "token_count": 461,
      "page_number": 8
    },
    {
      "id": "45476dd2-6993-4605-9860-48173fed1864",
      "chapter_id": "d1c87e5a-0a13-44c6-a903-c36ec30da35b",
      "chunk_index": 1,
      "content": "--- Page 11 ---\nAcids, Bases and Salts 27\nWhat is the pH of the soil in your backyard?\nPlants require a specific pH range for their healthy growth. To find out\nthe pH required for the healthy growth of a plant, you can collect the soil\nfrom various places and check the pH in the manner described below in\nActivity 2.12. Also, you can note down which plants are growing in the\nregion from which you have collected the soil.\nAcids in other planets\nThe atmosphere of venus is made up of thick white and yellowish clouds of\nsulphuric acid. Do you think life can exist on this planet?\nActivity 2.12Activity 2.12Activity 2.12Activity 2.12Activity 2.12\n/square6Put about 2 g soil in a test tube and add 5 mL water to it.\n/square6Shake the contents of the test tube.\n/square6Filter the contents and collect the filtrate in a test tube.\n/square6Check the pH of this filtrate with the help of universal\nindicator paper .\n/square6What can you conclude about the ideal soil pH for the growth of\nplants in your region?\npH in our digestive system\nIt is very interesting to note that our stomach produces hydrochloric\nacid. It helps in the digestion of food without harming the stomach.\nDuring indigestion the stomach produces too much acid and this causes\npain and irritation. To get rid of this pain, people use bases called\nantacids. One such remedy must have been suggested by you at the\nbeginning of this Chapter. These antacids neutralise the excess acid.\nMagnesium hydroxide (Milk of magnesia), a mild base, is often used for\nthis purpose.\npH change as the cause of tooth decay\nTooth decay starts when the pH of the mouth is lower than 5.5. Tooth\nenamel, made up of calcium hydroxyapatite (a crystalline form of calcium\nphosphate) is the hardest substance in the body. It does not dissolve in\nwater, but is corroded when the pH in the mouth is below 5.5. Bacteria\npresent in the mouth produce acids by degradation of sugar and food\nparticles remaining in the mouth after eating. The best way to prevent\nthis is to clean the mouth after eating food. Using toothpastes, which are\ngenerally basic, for cleaning the teeth can neutralise the excess acid and\nprevent tooth decay.\nSelf defence by animals and plants through chemical warfare\nHave you ever been stung by a honey-bee? Bee-sting leaves an acid\nwhich  causes pain and irritation. Use of a mild base like baking soda\non the stung area gives relief. Stinging hair of nettle leaves inject\nmethanoic acid causing burning pain.\nDo You\nKnow?\n2024-25",
      "content_type": "exercise",
      "token_count": 622,
      "page_number": 8
    },
    {
      "id": "e54564e5-5467-4d21-ab07-04f923ba3b9e",
      "chapter_id": "d1c87e5a-0a13-44c6-a903-c36ec30da35b",
      "chunk_index": 2,
      "content": "--- Page 12 ---\nScience28\n2.4 MORE ABOUT SAL2.4 MORE ABOUT SAL2.4 MORE ABOUT SAL2.4 MORE ABOUT SAL2.4 MORE ABOUT SAL TS TSTSTSTS\nIn the previous sections we have seen the formation of salts during\nvarious reactions. Let us understand more about their preparation,\nproperties and uses.\n2.4.1 Family of Salts\nActivity 2.13Activity 2.13Activity 2.13Activity 2.13Activity 2.13\n/square6Write the chemical for mulae of the salts given below.\nPotassium sulphate, sodium sulphate, calcium sulphate,\nmagnesium sulphate, copper sulphate, sodium chloride, sodium\nnitrate, sodium carbonate and ammonium chloride.\nNature provides neutralisation options\nNettle is a herbaceous plant which grows in the wild. Its leaves have stinging hair,\nwhich cause painful stings when touched accidentally. This is due to the methanoic\nacid secreted by them. A traditional remedy is rubbing the\narea with the leaf of the dock plant, which often grows beside\nthe nettle in the wild. Can you guess the nature of the dock\nplant? So next time you know what to look out for if you\naccidentally touch a nettle plant while trekking. Are you aware\nof any other effective traditional remedies for such stings?\nTable 2.3 Some naturally occurring acids\nNatural source Acid Natural source Acid\nVinegar Acetic acid Sour milk (Curd) Lactic acid\nOrange Citric acid Lemon Citric acid\nTamarind Tartaric acid Ant sting Methanoic acid\nTomato Oxalic acid Nettle sting Methanoic acid\nQUESTIONS",
      "content_type": "exercise",
      "token_count": 361,
      "page_number": 11
    },
    {
      "id": "6d55c73c-9334-4979-9720-10dc73814812",
      "chapter_id": "16baa7f1-ac74-4e9b-98a0-bb34e36ea618",
      "chunk_index": 0,
      "content": "solution B is 8. Which solution has more hydrogen ion concentration?\nWhich of this is acidic and which one is basic?",
      "content_type": "text",
      "token_count": 29,
      "page_number": 11
    },
    {
      "id": "ddc4ee5e-1fd8-4032-be18-1edafc084fae",
      "chapter_id": "2049ebb0-cfab-46e7-a72d-2ef6dd823974",
      "chunk_index": 0,
      "content": "solution?",
      "content_type": "text",
      "token_count": 2,
      "page_number": 11
    },
    {
      "id": "90697633-5370-4d58-90a2-27a5d250400d",
      "chapter_id": "d124ef44-97d0-4c9b-abea-6f15077c927c",
      "chunk_index": 0,
      "content": "fields with quick lime (calcium oxide) or slaked lime (calcium hydroxide) or\nchalk (calcium carbonate)?\n?\nDo You Know?\n2024-25\n\n--- Page 13 ---\nAcids, Bases and Salts 29\n/square6Identify the acids and bases from which the above salts may be\nobtained.\n/square6Salts having the same positive or negative radicals are said to\nbelong to a family.  For example, NaCl and Na 2SO4 belong to the\nfamily of sodium salts.  Similarly, NaCl and KCl belong to the family\nof chloride salts.  How many families can you identify among the\nsalts given in this Activity?\n2.4.2 pH of Salts\nActivity 2.14Activity 2.14Activity 2.14Activity 2.14Activity 2.14\n/square6Collect the following salt samples – sodium chloride, potassium\nnitrate, aluminium chloride, zinc sulphate, copper sulphate,\nsodium acetate, sodium carbonate and sodium hydrogencarbonate\n(some other salts available can also be taken).\n/square6Check their solubility in water (use distilled water only).\n/square6Check the action of these solutions on litmus and find the pH\nusing a pH paper .\n/square6Which of the salts are acidic, basic or neutral?\n/square6Identify the acid or base used to form the salt.\n/square6Report your observations in Table 2.4.\nSalts of a strong acid and a strong base\nare neutral with pH value of 7. On the other\nhand, salts of a strong acid and weak base\nare acidic with pH value less than 7 and those\nof a strong base and weak acid are basic in\nnature, with pH value more than 7.\n2.4.3 Chemicals from Common Salt\nBy now you have learnt that the salt formed\nby the combination of hydrochloric acid and\nsodium hydroxide solution is called sodium\nchloride. This is the salt that you use in food.\nYou must have observed in the above Activity\nthat it is a neutral salt.\nSeawater contains many salts dissolved\nin it. Sodium chloride is separated from these\nsalts. Deposits of solid salt are also found in\nseveral parts of the world. These large crystals\nare often brown due to impurities. This is\ncalled rock salt. Beds of rock salt were formed\nwhen seas of bygone ages dried up. Rock salt\nis mined like coal.\nYou must have heard about Mahatma Gandhi’s Dandi March. Did\nyou know that sodium chloride was such an important symbol in our\nstruggle for freedom?\nTable 2.4\nSalt pH Acid used Base used\n2024-25",
      "content_type": "example",
      "token_count": 567,
      "page_number": 11
    },
    {
      "id": "936065a5-c8c0-4067-84ce-4dd7721afff4",
      "chapter_id": "d124ef44-97d0-4c9b-abea-6f15077c927c",
      "chunk_index": 1,
      "content": "--- Page 14 ---\nScience30\nCommon salt — A raw material for chemicals\nThe common salt thus obtained is an important raw material for various\nmaterials of daily use, such as sodium hydroxide, baking soda, washing\nsoda, bleaching powder and many more. Let us see how one substance\nis used for making all these different substances.\nSodium hydroxide\nWhen electricity is passed through an aqueous solution of sodium\nchloride (called brine), it decomposes to form sodium hydroxide. The\nprocess is called the chlor-alkali process because of the products formed–\nchlor for chlorine and alkali for sodium hydroxide.\n2NaCl(aq) + 2H2O(l) →  2NaOH(aq) + Cl2(g) + H2(g)\nChlorine gas is given off at the anode, and hydrogen gas at the cathode.\nSodium hydroxide solution is formed near the cathode. The three\nproducts produced in this process are all useful. Figure 2.8 shows the\ndifferent uses of these products.\nBleaching powder\nYou have already come to know that chlorine is produced during the\nelectrolysis of aqueous sodium chloride (brine). This chlorine gas is used\nfor the manufacture of bleaching powder. Bleaching powder is produced\nby the action of chlorine on dry slaked lime [Ca(OH)2]. Bleaching powder\nis represented as CaOCl 2, though the actual composition is quite\ncomplex.\nCa(OH)2 + Cl2 →  CaOCl2 + H2O\nFigure 2.8Figure 2.8Figure 2.8Figure 2.8Figure 2.8  Important products from the chlor-alkali process\n2024-25",
      "content_type": "text",
      "token_count": 353,
      "page_number": 11
    },
    {
      "id": "24eb1263-4f81-4812-b0ce-6031a8d7c153",
      "chapter_id": "d124ef44-97d0-4c9b-abea-6f15077c927c",
      "chunk_index": 2,
      "content": "--- Page 15 ---\nAcids, Bases and Salts 31\nBleaching powder is used –\n(i) for bleaching cotton and linen in the textile industry, for bleaching\nwood pulp in paper factories and for bleaching washed clothes\nin laundry;\n(ii) as an oxidising agent in many chemical industries; and\n(iii) to make drinking water free from germs.\nBaking soda\nThe baking soda is commonly used in the kitchen for making tasty crispy\npakoras, etc. Sometimes it is added for faster cooking. The chemical\nname of the compound is sodium hydrogencarbonate (NaHCO 3). It is\nproduced using sodium chloride as one of the raw materials.\nNaCl + H O + CO + NH NH Cl + NaHCO2 2 3 4 3→\n(Ammonium (Sodium\nchloride) hydrogencarbonate)\nDid you check the pH of sodium hydrogencarbonate in Activity 2.14?\nCan you correlate why it can be used to neutralise an acid? It is a mild\nnon-corrosive basic salt. The following reaction takes place when it is\nheated during cooking –\n2NaHCO Na CO + H O+CO3 2 3 2 2\nHeat → \n(Sodium (Sodium\nhydrogencarbonate) carbonate)\nSodium hydrogencarbonate has got various uses in the household.\nUses of Baking soda\n(i) For making baking powder, which is a mixture of baking soda\n(sodium hydrogencarbonate) and a mild edible acid such as\ntartaric acid. When baking powder is heated or mixed in water,\nthe following reaction takes place –\nNaHCO3 + H+      →     CO2 + H2O + Sodium salt of acid\n         (From any acid)\nCarbon dioxide produced during the reaction can cause bread or\ncake to rise making them soft and spongy.\n(ii) Sodium hydrogencarbonate is also an ingredient in antacids.\nBeing alkaline, it neutralises excess acid in the stomach and\nprovides relief.\n(iii) It is also used in soda-acid fire extinguishers.\nWashing soda\nAnother chemical that can be obtained from sodium chloride is\nNa2CO3.10H2O (washing soda). Y ou have seen above that sodium\ncarbonate can be obtained by heating baking soda; recrystallisation of\nsodium carbonate gives washing soda. It is also a basic salt.\nNa CO H O Na CO H O\nSodium\ncar\nbonate\n2 3 2 2 3 210 10+ → .\n(\n)\n2024-25",
      "content_type": "text",
      "token_count": 512,
      "page_number": 11
    },
    {
      "id": "d299e2d8-ab94-4918-9e0d-2a300da0a342",
      "chapter_id": "d124ef44-97d0-4c9b-abea-6f15077c927c",
      "chunk_index": 3,
      "content": "--- Page 16 ---\nScience32\nWhat does 10H2O signify? Does it make Na2CO3 wet? We will address\nthis question in the next section.\nSodium carbonate and sodium hydrogencarbonate are useful\nchemicals for many industrial processes as well.\nUses of washing soda\n(i) Sodium carbonate (washing soda) is used in glass, soap and\npaper industries.\n(ii) It is used in the manufacture of sodium compounds such as borax.\n(iii) Sodium carbonate can be used as a cleaning agent for domestic\npurposes.\n(iv) It is used for removing permanent hardness of water.\n2.4.4 Are the Crystals of Salts really Dry?\nActivity 2.15Activity 2.15Activity 2.15Activity 2.15Activity 2.15\n/square6Heat a few crystals of copper sulphate\nin a dry boiling tube.\n/square6What is the colour of the copper\nsulphate after heating?\n/square6Do you notice water droplets in the\nboiling tube? Where have these come\nfrom?\n/square6Add 2-3 drops of  water on the sample\nof copper sulphate obtained after\nheating.\n/square6What do you observe? Is the blue\ncolour of copper sulphate restored?\nFigure 2.9Figure 2.9Figure 2.9Figure 2.9Figure 2.9\nRemoving water\nof crystallisation\nCopper sulphate crystals which seem to be dry contain water of\ncrystallisation. When we heat the crystals, this water is removed and the\nsalt turns white.\nIf you moisten the crystals again with water, you will find that blue\ncolour of the crystals reappears.\nWater of crystallisation is the fixed number of water molecules present\nin one formula unit of a salt. Five water molecules are present in one\nformula unit of copper sulphate. Chemical formula for hydrated copper\nsulphate is Cu SO4. 5H2O. Now you would be able to answer the question\nwhether the molecule of Na2CO3.10H2O is wet.\nOne other salt, which possesses water of crystallisation is gypsum.\nIt has two water molecules as water of cyrstallisation. It has the chemical\nformula CaSO4.2H2O. Let us look into the use of this salt.\nPlaster of Paris\nOn heating gypsum at 373 K, it loses water molecules and becomes\ncalcium sulphate hemihydrate (\n4 2\n1CaSO . H O2 ). This is called Plaster of\n2024-25\n\n--- Page 17 ---\nAcids, Bases and Salts 33\nParis, the substance which doctors use as plaster for supporting\nfractured bones in the right position. Plaster of Paris is a white powder\nand on mixing with water , it changes to gypsum once again giving a\nhard solid mass.\nCaSO . 1\n2 H O +1 1\n2 H O CaSO .2H O4 2 2 4 2\n(Plaster of Paris) Gyps um)\n→\n(\nNote that only half a water molecule is shown to be attached as water\nof crystallisation. How can you get half a water molecule? It is written in\nthis form because two formula units of CaSO 4 share one molecule of\nwater. Plaster of Paris is used for making toys, materials for decoration\nand for making surfaces smooth. Try to find out why is calcium sulphate\nhemihydrate called ‘Plaster of Paris’ ?",
      "content_type": "exercise",
      "token_count": 706,
      "page_number": 15
    },
    {
      "id": "76581446-96da-4529-acca-4817d349d6ea",
      "chapter_id": "085225f5-0e45-46e4-82d0-22d235fc484e",
      "chunk_index": 0,
      "content": "powder.",
      "content_type": "text",
      "token_count": 1,
      "page_number": 15
    },
    {
      "id": "40de6810-acc4-4340-a8ae-e35cf0a39742",
      "chapter_id": "bfa39f38-aacf-42e4-9428-c9a5d90370f6",
      "chunk_index": 0,
      "content": "Give the equation of the reaction involved.",
      "content_type": "text",
      "token_count": 10,
      "page_number": 15
    },
    {
      "id": "496a7a51-ff1b-4092-abb5-cabd55f6b788",
      "chapter_id": "74873dd2-00b2-400b-b6d0-accdd06dc99b",
      "chunk_index": 0,
      "content": "water.\nQUESTIONS\n?\nWhat you have learnt\n/square6Acid-base indicators are dyes or mixtures of dyes which are used to indicate the\npresence of acids and bases.\n/square6Acidic nature of a substance is due to the formation of H +(aq) ions in solution.\nFormation of OH –(aq) ions in solution is responsible for the basic nature of a\nsubstance.\n/square6When an acid reacts with a metal, hydrogen gas is evolved and a corresponding\nsalt is formed.\n/square6When a base reacts with a metal, along with the evolution of hydrogen gas a salt is\nformed which has a negative ion composed of the metal and oxygen.\n/square6When an acid reacts with a metal carbonate or metal hydrogencarbonate, it gives\nthe corresponding salt, carbon dioxide gas and water.\n/square6Acidic and basic solutions in water conduct electricity because they produce\nhydrogen and hydroxide ions respectively.\n2024-25\n\n--- Page 18 ---\nScience34\n/square6The strength of an acid or an alkali can be tested by using a scale called the pH\nscale (0-14) which gives the measure of hydrogen ion concentration in a solution.\n/square6A neutral solution has a pH of exactly 7, while an acidic solution has a pH less\nthan 7 and a basic solution a pH more than 7.\n/square6Living beings carry out their metabolic activities within an optimal pH range.\n/square6Mixing concentrated acids or bases with water is a highly exothermic process.\n/square6Acids and bases neutralise each other to form corresponding salts and water.\n/square6Water of crystallisation is the fixed number of water molecules present in one formula\nunit of a salt.\n/square6Salts have various uses in everyday life and in industries.\nEXERCISES",
      "content_type": "exercise",
      "token_count": 414,
      "page_number": 16
    },
    {
      "id": "bb34e947-6ee0-4f6f-835d-784b56e4687b",
      "chapter_id": "b4ca88fc-f975-40d6-8f8b-7fc6f79ba575",
      "chunk_index": 0,
      "content": "(a) 1 (b) 4 (c) 5 (d) 10",
      "content_type": "text",
      "token_count": 6,
      "page_number": 16
    },
    {
      "id": "3afdef6b-43f3-458d-9085-3b25caf39f7d",
      "chapter_id": "5f7c3bf4-47aa-4b76-8b8d-ad5bdd52ad81",
      "chunk_index": 0,
      "content": "The solution contains\n(a) NaCl (b) HCl (c) LiCl (d) KCl\n3. 10 mL of a solution of NaOH is found to be completely neutralised by 8 mL of a\ngiven solution of HCl. If we take 20 mL of the same solution of NaOH, the amount\nHCl solution (the same solution as before) required to neutralise it will be\n(a) 4 mL (b) 8 mL (c) 12 mL (d) 16 mL",
      "content_type": "text",
      "token_count": 83,
      "page_number": 16
    },
    {
      "id": "d4900b34-c4a6-4d67-bbf0-e7b8dc8bf71d",
      "chapter_id": "0f6efadc-450c-4e03-82ba-a37a71ab0862",
      "chunk_index": 0,
      "content": "(a) Antibiotic\n(b) Analgesic\n(c) Antacid\n(d) Antiseptic",
      "content_type": "text",
      "token_count": 13,
      "page_number": 16
    },
    {
      "id": "69f79e19-872d-48c3-938c-fad49e547c56",
      "chapter_id": "45ff3bf7-adf3-4a1c-a2de-640a4c464f37",
      "chunk_index": 0,
      "content": "place when –\n(a) dilute sulphuric acid reacts with zinc granules.\n(b) dilute hydrochloric acid reacts with magnesium ribbon.\n(c) dilute sulphuric acid reacts with aluminium powder.\n(d) dilute hydrochloric acid reacts with iron filings.",
      "content_type": "text",
      "token_count": 58,
      "page_number": 16
    },
    {
      "id": "61459384-4e76-4561-a15d-db6c478dab23",
      "chapter_id": "5a9656d3-f78a-4021-ab30-2d3ba5d08135",
      "chunk_index": 0,
      "content": "categorised as acids. Describe an Activity to prove it.",
      "content_type": "text",
      "token_count": 13,
      "page_number": 16
    },
    {
      "id": "2b86749c-a226-4a3d-bf58-3cfef2824894",
      "chapter_id": "6e16a778-5edf-4af3-8844-8bbc1847803d",
      "chunk_index": 0,
      "content": "2024-25\n\n--- Page 19 ---\nAcids, Bases and Salts 35",
      "content_type": "text",
      "token_count": 12,
      "page_number": 16
    },
    {
      "id": "2d01fa25-0243-4852-8fe3-c93748d95a55",
      "chapter_id": "8129da9b-8f34-4f51-97f8-4e4f3b1765b8",
      "chunk_index": 0,
      "content": "4,1,11,7 and 9, respectively. Which solution is\n(a) neutral?\n(b) strongly alkaline?\n(c) strongly acidic?\n(d) weakly acidic?\n(e) weakly alkaline?\nArrange the pH in increasing order of hydrogen-ion concentration.",
      "content_type": "text",
      "token_count": 52,
      "page_number": 16
    },
    {
      "id": "e96a1275-e160-4677-b5d3-e06240d9ac80",
      "chapter_id": "1c6ce39b-f725-4617-ad41-ad8c88e4d3cf",
      "chunk_index": 0,
      "content": "acid (HCl) is added to test tube A, while acetic acid (CH3COOH) is added to test\ntube B. Amount and concentration taken for both the acids are same. In which test\ntube will the fizzing occur more vigorously and why?",
      "content_type": "text",
      "token_count": 53,
      "page_number": 16
    },
    {
      "id": "2ad3bb44-5c62-447d-b75a-ea5383e06ee9",
      "chapter_id": "4c91688d-cf6d-4800-b953-9195e57f3919",
      "chunk_index": 0,
      "content": "curd? Explain your answer.",
      "content_type": "text",
      "token_count": 6,
      "page_number": 16
    },
    {
      "id": "b6d9f2e7-e4e1-4ca5-90dc-eda8a3cec735",
      "chapter_id": "b983bf98-ff75-41ca-bcfd-4ac9b087feaa",
      "chunk_index": 0,
      "content": "(a) Why does he shift the pH of the fresh milk from 6 to slightly alkaline?\n(b) Why does this milk take a long time to set as curd?",
      "content_type": "text",
      "token_count": 32,
      "page_number": 16
    },
    {
      "id": "95ffad08-d387-41ba-8b1c-01d2f29c3678",
      "chapter_id": "41eb4116-b143-4484-a281-e29c647783e4",
      "chunk_index": 0,
      "content": "(I) Prepare your own indicator\n/square6Crush beetroot in a mortar.\n/square6Add sufficient water to obtain the extract.\n/square6Filter the extract by the procedure learnt by you in earlier classes.\n/square6Collect the filtrate to test the substances you may have tasted earlier.\n/square6Arrange four test tubes in a test tube stand and label them as A,B,C and D. Pour\n2 mL each of lemon juice solution, soda-water, vinegar and baking soda solution\nin them respectively.\n/square6Put 2-3 drops of the beetroot extract in each test tube and note the colour change\nif any. Write your observation in a Table.\n/square6You can prepare indicators by using other natural materials like extracts of red\ncabbage leaves, coloured petals of some flowers such as Petunia, Hydrangea and\nGeranium.\nGroup  Activity\n2024-25\n\n--- Page 20 ---\nScience36\n(II) Preparing a soda-acid fire extinguisher\nThe reaction of acids with metal hydrogencarbonates is used in the fire extinguishers\nwhich produce carbon dioxide.\n/square6Take 20 mL of sodium hydrogencarbonate (NaHCO3) solution in a wash-bottle.\n/square6Suspend an ignition tube containing dilute sulphuric acid in the wash-bottle\n(Fig. 2.10).\n/square6Close the mouth of the wash-bottle.\n/square6Tilt the wash-bottle so that the acid from the ignition tube mixes with the sodium\nhydrogencarbonate solution below.\n/square6You will notice discharge coming out of the nozzle.\n/square6Direct this discharge on a burning candle. What happens?\nFigure 2.10Figure 2.10Figure 2.10Figure 2.10Figure 2.10 (a) Ignition tube containing dilute sulphuric acid suspended in a wash-bottle containing\nsodium hydrogencarbonate, (b) Discharge coming out of the nozzle\n2024-25",
      "content_type": "text",
      "token_count": 421,
      "page_number": 17
    }
  ]
}