{
  "textbook": {
    "id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
    "file_name": "Class X Science NCERT - Ch 02 - , how copper oxide reacts with hydrochloric acid..pdf",
    "title": ", how copper oxide reacts with hydrochloric acid.",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 21,
    "file_size_mb": 2.1228713989257812,
    "status": "ready",
    "processed_at": "2025-09-28T10:54:39.305705",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 02 - , how copper oxide reacts with hydrochloric acid..pdf"
  },
  "chapters": [
    {
      "id": "365ee9e0-c054-47dd-858c-4af5fb8788ac",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 1,
      "title": "1. Give an example of a metal which",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "(i) is a liquid at room temperature.\n(ii) can be easily cut with a knife.\n(iii) is the best conductor of heat.\n(iv) is a poor conductor of heat."
    },
    {
      "id": "89c1dc45-9812-4395-af0e-be52f191f16a",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 2,
      "title": "2. Explain the meanings of malleable and ductile.",
      "topics": [],
      "start_page": 4,
      "end_page": 8,
      "content": "3.2 CHEMIC3.2 CHEMIC3.2 CHEMIC3.2 CHEMIC3.2 CHEMIC AL PROPERTIES OF METAL PROPERTIES OF METAL PROPERTIES OF METAL PROPERTIES OF METAL PROPERTIES OF MET ALS ALSALSALSALS\nWe will learn about the chemical properties of metals in the following\nSections 3.2.1 to 3.2.4. For this, collect the samples of following metals –\naluminium, copper, iron, lead, magnesium, zinc and sodium.\n Most non-metals produce acidic oxides when dissolve in water. On\nthe other hand, most metals, give rise to basic oxides. You will be learning\nmore about these metal oxides in the next section.\n2024-25\n\n--- Page 5 ---\nMetals and Non-metals 41\n3.2.1 What happens when Metals are bur nt in Air?\nYou have seen in Activity 3.8 that magnesium burns in air with a dazzling\nwhite flame. Do all metals react in the same manner? Let us check by\nperforming the following Activity.\nActivity 3.9Activity 3.9Activity 3.9Activity 3.9Activity 3.9\nCAUTION: The following activity needs the teacher’s assistance.\nIt would be better if students wear eye protection.\n/square6Hold any of the samples taken above with a pair of tongs and try\nburning over a flame. Repeat with the other metal samples.\n/square6Collect the product if formed.\n/square6Let the products and the metal surface cool down.\n/square6Which metals burn easily?\n/square6What flame colour did you observe when the metal burnt?\n/square6How does the metal surface appear after burning?\n/square6Arrange the metals in the decreasing order of their reactivity\ntowards oxygen.\n/square6Are the products soluble in water?\nAlmost all metals combine with oxygen to form metal oxides.\nMetal  +  Oxygen →  Metal oxide\n For example, when copper is heated in air, it combines with oxygen\nto form copper(II) oxide, a black oxide.\n2Cu  +  O2  →   2CuO\n(Copper)      (Copper(II) oxide)\nSimilarly, aluminium forms aluminium oxide.\n4Al + 3O2 →  2Al2O3\n(Aluminium) (Aluminium oxide)\nRecall from Chapter 2, how copper oxide reacts with hydrochloric acid.\nWe have learnt that metal oxides are basic in nature. But some metal\noxides, such as aluminium oxide, zinc oxide show both acidic as well as\nbasic behaviour. Such metal oxides which react with both acids as well as\nbases to produce salts and water are known as amphoteric oxides.\nAluminium oxide reacts in the following manner with acids and bases –\nAl2O3 + 6HCl → 2AlCl3 + 3H2O\nAl2O3 + 2NaOH → 2NaAlO2 + H2O\n(Sodium\naluminate)\n Most metal oxides are insoluble in water but some of these dissolve\nin water to form alkalis. Sodium oxide and potassium oxide dissolve in\nwater to produce alkalis as follows –\nNa2O(s) + H2O(l) →  2NaOH(aq)\nK2O(s) + H2O(l) →  2KOH(aq)\n2024-25\n\n--- Page 6 ---\nScience42\nWe have observed in Activity 3.9 that all metals do not r eact with\noxygen at the same rate. Different metals show different reactivities\ntowards oxygen. Metals such as potassium and sodium react so\nvigorously that they catch fire if kept in the open. Hence, to protect them\nand to prevent accidental fires, they are kept immersed in kerosene oil.\nAt ordinary temperature, the surfaces of metals such as magnesium,\naluminium, zinc, lead, etc., are covered with a thin layer of oxide. The\nprotective oxide layer prevents the metal from further oxidation. Iron\ndoes not burn on heating but iron filings burn vigorously when sprinkled\nin the flame of the burner. Copper does not burn, but the hot metal is\ncoated with a black coloured layer of copper(II) oxide. Silver and gold do\nnot react with oxygen even at high temperatures.\nDo You Know?\nAnodising is a process of forming a thick oxide layer of aluminium. Aluminium\ndevelops a thin oxide layer when exposed to air. This aluminium oxide coat makes it\nresistant to further corrosion.  The resistance can be improved further by making the\noxide layer thicker.  During anodising, a clean aluminium article is made the anode\nand is electrolysed with dilute sulphuric acid. The oxygen gas evolved at the anode\nreacts with aluminium to make a thicker protective oxide layer.  This oxide layer can\nbe dyed easily to give aluminium articles an attractive finish.\nAfter performing Activity 3.9, you must have observed that sodium\nis the most reactive of the samples of metals taken here. The reaction of\nmagnesium is less vigorous implying that it is not as reactive as sodium.\nBut burning in oxygen does not help us to decide about the reactivity of\nzinc, iron, copper or lead. Let us see some more reactions to arrive at a\nconclusion about the order of reactivity of these metals.\n3.2.2 What happens when Metals react with Water?\nActivity 3.10Activity 3.10Activity 3.10Activity 3.10Activity 3.10\nCAUTION: This Activity needs the teacher’s assistance.\n/square6Collect the samples of the same metals as in Activity 3.9.\n/square6Put small pieces of the samples separately in beakers half-filled\nwith cold water .\n/square6Which metals reacted with cold water? Arrange them in the\nincreasing order of their r eactivity with cold water .\n/square6Did any metal produce fire on water?\n/square6Does any metal start floating after some time?\n/square6Put the metals that did not react with cold water in beakers\nhalf-filled with hot water .\n/square6For the metals that did not r eact with hot water , arrange the\napparatus as shown in Fig. 3.3 and observe their reaction with steam.\n/square6Which metals did not react even with steam?\n/square6Arrange the metals in the decreasing order of reactivity with water.\n2024-25\n\n--- Page 7 ---\nMetals and Non-metals 43\nMetals react with water and produce a metal oxide and hydrogen\ngas. Metal oxides that are soluble in water dissolve in it to further form\nmetal hydroxide. But all metals do not react with water.\nMetal + Water → Metal oxide + Hydrogen\nMetal oxide + Water → Metal hydroxide\nMetals like potassium and sodium react violently with cold water. In\ncase of sodium and potassium, the reaction is so violent and exothermic\nthat the evolved hydrogen immediately catches fire.\n2K(s)   + 2H2O(l) →  2KOH(aq)  +  H2(g) + heat energy\n2Na(s) + 2H2O(l) →  2NaOH(aq) + H2(g) + heat energy\nThe reaction of calcium with water is less violent. The heat evolved is\nnot sufficient for the hydrogen to catch fire.\nCa(s) + 2H2O(l) →  Ca(OH)2(aq) + H2(g)\nCalcium starts floating because the bubbles of hydrogen gas formed\nstick to the surface of the metal.\nMagnesium does not react with cold water. It reacts with hot water\nto form magnesium hydroxide and hydrogen. It also starts floating due\nto the bubbles of hydrogen gas sticking to its surface.\nMetals like aluminium, iron and zinc do not react either with cold or\nhot water. But they react with steam to form the metal oxide and hydrogen.\n2Al(s) + 3H2O(g) →  Al2O3(s) + 3H2(g)\n3Fe(s) + 4H2O(g) →  Fe3O4(s) + 4H2(g)\nMetals such as lead, copper, silver and gold do not react with water at all.\n3.2.3 What happens when Metals react with Acids?\nYou have alr\neady learnt that metals react with acids to give a salt and\nhydrogen gas.\nFigure 3.3Figure 3.3Figure 3.3Figure 3.3Figure 3.3  Action of steam on a metal\n2024-25\n\n--- Page 8 ---\nScience44\nMetal + Dilute acid →  Salt + Hydrogen\nBut do all metals react in the same manner? Let us find out.\nActivity 3.11Activity 3.11Activity 3.11Activity 3.11Activity 3.11\n/square6Collect all the metal samples except sodium and potassium again.\nIf the samples ar e tar nished, rub them clean with sand paper .\nCAUTION:  Do not take sodium and potassium as they react\nvigorously even with cold water .\n/square6Put the samples separately in test tubes containing dilute\nhydrochloric acid.\n/square6Suspend thermometers in the test tubes, so that their bulbs are\ndipped in the acid.\n/square6Observe the rate of formation of bubbles carefully.\n/square6Which metals reacted vigorously with dilute hydrochloric acid?\n/square6With which metal did you record the highest temperature?\n/square6Arrange the metals in the decreasing order of reactivity with dilute\nacids.\nWrite equations for the reactions of magnesium, aluminium, zinc\nand iron with dilute hydrochloric acid.\nHydrogen gas is not evolved when a metal reacts with nitric acid. It is\nbecause HNO3 is a strong oxidising agent. It oxidises the H2 produced to\nwater and itself gets reduced to any of the nitrogen oxides (N 2O, NO,\nNO2). But magnesium (Mg) and manganese (Mn) react with very dilute\nHNO3 to evolve H2 gas.\nYou must have observed in Activity 3.11, that the rate of formation\nof bubbles was the fastest in the case of magnesium. The reaction was\nalso the most exothermic in this case. The reactivity decreases in the\norder Mg > Al > Zn > Fe. In the case of copper, no bubbles were seen and\nthe temperature also remained unchanged. This shows that copper does\nnot react with dilute HCl.\nDo You Know?\nAqua regia, (Latin for ‘royal water’) is a freshly prepared mixture of concentrated\nhydrochloric acid and concentrated nitric acid in the ratio of 3:1. It can dissolve\ngold, even though neither of these acids can do so alone. Aqua regia  is a highly\ncorrosive, fuming liquid. It is one of the few reagents that is able to dissolve gold and\nplatinum.\n3.2.4 How do Metals react with Solutions of other Metal\nSalts?\nActivity 3.12Activity 3.12Activity 3.12Activity 3.12Activity 3.12\n/square6Take a clean wire of copper and an iron nail.\n/square6Put the copper wire in a solution of iron sulphate and the iron\nnail in a solution of copper sulphate taken in test tubes (Fig. 3.4).\n/square6Record your observations after 20 minutes.\n2024-25\n\n--- Page 9 ---\nMetals and Non-metals 45\n/square6In which test tube did you find that a reaction has occurred?\n/square6On what basis can you say that a reaction has actually taken\nplace?\n/square6Can you correlate your observations for the Activities 3.9, 3.10\nand 3.11?\n/square6Write a balanced chemical equation for the reaction that has taken\nplace.\n/square6Name the type of reaction.\nReactive metals can displace less\nreactive metals from their compounds in\nsolution or molten form.\nWe have seen in the previous sections\nthat all metals are not equally reactive. We\nchecked the reactivity of various metals\nwith oxygen, water and acids. But all\nmetals do not react with these reagents.\nSo we were not able to put all the metal\nsamples we had collected in decreasing\norder of their reactivity. Displacement\nreactions studied in Chapter 1 give better\nevidence about the reactivity of metals. It\nis simple and easy if metal A displaces\nmetal B from its solution, it is more reactive than B.\nMetal A + Salt solution of B →  Salt solution of A + Metal B\nWhich metal, copper or iron, is more reactive according to your\nobservations in Activity 3.12?\n3.2.5 The Reactivity Series\nThe reactivity series is a list of metals arranged in the order of their\ndecreasing activities. After performing displacement experiments\n(Activities 1.9 and 3.12), the following series, (Table 3.2) known as the\nreactivity or activity series has been developed.\nTable 3.2 Activity series : Relative reactivities of metals\nK Potassium Most reactive\nNa Sodium\nCa Calcium\nMg Magnesium\nAl Aluminium\nZn Zinc Reactivity decreases\nFe Iron\nPb Lead\n[H] [Hydrogen]\nCu Copper\nHg Mercury\nAg Silver\nAu Gold Least reactive\nFigure 3.4Figure 3.4Figure 3.4Figure 3.4Figure 3.4\nReaction of metals with\nsalt solutions\n2024-25\n\n--- Page 10 ---\nScience46\n?\nQUESTIONS"
    },
    {
      "id": "46191adf-8125-4a3c-aeeb-a15cb023c8f8",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 4,
      "title": "2. Write equations for the r eactions of",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "(i) iron with steam\n(ii) calcium and potassium with water"
    },
    {
      "id": "87f55875-834f-48b6-aea1-9b293fd08158",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 5,
      "title": "3. Samples of four metals A, B, C and D were taken and added to the",
      "topics": [],
      "start_page": 8,
      "end_page": 9,
      "content": "following solution one by one. The results obtained have been tabulated\nas follows.\n3.3 HOW DO MET3.3 HOW DO MET3.3 HOW DO MET3.3 HOW DO MET3.3 HOW DO MET ALS AND NON-METALS AND NON-METALS AND NON-METALS AND NON-METALS AND NON-MET ALS REA ALS REAALS REAALS REAALS REA CT? CT?CT? CT?CT?\nIn the above activities, you saw the reactions of metals with a number of\nreagents. Why do metals react in this manner? Let us recall what we\nlearnt about the electronic configuration of elements in Class IX. W e\nlearnt that noble gases, which have a completely filled valence shell, show\nlittle chemical activity. We, therefore, explain the reactivity of elements\nas a tendency to attain a completely filled valence shell.\nLet us have a look at the electronic configuration of noble gases and\nsome metals and non-metals.\nWe can see from Table 3.3 that a sodium atom has one electron in its\noutermost shell. If it loses the electron from its M shell then its L shell\nnow becomes the outermost shell and that has a stable octet. The nucleus\nof this atom still has 11 protons but the number of electrons has\nbecome 10, so there is a net positive charge giving us a sodium cation\nNa+. On the other hand chlorine has seven electrons in its outermost shell\nUse the Table above to answer the following questions about metals\nA, B, C and D.\n(i) Which is the most reactive metal?\n(ii) What would you observe if B is added to a solution of Copper(II)\nsulphate?\n(iii) Arrange the metals A, B, C and D in the order of decreasing\nreactivity."
    },
    {
      "id": "a37c4e5b-f562-4e63-9727-861bf796d266",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 6,
      "title": "4. Which gas is produced when dilute hydrochloric acid is added to a",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "reactive metal? W rite the chemical r eaction when ir on reacts with dilute\nH2SO4."
    },
    {
      "id": "a1ecbb14-baa0-4f1e-ab0f-7980368ead39",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 7,
      "title": "5. What would you observe when zinc is added to a solution of iron(II)",
      "topics": [],
      "start_page": 9,
      "end_page": 12,
      "content": "sulphate? W rite the chemical r eaction that takes place.\nMetal Iron(II) sulphate Copper(II) sulphate Zinc sulphate Silver nitrate\nA No reaction Displacement\nB Displacement No reaction\nC No reaction No reaction No reaction Displacement\nD No reaction No reaction No reaction No reaction\n2024-25\n\n--- Page 11 ---\nMetals and Non-metals 47\nand it requires one more electron to complete its octet. If sodium and chlorine\nwere to react, the electron lost by sodium could be taken up by chlorine.\nAfter gaining an electron, the chlorine atom gets a unit negative charge,\nbecause its nucleus has 17 protons and there are 18 electrons in its K, L\nand M shells.  This gives us a chloride anion C1–. So both these elements\ncan have a give-and-take relation between them as follows (Fig. 3.5).\nNa Na + e\n2,8,1 2,8\n+\n(Sodi\num cation)\n→ –\nCl +e Cl\n2,8,7 2,8,8\n(Chloride anion)\n– –→\nFigure 3.5Figure 3.5Figure 3.5Figure 3.5Figure 3.5  Formation of sodium chloride\nSodium and chloride ions, being oppositely charged, attract each\nother and are held by strong electrostatic forces of attraction to exist as\nsodium chloride (NaCl). It should be noted that sodium chloride does\nnot exist as molecules but aggregates of oppositely charged ions.\nLet us see the formation of one more ionic compound, magnesium\nchloride (Fig. 3.6).\nTable 3.3 Electronic configurations of some elements\nType of Element Atomic Number of\nelement number electrons in shells\nK L M N\nNoble gases Helium (He) 2 2\nNeon (Ne) 10 2 8\nArgon (Ar) 18 2 8\n8\nMetals Sodium (Na) 11 2 8 1\nMagnesium (Mg) 12 2 8 2\nAluminium (Al) 13 2 8 3\nPotassium (K) 19 2 8 8 1\nCalcium (Ca) 20 2 8 8 2\nNon-metals Nitrogen (N) 7 2 5\nOxygen (O) 8 2 6\nFluorine (F) 9 2 7\nPhosphorus (P) 15 2 8 5\nSulphur (S) 16 2 8 6\nChlorine (Cl) 17 2 8 7\n2024-25\n\n--- Page 12 ---\nScience48\nMg Mg e 2+\n(Magnesium cation)\n →  + 2\n2 8 2 2 8\n–\n, , ,\nCl +e Cl\n2,8,7 2,8,8\n(Chloride anion)\n– –\n→ \nFigure 3.6Figure 3.6Figure 3.6Figure 3.6Figure 3.6  Formation of magnesium chloride\nThe compounds formed in this manner by the transfer of electrons\nfrom a metal to a non-metal are known as ionic compounds or\nelectrovalent compounds. Can you name the cation and anion present\nin MgCl2?\n3.3.1 Properties of Ionic Compounds\nTo learn about the properties of ionic compounds, let us perform the\nfollowing Activity:\nActivity 3.13Activity 3.13Activity 3.13Activity 3.13Activity 3.13\n/square6Take samples of sodium chloride, potassium iodide, barium\nchloride or any other salt from the science laboratory.\n/square6What is the physical state of these salts?\n/square6Take a small amount of a sample on a metal spatula and\nheat directly on the flame (Fig. 3.7). Repeat with other samples.\n/square6What did you observe? Did the samples impart any colour\nto the flame? Do these compounds melt?\n/square6Try to dissolve the samples in water , petrol and ker osene.\nAre they soluble?\n/square6Make a circuit as shown in Fig. 3.8 and insert the electrodes\ninto a solution of one salt. What did you observe? Test the\nother salt samples too in this manner .\n/square6What is your inference about the nature of these\ncompounds?\nFigure 3.7Figure 3.7Figure 3.7Figure 3.7Figure 3.7\nHeating a salt sample on a\nspatula\nFigure 3.8Figure 3.8Figure 3.8Figure 3.8Figure 3.8\nTesting the conductivity of\na salt solution\nTable 3.4 Melting and boiling points of some ionic compounds\nIonic Melting point Boiling point\ncompound (K) (K)\nNaCl 1074 1686\nLiCl 887 1600\nCaCl2 1045 1900\nCaO 2850 3120\nMgCl2 981 1685\n2024-25\n\n--- Page 13 ---\nMetals and Non-metals 49\nYou may have observed the following general pr operties for ionic\ncompounds—\n(i) Physical nature: Ionic compounds are solids and are somewhat\nhard because of the strong force of attraction between the positive\nand negative ions. These compounds are generally brittle and\nbreak into pieces when pressure is applied.\n(ii) Melting and Boiling points : Ionic compounds have high melting\nand boiling points (see Table 3.4). This is because a considerable\namount of ener gy is r equired to br eak the str ong inter -ionic\nattraction.\n(iii) Solubility : Electrovalent compounds are generally soluble in\nwater and insoluble in solvents such as kerosene, petrol, etc.\n(iv) Conduction of Electricity : The conduction of electricity through\na solution involves the movement of charged particles. A solution\nof an ionic compound in water contains ions, which move to the\nopposite electrodes when electricity is passed through the\nsolution. Ionic compounds in the solid state do not conduct\nelectricity because movement of ions in the solid is not possible\ndue to their rigid structure. But ionic compounds conduct\nelectricity in the molten state. This is possible in the molten state\nsince the elecrostatic forces of attraction between the oppositely\ncharged ions are overcome due to the heat. Thus, the ions move\nfreely and conduct electricity.\nQUESTIONS\n?\n1.          (i) Write the electr on-dot structur es for sodium, oxygen and\nmagnesium.\n(ii) Show the formation of Na2O and MgO by the transfer of  electrons.\n(iii) What are the ions present in these compounds?"
    },
    {
      "id": "3fb836ad-dd43-4267-a459-d6f88c5edaed",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 8,
      "title": "2. Why do ionic compounds have high melting points?",
      "topics": [],
      "start_page": 12,
      "end_page": 15,
      "content": "3.4 3.43.43.43.4 OCCURRENCE OF METOCCURRENCE OF METOCCURRENCE OF METOCCURRENCE OF METOCCURRENCE OF MET ALS\nALSALS ALSALS\nThe earth’s crust is the major source of metals. Seawater also contains\nsome soluble salts such as sodium chloride, magnesium chloride, etc.\nThe elements or compounds, which occur naturally in the earth’s crust,\nare known as minerals. At some places, minerals contain a very high\npercentage of a particular metal and the metal can be profitably extracted\nfrom it. These minerals are called ores.\n3.4.1 Extraction of Metals\nYou have lear nt about the r eactivity series of metals. Having this\nknowledge, you can easily understand how a metal is extracted from its\nore. Some metals are found in the earth’s crust in the free state. Some\nare found in the form of their compounds. The metals at the bottom of\nthe activity series are the least reactive. They are often found in a free\n2024-25\n\n--- Page 14 ---\nScience50\nstate. For example, gold, silver, platinum and copper are found in the\nfree state. Copper and silver are also found in the combined state as\ntheir sulphide or oxide ores. The metals at the top of the activity series\n(K, Na, Ca, Mg and Al) are so reactive that they are never found in\nnature as free elements. The metals in the middle of the activity series\n(Zn, Fe, Pb, etc.) are moderately reactive. They are found in the earth’s\ncrust mainly as oxides, sulphides or carbonates. You will find that\nthe ores of many metals are oxides. This is because oxygen is a very\nreactive element and is very abundant on the earth.\nThus on the basis of reactivity, we can group the metals into the\nfollowing three categories (Fig. 3.9) – (i) Metals of low reactivity; (ii) Metals\nof medium reactivity; (iii) Metals of high reactivity. Different techniques\nare to be used for obtaining the metals falling in each category.\nK\nNa\nCa\nMg\nAl\nZn\nFe\nPb\nCu\nAg\nAu\nReduction using\ncarbon\nFound in native\nstate\nElectrolysis\nFigure 3.9Figure 3.9Figure 3.9Figure 3.9Figure 3.9\nActivity series and\nrelated metallurgy\nFigure 3.10Figure 3.10Figure 3.10Figure 3.10Figure 3.10  Steps involved in the extraction of metals from ores\n3.4.2 Enrichment of Ores\nOres mined from the earth are usually contaminated with large amounts\nof impurities such as soil, sand, etc., called gangue. The impurities must\nbe removed from the ore prior to the extraction of the metal. The processes\nSeveral steps are involved in the extraction of pure metal from\nores. A summary of these steps is given in Fig.3.10. Each step is\nexplained in detail in the following sections.\n2024-25\n\n--- Page 15 ---\nMetals and Non-metals 51\nused for removing the gangue from the ore are based on the differences\nbetween the physical or chemical properties of the gangue and the ore.\nDifferent separation techniques are  accordingly employed.\n3.4.3 Extracting Metals Low in the Activity Series\nMetals low in the activity series are very unreactive. The oxides of these\nmetals can be  reduced to metals by heating alone. For example, cinnabar\n(HgS) is an ore of mercury. When it is heated in air, it is first converted\ninto mercuric oxide (HgO). Mercuric oxide is then reduced to mercury\non further heating.\n2HgS(s) + 3O (g) 2HgO(s) + 2SO (g)2 2\nHeat →  \n2HgO(s) 2Hg(l) + O (g) 2\nHeat →  \nSimilarly, copper which is found as Cu2S in nature can be obtained\nfrom its ore by just heating in air.\n2Cu S + 3O (g) 2Cu O(s) + 2SO (g)\n2Cu O + Cu S \n2 2 2 2\n2 2\nHeat\nHeat\n →   \n →    6Cu(s) + SO (g)2\n3.4.4 Extracting Metals in the Middle of the Activity Series\nThe metals in the middle of the activity series such as iron, zinc, lead,\ncopper, are moderately reactive. These are usually present as sulphides\nor carbonates in nature. It is easier to obtain a metal from its oxide, as\ncompared to its sulphides and carbonates. Therefore, prior to reduction,\nthe metal sulphides and carbonates must be converted into metal\noxides. The sulphide ores are converted into oxides by heating strongly\nin the presence of excess air. This process is known as roasting. The\ncarbonate ores are changed into oxides by heating strongly in limited\nair. This process is known as calcination. The chemical reaction that\ntakes place during roasting and calcination of zinc ores can be shown\nas follows –\nRoasting\n2ZnS(s) + 3O (g) 2ZnO(s) + 2SO (g)2 2\nHeat →   \nCalcination\nZnCO (s) ZnO(s) + CO (g)3 2\nHeat →  \nThe metal oxides are then reduced to the corresponding metals by\nusing suitable reducing agents such as carbon. For example, when zinc\noxide is heated with carbon, it is reduced to metallic zinc.\nZnO(s) + C(s) →  Zn(s) + CO(g)\nYou are already familiar with the process of oxidation and reduction\nexplained in the first Chapter. Obtaining metals from their compounds\nis also a reduction process.\nBesides using carbon (coke) to reduce metal oxides to metals,\nsometimes displacement reactions can also be used. The highly reactive\nmetals such as sodium, calcium, aluminium, etc., are used as reducing\n2024-25\n\n--- Page 16 ---\nScience52\nagents because they can displace metals of lower reactivity from their\ncompounds. For example, when manganese dioxide is heated with\naluminium powder, the following reaction takes place –\n3MnO2(s) + 4Al(s) →  3Mn(l) + 2Al2O3(s) + Heat\nCan you identify the substances that are getting oxidised\nand reduced?\nThese displacement reactions are highly exothermic. The\namount of heat evolved is so large that the metals are produced\nin the molten state. In fact, the reaction of iron(III) oxide (Fe2O3)\nwith aluminium is used to join railway tracks or cracked\nmachine parts. This reaction is known as the thermit reaction.\nFe2O3(s) + 2Al(s) →  2Fe(l) + Al2O3(s) + Heat\n3.4.5 Extracting Metals towards the T op of the\nActivity Series\nThe metals high up in the reactivity series are very reactive. They cannot\nbe obtained from their compounds by heating with carbon. For example,\ncarbon cannot reduce the oxides of sodium, magnesium, calcium,\naluminium, etc., to the respective metals. This is because these metals\nhave more affinity for oxygen than carbon. These metals are obtained\nby electrolytic reduction. For example, sodium, magnesium and calcium\nare obtained by the electrolysis of their molten chlorides. The metals\nare deposited at the cathode (the negatively charged electrode), whereas,\nchlorine is liberated at the anode (the positively charged electrode). The\nreactions are –\nAt cathode Na+ + e– → Na\nAt anode       2Cl– → Cl2 + 2e–\nSimilarly, aluminium is obtained by the electrolytic reduction of\naluminium oxide.\n3.4.6 Refining of Metals\nThe metals produced by various reduction processes\ndescribed above are not very pure. They contain\nimpurities, which must be removed to obtain pure metals.\nThe most widely used method for refining impure metals\nis electrolytic refining.\nElectrolytic Refining: Electrolytic Refining: Electrolytic Refining: Electrolytic Refining: Electrolytic Refining: Many metals, such as copper, zinc,\ntin, nickel, silver, gold, etc., are refined electrolytically. In\nthis process, the impure metal is made the anode and a\nthin strip of pure metal is made the cathode. A solution of\nthe metal salt is used as an electrolyte. The apparatus is\nset up as shown in Fig. 3.12. On passing the current\nthrough the electrolyte, the pure metal from the anode\ndissolves into the electrolyte. An equivalent amount of pure\nFigure 3.11Figure 3.11Figure 3.11Figure 3.11Figure 3.11\nThermit process for\njoining railway tracks\nFigure 3.12Figure 3.12Figure 3.12Figure 3.12Figure 3.12\nElectr olytic r efining of copper . The\nelectrolyte is a solution of acidified copper\nsulphate. The anode is impur e copper,\nwhereas, the cathode is a strip of pure\ncopper. On passing electric current, pure\ncopper is deposited on the cathode.\n2024-25\n\n--- Page 17 ---\nMetals and Non-metals 53\nmetal from the electrolyte is deposited on the cathode. The soluble\nimpurities go into the solution, whereas, the insoluble impurities settle\ndown at the bottom of the anode and are known as anode mud."
    },
    {
      "id": "78ab1200-f6da-4f06-9521-a358851cc569",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 9,
      "title": "1. Define the following terms.",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "(i) Mineral (ii)  Ore (iii)  Gangue"
    },
    {
      "id": "8afc7dcd-0ebc-46d9-9b04-bf232ef503a4",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 11,
      "title": "3. What chemical process is used for obtaining a metal from its oxide?",
      "topics": [],
      "start_page": 15,
      "end_page": 17,
      "content": "Activity 3.14Activity 3.14Activity 3.14Activity 3.14Activity 3.14\n/square6Take three test tubes and place clean iron nails\nin each of them.\n/square6Label these test tubes A, B and C. Pour some\nwater in test tube A and cork it.\n/square6Pour boiled distilled water in test tube B, add\nabout 1 mL of oil and cork it. The oil will float on\nwater and prevent the air from dissolving in the\nwater.\n/square6Put some anhydrous calcium chloride in\ntest tube C and cork it. Anhydrous calcium\nchloride will absorb the moisture, if any, from\nthe air. Leave these test tubes for a few days and\nthen observe (Fig. 3.13).\nFigure 3.13Figure 3.13Figure 3.13Figure 3.13Figure 3.13\nInvestigating the conditions under which iron\nrusts. In tube A, both air and water are\npresent. In tube B, there is no air dissolved\nin the water. In tube C, the air is dry.\nYou will observe that iron nails rust in test tube A,\nbut they do not rust in test tubes B and C. In the test\ntube A, the nails are exposed to both air and water. In\nthe test tube B, the nails are exposed to only water, and\nthe nails in test tube C ar e exposed to dry air . What\ndoes this tell us about the conditions under which iron\narticles rust?\nQUESTIONS\n?\n3.5 CORROSION3.5 CORROSION3.5 CORROSION3.5 CORROSION3.5 CORROSION\nYou have learnt the following about corrosion in Chapter 1 –\n/square6Silver articles  become black after some time when exposed to air.\nThis is because it reacts with sulphur in the air to form a coating\nof silver sulphide.\n/square6Copper reacts with moist carbon dioxide in the air and slowly loses\nits shiny brown surface and gains a green coat. This green\nsubstance is basic copper carbonate.\n/square6Iron when exposed to moist air for a long time acquires a coating\nof a brown flaky substance called rust.\nLet us find ou t the conditions under which iron rusts.\nA B C\n2024-25\n\n--- Page 18 ---\nScience54 Do You Know?\nPure gold, known as 24 carat gold, is very soft. It is, therefore, not suitable for making\njewellery. It is alloyed with either silver or copper to make it hard. Generally, in India,\n22 carat gold is used for making ornaments. It means that 22 parts of pure gold is\nalloyed with 2 parts of either copper or silver.\nIf one of the metals is mercury, then the alloy is known as an\namalgam. The electrical conductivity and melting point of an alloy is\nless than that of pure metals. For example, brass, an alloy of copper and\nzinc (Cu and Zn), and bronze, an alloy of copper and tin (Cu and Sn), are\nnot good conductors of electricity whereas copper is used for making\nelectrical circuits. Solder, an alloy of lead and tin (Pb and Sn), has a low\nmelting point and is used for welding electrical wires together.\n3.5.1 Prevention of Corrosion\nThe rusting of iron can be prevented by painting, oiling, greasing,\ngalvanising, chrome plating, anodising or making alloys.\nGalvanisation is a method of protecting steel and iron from rusting\nby coating them with a thin layer of zinc. The galvanised article is\nprotected against rusting even if the zinc coating is broken. Can you\nreason this out?\nAlloying is a very good method of improving the properties of a metal.\nWe can get the desired properties by this method. For example, iron is\nthe most widely used metal. But it is never used in its pure state. This is\nbecause pure iron is very soft and stretches easily when hot. But, if it is\nmixed with a small amount of carbon (about 0.05 %), it becomes hard\nand strong. When iron is mixed with nickel and chromium, we get\nstainless steel, which is hard and does not rust. Thus, if iron is mixed\nwith some other substance, its properties change. In fact, the properties\nof any metal can be changed if it is mixed with some other substance.\nThe substance added may be a metal or a non-metal. An alloy is a\nhomogeneous mixture of two or more metals, or a metal and a non-\nmetal. It is prepared by first melting the primary metal, and then,\ndissolving the other elements in it in definite proportions. It is then cooled\nto room temperature.\nIron pillar at Delhi\nThe wonder of ancient Indian metallurgy\nThe iron pillar near the Qutub Minar in Delhi was built more\nthan 1600 years ago by the iron workers of India.  They had\ndeveloped a process which prevented iron from rusting. For\nits quality of rust resistance it has been examined by scientists\nfrom all parts of the world. The iron pillar is 8 m high and\nweighs 6 tonnes (6000 kg).\nMore to Know!\n2024-25\n\n--- Page 19 ---\nMetals and Non-metals 55\nIn which cases will you find displacement reactions taking place?"
    },
    {
      "id": "21ebb1f0-9f7e-486d-a7f4-6f06850a97a2",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 13,
      "title": "3. What are alloys?",
      "topics": [],
      "start_page": 17,
      "end_page": 17,
      "content": "QUESTIONS\n?"
    },
    {
      "id": "9437fa89-6443-4a52-9ae3-97ad335a62b0",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 14,
      "title": "1. Metallic oxides of zinc, magnesium and copper were heated with the",
      "topics": [],
      "start_page": 17,
      "end_page": 18,
      "content": "following metals.\nMetal Zinc Magnesium Copper\nZinc oxide\nMagnesium oxide\nCopper oxide\nWhat you have learnt\n/square6Elements can be classified as metals and non-metals.\n/square6Metals are lustrous, malleable, ductile and are good conductors of heat and\nelectricity. They are solids at room temperature, except mercury which is a liquid.\n/square6Metals can form positive ions by losing electrons to non-metals.\n/square6Metals combine with oxygen to form basic oxides. Aluminium oxide and zinc oxide\nshow the properties of both basic as well as acidic oxides. These oxides are known\nas amphoteric oxides.\n/square6Different metals have different reactivities with water and dilute acids.\n/square6A list of common metals arranged in order of their decreasing reactivity is known\nas an activity series.\n/square6Metals above hydrogen in the Activity series can displace hydrogen from dilute\nacids.\n/square6A more reactive metal displaces a less reactive metal from its salt solution.\n/square6Metals occur in nature as free elements or in the form of their compounds.\n/square6The extraction of metals from their ores and then refining them for use is known\nas metallurgy.\n/square6An alloy is a homogeneous mixture of two or more metals, or a metal and a\nnon-metal.\n/square6The surface of some metals, such as iron, is corroded when they are exposed to\nmoist air for a long period of time. This phenomenon is known as corrosion.\n/square6Non-metals have properties opposite to that of metals. They are neither malleable\nnor ductile. They are bad conductors of heat and electricity, except for graphite,\nwhich conducts electricity.\n2024-25\n\n--- Page 20 ---\nScience56\n/square6Non-metals form negatively charged ions by gaining electrons when reacting with\nmetals.\n/square6Non-metals form oxides which are either acidic or neutral.\n/square6Non-metals do not displace hydrogen from dilute acids. They react with hydrogen\nto form hydrides.\nEXERCISES"
    },
    {
      "id": "a33fbb6a-502f-49f7-a054-5ce49ae7d7c3",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 15,
      "title": "1. Which of the following pairs will give displacement reactions?",
      "topics": [],
      "start_page": 18,
      "end_page": 18,
      "content": "(a) NaCl solution and copper metal\n(b) MgCl2 solution and aluminium metal\n(c) FeSO4 solution and silver metal\n(d) AgNO3 solution and copper metal."
    },
    {
      "id": "d047eca4-ae20-4dca-b136-f05106939de1",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 16,
      "title": "2. Which of the following methods is suitable for preventing an iron frying pan from",
      "topics": [],
      "start_page": 18,
      "end_page": 18,
      "content": "rusting?\n(a) Applying grease\n(b) Applying paint\n(c) Applying a coating of zinc\n(d) All of the above."
    },
    {
      "id": "b49649b9-22d0-4420-a147-a06950639450",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 17,
      "title": "3. An element reacts with oxygen to give a compound with a high melting point. This",
      "topics": [],
      "start_page": 18,
      "end_page": 18,
      "content": "compound is also soluble in water. The element is likely to be\n(a) calcium\n(b) carbon\n(c) silicon\n(d) iron."
    },
    {
      "id": "56aadc55-9926-4dbf-9605-5154b2655ba2",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 18,
      "title": "4. Food cans are coated with tin and not with zinc because",
      "topics": [],
      "start_page": 18,
      "end_page": 19,
      "content": "(a) zinc is costlier than tin.\n(b) zinc has a higher melting point than tin.\n(c) zinc is more reactive than tin.\n(d) zinc is less reactive than tin."
    },
    {
      "id": "2e52c740-2466-42a2-9c35-17425428fcd0",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 19,
      "title": "5. You are given a hammer, a battery, a bulb, wires and a switch.",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "(a) How could you use them to distinguish between samples of metals and\nnon-metals?\n(b) Assess the usefulness of these tests in distinguishing between metals and\nnon-metals."
    },
    {
      "id": "94d0e3d7-2169-4993-8c31-3b05461c780f",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 21,
      "title": "7. Name two metals which will displace hydrogen from dilute acids, and two metals",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "which will not.\n2024-25\n\n--- Page 21 ---\nMetals and Non-metals 57"
    },
    {
      "id": "575a33f1-8045-4761-b6d3-3da8d0c2cf56",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 22,
      "title": "8. In the electrolytic refining of a metal M, what would you take as the anode, the",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "cathode and the electrolyte?"
    },
    {
      "id": "828c9e74-ba20-4d1d-bc4a-3a19300e2fb9",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 23,
      "title": "9. Pratyush took sulphur powder on a spatula and heated it. He collected the gas",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "evolved by inverting a test tube over it, as shown in figure below.\n(a) What will be the action of gas on\n(i) dry litmus paper?\n(ii) moist litmus paper?\n(b) Write a balanced chemical\nequation for the reaction\ntaking place."
    },
    {
      "id": "05868b1d-7bee-47d1-96ba-b353c4ee819e",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 24,
      "title": "10. State two ways to prevent the",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "rusting of iron."
    },
    {
      "id": "4509d1b8-4cd6-4c22-bb2a-220a8f31dec1",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 25,
      "title": "11. What type of oxides are formed when",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "non-metals combine with oxygen?"
    },
    {
      "id": "0a57066f-c3fe-4855-b55f-63eedd2a16c1",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 26,
      "title": "12. Give reasons",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "(a) Platinum, gold and silver are\nused to make jewellery.\n(b) Sodium, potassium and\nlithium are stored under oil.\n(c) Aluminium is a highly reactive\nmetal, yet it is used to make\nutensils for cooking.\n(d) Carbonate and sulphide ores\nare usually converted into\noxides during the process of\nextraction."
    },
    {
      "id": "a6a9c28d-924d-401a-bd8a-9bfc32cea2c1",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 27,
      "title": "13. You must have seen tarnished copper vessels being cleaned with lemon or tamarind",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "juice. Explain why these sour substances are effective in cleaning the vessels."
    },
    {
      "id": "965f37c0-c880-4f6d-9cd1-7fd9999f4c7b",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 29,
      "title": "15. A man went door to door posing as a goldsmith. He promised to bring back the",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "glitter of old and dull gold ornaments. An unsuspecting lady gave a set of gold\nbangles to him which he dipped in a particular solution. The bangles sparkled\nlike new but their weight was reduced drastically. The lady was upset but after a\nfutile argument the man beat a hasty retreat. Can you play the detective to find\nout the nature of the solution he had used?"
    },
    {
      "id": "39e01087-0676-4682-babf-8048573aa28e",
      "textbook_id": "2bdff5ad-9072-4483-83a5-4baaa1acdc00",
      "chapter_number": 30,
      "title": "16. Give reasons why copper is used to make hot water tanks and not steel (an alloy",
      "topics": [],
      "start_page": 19,
      "end_page": 20,
      "content": "of iron).\nCollection of gas\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "2553cd99-302a-40e0-81a3-5cb6e7994d17",
      "chapter_id": "365ee9e0-c054-47dd-858c-4af5fb8788ac",
      "chunk_index": 0,
      "content": "(i) is a liquid at room temperature.\n(ii) can be easily cut with a knife.\n(iii) is the best conductor of heat.\n(iv) is a poor conductor of heat.",
      "content_type": "text",
      "token_count": 36,
      "page_number": 4
    },
    {
      "id": "47c7668a-d517-412b-8e05-de4d50970290",
      "chapter_id": "89c1dc45-9812-4395-af0e-be52f191f16a",
      "chunk_index": 0,
      "content": "3.2 CHEMIC3.2 CHEMIC3.2 CHEMIC3.2 CHEMIC3.2 CHEMIC AL PROPERTIES OF METAL PROPERTIES OF METAL PROPERTIES OF METAL PROPERTIES OF METAL PROPERTIES OF MET ALS ALSALSALSALS\nWe will learn about the chemical properties of metals in the following\nSections 3.2.1 to 3.2.4. For this, collect the samples of following metals –\naluminium, copper, iron, lead, magnesium, zinc and sodium.\n Most non-metals produce acidic oxides when dissolve in water. On\nthe other hand, most metals, give rise to basic oxides. You will be learning\nmore about these metal oxides in the next section.\n2024-25\n\n--- Page 5 ---\nMetals and Non-metals 41\n3.2.1 What happens when Metals are bur nt in Air?\nYou have seen in Activity 3.8 that magnesium burns in air with a dazzling\nwhite flame. Do all metals react in the same manner? Let us check by\nperforming the following Activity.\nActivity 3.9Activity 3.9Activity 3.9Activity 3.9Activity 3.9\nCAUTION: The following activity needs the teacher’s assistance.\nIt would be better if students wear eye protection.\n/square6Hold any of the samples taken above with a pair of tongs and try\nburning over a flame. Repeat with the other metal samples.\n/square6Collect the product if formed.\n/square6Let the products and the metal surface cool down.\n/square6Which metals burn easily?\n/square6What flame colour did you observe when the metal burnt?\n/square6How does the metal surface appear after burning?\n/square6Arrange the metals in the decreasing order of their reactivity\ntowards oxygen.\n/square6Are the products soluble in water?\nAlmost all metals combine with oxygen to form metal oxides.\nMetal  +  Oxygen →  Metal oxide\n For example, when copper is heated in air, it combines with oxygen\nto form copper(II) oxide, a black oxide.\n2Cu  +  O2  →   2CuO\n(Copper)      (Copper(II) oxide)\nSimilarly, aluminium forms aluminium oxide.\n4Al + 3O2 →  2Al2O3\n(Aluminium) (Aluminium oxide)\nRecall from Chapter 2, how copper oxide reacts with hydrochloric acid.\nWe have learnt that metal oxides are basic in nature. But some metal\noxides, such as aluminium oxide, zinc oxide show both acidic as well as\nbasic behaviour. Such metal oxides which react with both acids as well as\nbases to produce salts and water are known as amphoteric oxides.\nAluminium oxide reacts in the following manner with acids and bases –\nAl2O3 + 6HCl → 2AlCl3 + 3H2O\nAl2O3 + 2NaOH → 2NaAlO2 + H2O\n(Sodium\naluminate)\n Most metal oxides are insoluble in water but some of these dissolve\nin water to form alkalis. Sodium oxide and potassium oxide dissolve in\nwater to produce alkalis as follows –\nNa2O(s) + H2O(l) →  2NaOH(aq)\nK2O(s) + H2O(l) →  2KOH(aq)\n2024-25",
      "content_type": "example",
      "token_count": 657,
      "page_number": 4
    },
    {
      "id": "aa79e6ac-d58b-40a8-9980-e624102b1bb6",
      "chapter_id": "89c1dc45-9812-4395-af0e-be52f191f16a",
      "chunk_index": 1,
      "content": "--- Page 6 ---\nScience42\nWe have observed in Activity 3.9 that all metals do not r eact with\noxygen at the same rate. Different metals show different reactivities\ntowards oxygen. Metals such as potassium and sodium react so\nvigorously that they catch fire if kept in the open. Hence, to protect them\nand to prevent accidental fires, they are kept immersed in kerosene oil.\nAt ordinary temperature, the surfaces of metals such as magnesium,\naluminium, zinc, lead, etc., are covered with a thin layer of oxide. The\nprotective oxide layer prevents the metal from further oxidation. Iron\ndoes not burn on heating but iron filings burn vigorously when sprinkled\nin the flame of the burner. Copper does not burn, but the hot metal is\ncoated with a black coloured layer of copper(II) oxide. Silver and gold do\nnot react with oxygen even at high temperatures.\nDo You Know?\nAnodising is a process of forming a thick oxide layer of aluminium. Aluminium\ndevelops a thin oxide layer when exposed to air. This aluminium oxide coat makes it\nresistant to further corrosion.  The resistance can be improved further by making the\noxide layer thicker.  During anodising, a clean aluminium article is made the anode\nand is electrolysed with dilute sulphuric acid. The oxygen gas evolved at the anode\nreacts with aluminium to make a thicker protective oxide layer.  This oxide layer can\nbe dyed easily to give aluminium articles an attractive finish.\nAfter performing Activity 3.9, you must have observed that sodium\nis the most reactive of the samples of metals taken here. The reaction of\nmagnesium is less vigorous implying that it is not as reactive as sodium.\nBut burning in oxygen does not help us to decide about the reactivity of\nzinc, iron, copper or lead. Let us see some more reactions to arrive at a\nconclusion about the order of reactivity of these metals.\n3.2.2 What happens when Metals react with Water?\nActivity 3.10Activity 3.10Activity 3.10Activity 3.10Activity 3.10\nCAUTION: This Activity needs the teacher’s assistance.\n/square6Collect the samples of the same metals as in Activity 3.9.\n/square6Put small pieces of the samples separately in beakers half-filled\nwith cold water .\n/square6Which metals reacted with cold water? Arrange them in the\nincreasing order of their r eactivity with cold water .\n/square6Did any metal produce fire on water?\n/square6Does any metal start floating after some time?\n/square6Put the metals that did not react with cold water in beakers\nhalf-filled with hot water .\n/square6For the metals that did not r eact with hot water , arrange the\napparatus as shown in Fig. 3.3 and observe their reaction with steam.\n/square6Which metals did not react even with steam?\n/square6Arrange the metals in the decreasing order of reactivity with water.\n2024-25",
      "content_type": "summary",
      "token_count": 694,
      "page_number": 4
    },
    {
      "id": "cd07accd-2caa-4069-900c-76858e85137e",
      "chapter_id": "89c1dc45-9812-4395-af0e-be52f191f16a",
      "chunk_index": 2,
      "content": "--- Page 7 ---\nMetals and Non-metals 43\nMetals react with water and produce a metal oxide and hydrogen\ngas. Metal oxides that are soluble in water dissolve in it to further form\nmetal hydroxide. But all metals do not react with water.\nMetal + Water → Metal oxide + Hydrogen\nMetal oxide + Water → Metal hydroxide\nMetals like potassium and sodium react violently with cold water. In\ncase of sodium and potassium, the reaction is so violent and exothermic\nthat the evolved hydrogen immediately catches fire.\n2K(s)   + 2H2O(l) →  2KOH(aq)  +  H2(g) + heat energy\n2Na(s) + 2H2O(l) →  2NaOH(aq) + H2(g) + heat energy\nThe reaction of calcium with water is less violent. The heat evolved is\nnot sufficient for the hydrogen to catch fire.\nCa(s) + 2H2O(l) →  Ca(OH)2(aq) + H2(g)\nCalcium starts floating because the bubbles of hydrogen gas formed\nstick to the surface of the metal.\nMagnesium does not react with cold water. It reacts with hot water\nto form magnesium hydroxide and hydrogen. It also starts floating due\nto the bubbles of hydrogen gas sticking to its surface.\nMetals like aluminium, iron and zinc do not react either with cold or\nhot water. But they react with steam to form the metal oxide and hydrogen.\n2Al(s) + 3H2O(g) →  Al2O3(s) + 3H2(g)\n3Fe(s) + 4H2O(g) →  Fe3O4(s) + 4H2(g)\nMetals such as lead, copper, silver and gold do not react with water at all.\n3.2.3 What happens when Metals react with Acids?\nYou have alr\neady learnt that metals react with acids to give a salt and\nhydrogen gas.\nFigure 3.3Figure 3.3Figure 3.3Figure 3.3Figure 3.3  Action of steam on a metal\n2024-25",
      "content_type": "exercise",
      "token_count": 396,
      "page_number": 4
    },
    {
      "id": "d7636324-2ba1-4643-85f7-1d6f3fd21a94",
      "chapter_id": "89c1dc45-9812-4395-af0e-be52f191f16a",
      "chunk_index": 3,
      "content": "--- Page 8 ---\nScience44\nMetal + Dilute acid →  Salt + Hydrogen\nBut do all metals react in the same manner? Let us find out.\nActivity 3.11Activity 3.11Activity 3.11Activity 3.11Activity 3.11\n/square6Collect all the metal samples except sodium and potassium again.\nIf the samples ar e tar nished, rub them clean with sand paper .\nCAUTION:  Do not take sodium and potassium as they react\nvigorously even with cold water .\n/square6Put the samples separately in test tubes containing dilute\nhydrochloric acid.\n/square6Suspend thermometers in the test tubes, so that their bulbs are\ndipped in the acid.\n/square6Observe the rate of formation of bubbles carefully.\n/square6Which metals reacted vigorously with dilute hydrochloric acid?\n/square6With which metal did you record the highest temperature?\n/square6Arrange the metals in the decreasing order of reactivity with dilute\nacids.\nWrite equations for the reactions of magnesium, aluminium, zinc\nand iron with dilute hydrochloric acid.\nHydrogen gas is not evolved when a metal reacts with nitric acid. It is\nbecause HNO3 is a strong oxidising agent. It oxidises the H2 produced to\nwater and itself gets reduced to any of the nitrogen oxides (N 2O, NO,\nNO2). But magnesium (Mg) and manganese (Mn) react with very dilute\nHNO3 to evolve H2 gas.\nYou must have observed in Activity 3.11, that the rate of formation\nof bubbles was the fastest in the case of magnesium. The reaction was\nalso the most exothermic in this case. The reactivity decreases in the\norder Mg > Al > Zn > Fe. In the case of copper, no bubbles were seen and\nthe temperature also remained unchanged. This shows that copper does\nnot react with dilute HCl.\nDo You Know?\nAqua regia, (Latin for ‘royal water’) is a freshly prepared mixture of concentrated\nhydrochloric acid and concentrated nitric acid in the ratio of 3:1. It can dissolve\ngold, even though neither of these acids can do so alone. Aqua regia  is a highly\ncorrosive, fuming liquid. It is one of the few reagents that is able to dissolve gold and\nplatinum.\n3.2.4 How do Metals react with Solutions of other Metal\nSalts?\nActivity 3.12Activity 3.12Activity 3.12Activity 3.12Activity 3.12\n/square6Take a clean wire of copper and an iron nail.\n/square6Put the copper wire in a solution of iron sulphate and the iron\nnail in a solution of copper sulphate taken in test tubes (Fig. 3.4).\n/square6Record your observations after 20 minutes.\n2024-25",
      "content_type": "exercise",
      "token_count": 603,
      "page_number": 4
    },
    {
      "id": "8bb2a16e-0eca-409b-a3ba-8c1bf27ed671",
      "chapter_id": "89c1dc45-9812-4395-af0e-be52f191f16a",
      "chunk_index": 4,
      "content": "--- Page 9 ---\nMetals and Non-metals 45\n/square6In which test tube did you find that a reaction has occurred?\n/square6On what basis can you say that a reaction has actually taken\nplace?\n/square6Can you correlate your observations for the Activities 3.9, 3.10\nand 3.11?\n/square6Write a balanced chemical equation for the reaction that has taken\nplace.\n/square6Name the type of reaction.\nReactive metals can displace less\nreactive metals from their compounds in\nsolution or molten form.\nWe have seen in the previous sections\nthat all metals are not equally reactive. We\nchecked the reactivity of various metals\nwith oxygen, water and acids. But all\nmetals do not react with these reagents.\nSo we were not able to put all the metal\nsamples we had collected in decreasing\norder of their reactivity. Displacement\nreactions studied in Chapter 1 give better\nevidence about the reactivity of metals. It\nis simple and easy if metal A displaces\nmetal B from its solution, it is more reactive than B.\nMetal A + Salt solution of B →  Salt solution of A + Metal B\nWhich metal, copper or iron, is more reactive according to your\nobservations in Activity 3.12?\n3.2.5 The Reactivity Series\nThe reactivity series is a list of metals arranged in the order of their\ndecreasing activities. After performing displacement experiments\n(Activities 1.9 and 3.12), the following series, (Table 3.2) known as the\nreactivity or activity series has been developed.\nTable 3.2 Activity series : Relative reactivities of metals\nK Potassium Most reactive\nNa Sodium\nCa Calcium\nMg Magnesium\nAl Aluminium\nZn Zinc Reactivity decreases\nFe Iron\nPb Lead\n[H] [Hydrogen]\nCu Copper\nHg Mercury\nAg Silver\nAu Gold Least reactive\nFigure 3.4Figure 3.4Figure 3.4Figure 3.4Figure 3.4\nReaction of metals with\nsalt solutions\n2024-25\n\n--- Page 10 ---\nScience46\n?\nQUESTIONS",
      "content_type": "exercise",
      "token_count": 454,
      "page_number": 8
    },
    {
      "id": "0d7160f3-fa36-4c4c-b74b-dc3ab6a8bc4d",
      "chapter_id": "46191adf-8125-4a3c-aeeb-a15cb023c8f8",
      "chunk_index": 0,
      "content": "(i) iron with steam\n(ii) calcium and potassium with water",
      "content_type": "text",
      "token_count": 14,
      "page_number": 8
    },
    {
      "id": "00b251be-f123-4483-bc2e-9365baf3da00",
      "chapter_id": "87f55875-834f-48b6-aea1-9b293fd08158",
      "chunk_index": 0,
      "content": "following solution one by one. The results obtained have been tabulated\nas follows.\n3.3 HOW DO MET3.3 HOW DO MET3.3 HOW DO MET3.3 HOW DO MET3.3 HOW DO MET ALS AND NON-METALS AND NON-METALS AND NON-METALS AND NON-METALS AND NON-MET ALS REA ALS REAALS REAALS REAALS REA CT? CT?CT? CT?CT?\nIn the above activities, you saw the reactions of metals with a number of\nreagents. Why do metals react in this manner? Let us recall what we\nlearnt about the electronic configuration of elements in Class IX. W e\nlearnt that noble gases, which have a completely filled valence shell, show\nlittle chemical activity. We, therefore, explain the reactivity of elements\nas a tendency to attain a completely filled valence shell.\nLet us have a look at the electronic configuration of noble gases and\nsome metals and non-metals.\nWe can see from Table 3.3 that a sodium atom has one electron in its\noutermost shell. If it loses the electron from its M shell then its L shell\nnow becomes the outermost shell and that has a stable octet. The nucleus\nof this atom still has 11 protons but the number of electrons has\nbecome 10, so there is a net positive charge giving us a sodium cation\nNa+. On the other hand chlorine has seven electrons in its outermost shell\nUse the Table above to answer the following questions about metals\nA, B, C and D.\n(i) Which is the most reactive metal?\n(ii) What would you observe if B is added to a solution of Copper(II)\nsulphate?\n(iii) Arrange the metals A, B, C and D in the order of decreasing\nreactivity.",
      "content_type": "exercise",
      "token_count": 378,
      "page_number": 9
    },
    {
      "id": "f8b5466a-12b2-4953-9b1f-71cda312b36e",
      "chapter_id": "a37c4e5b-f562-4e63-9727-861bf796d266",
      "chunk_index": 0,
      "content": "reactive metal? W rite the chemical r eaction when ir on reacts with dilute\nH2SO4.",
      "content_type": "text",
      "token_count": 20,
      "page_number": 9
    },
    {
      "id": "a61d8ef5-0b14-4a6a-a63e-f2ae804e2f8a",
      "chapter_id": "a1ecbb14-baa0-4f1e-ab0f-7980368ead39",
      "chunk_index": 0,
      "content": "sulphate? W rite the chemical r eaction that takes place.\nMetal Iron(II) sulphate Copper(II) sulphate Zinc sulphate Silver nitrate\nA No reaction Displacement\nB Displacement No reaction\nC No reaction No reaction No reaction Displacement\nD No reaction No reaction No reaction No reaction\n2024-25\n\n--- Page 11 ---\nMetals and Non-metals 47\nand it requires one more electron to complete its octet. If sodium and chlorine\nwere to react, the electron lost by sodium could be taken up by chlorine.\nAfter gaining an electron, the chlorine atom gets a unit negative charge,\nbecause its nucleus has 17 protons and there are 18 electrons in its K, L\nand M shells.  This gives us a chloride anion C1–. So both these elements\ncan have a give-and-take relation between them as follows (Fig. 3.5).\nNa Na + e\n2,8,1 2,8\n+\n(Sodi\num cation)\n→ –\nCl +e Cl\n2,8,7 2,8,8\n(Chloride anion)\n– –→\nFigure 3.5Figure 3.5Figure 3.5Figure 3.5Figure 3.5  Formation of sodium chloride\nSodium and chloride ions, being oppositely charged, attract each\nother and are held by strong electrostatic forces of attraction to exist as\nsodium chloride (NaCl). It should be noted that sodium chloride does\nnot exist as molecules but aggregates of oppositely charged ions.\nLet us see the formation of one more ionic compound, magnesium\nchloride (Fig. 3.6).\nTable 3.3 Electronic configurations of some elements\nType of Element Atomic Number of\nelement number electrons in shells\nK L M N\nNoble gases Helium (He) 2 2\nNeon (Ne) 10 2 8\nArgon (Ar) 18 2 8\n8\nMetals Sodium (Na) 11 2 8 1\nMagnesium (Mg) 12 2 8 2\nAluminium (Al) 13 2 8 3\nPotassium (K) 19 2 8 8 1\nCalcium (Ca) 20 2 8 8 2\nNon-metals Nitrogen (N) 7 2 5\nOxygen (O) 8 2 6\nFluorine (F) 9 2 7\nPhosphorus (P) 15 2 8 5\nSulphur (S) 16 2 8 6\nChlorine (Cl) 17 2 8 7\n2024-25",
      "content_type": "text",
      "token_count": 442,
      "page_number": 9
    },
    {
      "id": "f2632a98-1392-44ec-ac3a-500338a785b0",
      "chapter_id": "a1ecbb14-baa0-4f1e-ab0f-7980368ead39",
      "chunk_index": 1,
      "content": "--- Page 12 ---\nScience48\nMg Mg e 2+\n(Magnesium cation)\n →  + 2\n2 8 2 2 8\n–\n, , ,\nCl +e Cl\n2,8,7 2,8,8\n(Chloride anion)\n– –\n→ \nFigure 3.6Figure 3.6Figure 3.6Figure 3.6Figure 3.6  Formation of magnesium chloride\nThe compounds formed in this manner by the transfer of electrons\nfrom a metal to a non-metal are known as ionic compounds or\nelectrovalent compounds. Can you name the cation and anion present\nin MgCl2?\n3.3.1 Properties of Ionic Compounds\nTo learn about the properties of ionic compounds, let us perform the\nfollowing Activity:\nActivity 3.13Activity 3.13Activity 3.13Activity 3.13Activity 3.13\n/square6Take samples of sodium chloride, potassium iodide, barium\nchloride or any other salt from the science laboratory.\n/square6What is the physical state of these salts?\n/square6Take a small amount of a sample on a metal spatula and\nheat directly on the flame (Fig. 3.7). Repeat with other samples.\n/square6What did you observe? Did the samples impart any colour\nto the flame? Do these compounds melt?\n/square6Try to dissolve the samples in water , petrol and ker osene.\nAre they soluble?\n/square6Make a circuit as shown in Fig. 3.8 and insert the electrodes\ninto a solution of one salt. What did you observe? Test the\nother salt samples too in this manner .\n/square6What is your inference about the nature of these\ncompounds?\nFigure 3.7Figure 3.7Figure 3.7Figure 3.7Figure 3.7\nHeating a salt sample on a\nspatula\nFigure 3.8Figure 3.8Figure 3.8Figure 3.8Figure 3.8\nTesting the conductivity of\na salt solution\nTable 3.4 Melting and boiling points of some ionic compounds\nIonic Melting point Boiling point\ncompound (K) (K)\nNaCl 1074 1686\nLiCl 887 1600\nCaCl2 1045 1900\nCaO 2850 3120\nMgCl2 981 1685\n2024-25",
      "content_type": "exercise",
      "token_count": 428,
      "page_number": 9
    },
    {
      "id": "b98fe34c-ba19-4b5b-9010-1824529e0cc6",
      "chapter_id": "a1ecbb14-baa0-4f1e-ab0f-7980368ead39",
      "chunk_index": 2,
      "content": "--- Page 13 ---\nMetals and Non-metals 49\nYou may have observed the following general pr operties for ionic\ncompounds—\n(i) Physical nature: Ionic compounds are solids and are somewhat\nhard because of the strong force of attraction between the positive\nand negative ions. These compounds are generally brittle and\nbreak into pieces when pressure is applied.\n(ii) Melting and Boiling points : Ionic compounds have high melting\nand boiling points (see Table 3.4). This is because a considerable\namount of ener gy is r equired to br eak the str ong inter -ionic\nattraction.\n(iii) Solubility : Electrovalent compounds are generally soluble in\nwater and insoluble in solvents such as kerosene, petrol, etc.\n(iv) Conduction of Electricity : The conduction of electricity through\na solution involves the movement of charged particles. A solution\nof an ionic compound in water contains ions, which move to the\nopposite electrodes when electricity is passed through the\nsolution. Ionic compounds in the solid state do not conduct\nelectricity because movement of ions in the solid is not possible\ndue to their rigid structure. But ionic compounds conduct\nelectricity in the molten state. This is possible in the molten state\nsince the elecrostatic forces of attraction between the oppositely\ncharged ions are overcome due to the heat. Thus, the ions move\nfreely and conduct electricity.\nQUESTIONS\n?\n1.          (i) Write the electr on-dot structur es for sodium, oxygen and\nmagnesium.\n(ii) Show the formation of Na2O and MgO by the transfer of  electrons.\n(iii) What are the ions present in these compounds?",
      "content_type": "exercise",
      "token_count": 398,
      "page_number": 12
    },
    {
      "id": "c19a421b-cbb1-4811-a037-563e0428eee3",
      "chapter_id": "3fb836ad-dd43-4267-a459-d6f88c5edaed",
      "chunk_index": 0,
      "content": "3.4 3.43.43.43.4 OCCURRENCE OF METOCCURRENCE OF METOCCURRENCE OF METOCCURRENCE OF METOCCURRENCE OF MET ALS\nALSALS ALSALS\nThe earth’s crust is the major source of metals. Seawater also contains\nsome soluble salts such as sodium chloride, magnesium chloride, etc.\nThe elements or compounds, which occur naturally in the earth’s crust,\nare known as minerals. At some places, minerals contain a very high\npercentage of a particular metal and the metal can be profitably extracted\nfrom it. These minerals are called ores.\n3.4.1 Extraction of Metals\nYou have lear nt about the r eactivity series of metals. Having this\nknowledge, you can easily understand how a metal is extracted from its\nore. Some metals are found in the earth’s crust in the free state. Some\nare found in the form of their compounds. The metals at the bottom of\nthe activity series are the least reactive. They are often found in a free\n2024-25\n\n--- Page 14 ---\nScience50\nstate. For example, gold, silver, platinum and copper are found in the\nfree state. Copper and silver are also found in the combined state as\ntheir sulphide or oxide ores. The metals at the top of the activity series\n(K, Na, Ca, Mg and Al) are so reactive that they are never found in\nnature as free elements. The metals in the middle of the activity series\n(Zn, Fe, Pb, etc.) are moderately reactive. They are found in the earth’s\ncrust mainly as oxides, sulphides or carbonates. You will find that\nthe ores of many metals are oxides. This is because oxygen is a very\nreactive element and is very abundant on the earth.\nThus on the basis of reactivity, we can group the metals into the\nfollowing three categories (Fig. 3.9) – (i) Metals of low reactivity; (ii) Metals\nof medium reactivity; (iii) Metals of high reactivity. Different techniques\nare to be used for obtaining the metals falling in each category.\nK\nNa\nCa\nMg\nAl\nZn\nFe\nPb\nCu\nAg\nAu\nReduction using\ncarbon\nFound in native\nstate\nElectrolysis\nFigure 3.9Figure 3.9Figure 3.9Figure 3.9Figure 3.9\nActivity series and\nrelated metallurgy\nFigure 3.10Figure 3.10Figure 3.10Figure 3.10Figure 3.10  Steps involved in the extraction of metals from ores\n3.4.2 Enrichment of Ores\nOres mined from the earth are usually contaminated with large amounts\nof impurities such as soil, sand, etc., called gangue. The impurities must\nbe removed from the ore prior to the extraction of the metal. The processes\nSeveral steps are involved in the extraction of pure metal from\nores. A summary of these steps is given in Fig.3.10. Each step is\nexplained in detail in the following sections.\n2024-25",
      "content_type": "example",
      "token_count": 641,
      "page_number": 12
    },
    {
      "id": "c7c0cf15-af5b-4be1-a6ab-975249b3f33a",
      "chapter_id": "3fb836ad-dd43-4267-a459-d6f88c5edaed",
      "chunk_index": 1,
      "content": "--- Page 15 ---\nMetals and Non-metals 51\nused for removing the gangue from the ore are based on the differences\nbetween the physical or chemical properties of the gangue and the ore.\nDifferent separation techniques are  accordingly employed.\n3.4.3 Extracting Metals Low in the Activity Series\nMetals low in the activity series are very unreactive. The oxides of these\nmetals can be  reduced to metals by heating alone. For example, cinnabar\n(HgS) is an ore of mercury. When it is heated in air, it is first converted\ninto mercuric oxide (HgO). Mercuric oxide is then reduced to mercury\non further heating.\n2HgS(s) + 3O (g) 2HgO(s) + 2SO (g)2 2\nHeat →  \n2HgO(s) 2Hg(l) + O (g) 2\nHeat →  \nSimilarly, copper which is found as Cu2S in nature can be obtained\nfrom its ore by just heating in air.\n2Cu S + 3O (g) 2Cu O(s) + 2SO (g)\n2Cu O + Cu S \n2 2 2 2\n2 2\nHeat\nHeat\n →   \n →    6Cu(s) + SO (g)2\n3.4.4 Extracting Metals in the Middle of the Activity Series\nThe metals in the middle of the activity series such as iron, zinc, lead,\ncopper, are moderately reactive. These are usually present as sulphides\nor carbonates in nature. It is easier to obtain a metal from its oxide, as\ncompared to its sulphides and carbonates. Therefore, prior to reduction,\nthe metal sulphides and carbonates must be converted into metal\noxides. The sulphide ores are converted into oxides by heating strongly\nin the presence of excess air. This process is known as roasting. The\ncarbonate ores are changed into oxides by heating strongly in limited\nair. This process is known as calcination. The chemical reaction that\ntakes place during roasting and calcination of zinc ores can be shown\nas follows –\nRoasting\n2ZnS(s) + 3O (g) 2ZnO(s) + 2SO (g)2 2\nHeat →   \nCalcination\nZnCO (s) ZnO(s) + CO (g)3 2\nHeat →  \nThe metal oxides are then reduced to the corresponding metals by\nusing suitable reducing agents such as carbon. For example, when zinc\noxide is heated with carbon, it is reduced to metallic zinc.\nZnO(s) + C(s) →  Zn(s) + CO(g)\nYou are already familiar with the process of oxidation and reduction\nexplained in the first Chapter. Obtaining metals from their compounds\nis also a reduction process.\nBesides using carbon (coke) to reduce metal oxides to metals,\nsometimes displacement reactions can also be used. The highly reactive\nmetals such as sodium, calcium, aluminium, etc., are used as reducing\n2024-25",
      "content_type": "example",
      "token_count": 602,
      "page_number": 12
    },
    {
      "id": "1be6a122-bca9-4821-9466-6427db23499e",
      "chapter_id": "3fb836ad-dd43-4267-a459-d6f88c5edaed",
      "chunk_index": 2,
      "content": "--- Page 16 ---\nScience52\nagents because they can displace metals of lower reactivity from their\ncompounds. For example, when manganese dioxide is heated with\naluminium powder, the following reaction takes place –\n3MnO2(s) + 4Al(s) →  3Mn(l) + 2Al2O3(s) + Heat\nCan you identify the substances that are getting oxidised\nand reduced?\nThese displacement reactions are highly exothermic. The\namount of heat evolved is so large that the metals are produced\nin the molten state. In fact, the reaction of iron(III) oxide (Fe2O3)\nwith aluminium is used to join railway tracks or cracked\nmachine parts. This reaction is known as the thermit reaction.\nFe2O3(s) + 2Al(s) →  2Fe(l) + Al2O3(s) + Heat\n3.4.5 Extracting Metals towards the T op of the\nActivity Series\nThe metals high up in the reactivity series are very reactive. They cannot\nbe obtained from their compounds by heating with carbon. For example,\ncarbon cannot reduce the oxides of sodium, magnesium, calcium,\naluminium, etc., to the respective metals. This is because these metals\nhave more affinity for oxygen than carbon. These metals are obtained\nby electrolytic reduction. For example, sodium, magnesium and calcium\nare obtained by the electrolysis of their molten chlorides. The metals\nare deposited at the cathode (the negatively charged electrode), whereas,\nchlorine is liberated at the anode (the positively charged electrode). The\nreactions are –\nAt cathode Na+ + e– → Na\nAt anode       2Cl– → Cl2 + 2e–\nSimilarly, aluminium is obtained by the electrolytic reduction of\naluminium oxide.\n3.4.6 Refining of Metals\nThe metals produced by various reduction processes\ndescribed above are not very pure. They contain\nimpurities, which must be removed to obtain pure metals.\nThe most widely used method for refining impure metals\nis electrolytic refining.\nElectrolytic Refining: Electrolytic Refining: Electrolytic Refining: Electrolytic Refining: Electrolytic Refining: Many metals, such as copper, zinc,\ntin, nickel, silver, gold, etc., are refined electrolytically. In\nthis process, the impure metal is made the anode and a\nthin strip of pure metal is made the cathode. A solution of\nthe metal salt is used as an electrolyte. The apparatus is\nset up as shown in Fig. 3.12. On passing the current\nthrough the electrolyte, the pure metal from the anode\ndissolves into the electrolyte. An equivalent amount of pure\nFigure 3.11Figure 3.11Figure 3.11Figure 3.11Figure 3.11\nThermit process for\njoining railway tracks\nFigure 3.12Figure 3.12Figure 3.12Figure 3.12Figure 3.12\nElectr olytic r efining of copper . The\nelectrolyte is a solution of acidified copper\nsulphate. The anode is impur e copper,\nwhereas, the cathode is a strip of pure\ncopper. On passing electric current, pure\ncopper is deposited on the cathode.\n2024-25",
      "content_type": "example",
      "token_count": 693,
      "page_number": 12
    },
    {
      "id": "9cb8b809-9809-4c12-87b9-7bb7a700fabb",
      "chapter_id": "3fb836ad-dd43-4267-a459-d6f88c5edaed",
      "chunk_index": 3,
      "content": "--- Page 17 ---\nMetals and Non-metals 53\nmetal from the electrolyte is deposited on the cathode. The soluble\nimpurities go into the solution, whereas, the insoluble impurities settle\ndown at the bottom of the anode and are known as anode mud.",
      "content_type": "text",
      "token_count": 60,
      "page_number": 15
    },
    {
      "id": "cf6b949a-ff93-4223-9272-7f79470438fd",
      "chapter_id": "78ab1200-f6da-4f06-9521-a358851cc569",
      "chunk_index": 0,
      "content": "(i) Mineral (ii)  Ore (iii)  Gangue",
      "content_type": "text",
      "token_count": 8,
      "page_number": 15
    },
    {
      "id": "3f1e3ec0-aa59-4f20-8295-ebb4a9e1ca26",
      "chapter_id": "8afc7dcd-0ebc-46d9-9b04-bf232ef503a4",
      "chunk_index": 0,
      "content": "Activity 3.14Activity 3.14Activity 3.14Activity 3.14Activity 3.14\n/square6Take three test tubes and place clean iron nails\nin each of them.\n/square6Label these test tubes A, B and C. Pour some\nwater in test tube A and cork it.\n/square6Pour boiled distilled water in test tube B, add\nabout 1 mL of oil and cork it. The oil will float on\nwater and prevent the air from dissolving in the\nwater.\n/square6Put some anhydrous calcium chloride in\ntest tube C and cork it. Anhydrous calcium\nchloride will absorb the moisture, if any, from\nthe air. Leave these test tubes for a few days and\nthen observe (Fig. 3.13).\nFigure 3.13Figure 3.13Figure 3.13Figure 3.13Figure 3.13\nInvestigating the conditions under which iron\nrusts. In tube A, both air and water are\npresent. In tube B, there is no air dissolved\nin the water. In tube C, the air is dry.\nYou will observe that iron nails rust in test tube A,\nbut they do not rust in test tubes B and C. In the test\ntube A, the nails are exposed to both air and water. In\nthe test tube B, the nails are exposed to only water, and\nthe nails in test tube C ar e exposed to dry air . What\ndoes this tell us about the conditions under which iron\narticles rust?\nQUESTIONS\n?\n3.5 CORROSION3.5 CORROSION3.5 CORROSION3.5 CORROSION3.5 CORROSION\nYou have learnt the following about corrosion in Chapter 1 –\n/square6Silver articles  become black after some time when exposed to air.\nThis is because it reacts with sulphur in the air to form a coating\nof silver sulphide.\n/square6Copper reacts with moist carbon dioxide in the air and slowly loses\nits shiny brown surface and gains a green coat. This green\nsubstance is basic copper carbonate.\n/square6Iron when exposed to moist air for a long time acquires a coating\nof a brown flaky substance called rust.\nLet us find ou t the conditions under which iron rusts.\nA B C\n2024-25",
      "content_type": "exercise",
      "token_count": 461,
      "page_number": 15
    },
    {
      "id": "0220d508-2c12-43d6-9560-b15aa9d37104",
      "chapter_id": "8afc7dcd-0ebc-46d9-9b04-bf232ef503a4",
      "chunk_index": 1,
      "content": "--- Page 18 ---\nScience54 Do You Know?\nPure gold, known as 24 carat gold, is very soft. It is, therefore, not suitable for making\njewellery. It is alloyed with either silver or copper to make it hard. Generally, in India,\n22 carat gold is used for making ornaments. It means that 22 parts of pure gold is\nalloyed with 2 parts of either copper or silver.\nIf one of the metals is mercury, then the alloy is known as an\namalgam. The electrical conductivity and melting point of an alloy is\nless than that of pure metals. For example, brass, an alloy of copper and\nzinc (Cu and Zn), and bronze, an alloy of copper and tin (Cu and Sn), are\nnot good conductors of electricity whereas copper is used for making\nelectrical circuits. Solder, an alloy of lead and tin (Pb and Sn), has a low\nmelting point and is used for welding electrical wires together.\n3.5.1 Prevention of Corrosion\nThe rusting of iron can be prevented by painting, oiling, greasing,\ngalvanising, chrome plating, anodising or making alloys.\nGalvanisation is a method of protecting steel and iron from rusting\nby coating them with a thin layer of zinc. The galvanised article is\nprotected against rusting even if the zinc coating is broken. Can you\nreason this out?\nAlloying is a very good method of improving the properties of a metal.\nWe can get the desired properties by this method. For example, iron is\nthe most widely used metal. But it is never used in its pure state. This is\nbecause pure iron is very soft and stretches easily when hot. But, if it is\nmixed with a small amount of carbon (about 0.05 %), it becomes hard\nand strong. When iron is mixed with nickel and chromium, we get\nstainless steel, which is hard and does not rust. Thus, if iron is mixed\nwith some other substance, its properties change. In fact, the properties\nof any metal can be changed if it is mixed with some other substance.\nThe substance added may be a metal or a non-metal. An alloy is a\nhomogeneous mixture of two or more metals, or a metal and a non-\nmetal. It is prepared by first melting the primary metal, and then,\ndissolving the other elements in it in definite proportions. It is then cooled\nto room temperature.\nIron pillar at Delhi\nThe wonder of ancient Indian metallurgy\nThe iron pillar near the Qutub Minar in Delhi was built more\nthan 1600 years ago by the iron workers of India.  They had\ndeveloped a process which prevented iron from rusting. For\nits quality of rust resistance it has been examined by scientists\nfrom all parts of the world. The iron pillar is 8 m high and\nweighs 6 tonnes (6000 kg).\nMore to Know!\n2024-25\n\n--- Page 19 ---\nMetals and Non-metals 55\nIn which cases will you find displacement reactions taking place?",
      "content_type": "example",
      "token_count": 672,
      "page_number": 17
    },
    {
      "id": "f6950085-5b08-484b-8b93-775038f2d31b",
      "chapter_id": "21ebb1f0-9f7e-486d-a7f4-6f06850a97a2",
      "chunk_index": 0,
      "content": "QUESTIONS\n?",
      "content_type": "exercise",
      "token_count": 2,
      "page_number": 17
    },
    {
      "id": "3e3de848-232a-4cc4-9b51-3dfafcee138d",
      "chapter_id": "9437fa89-6443-4a52-9ae3-97ad335a62b0",
      "chunk_index": 0,
      "content": "following metals.\nMetal Zinc Magnesium Copper\nZinc oxide\nMagnesium oxide\nCopper oxide\nWhat you have learnt\n/square6Elements can be classified as metals and non-metals.\n/square6Metals are lustrous, malleable, ductile and are good conductors of heat and\nelectricity. They are solids at room temperature, except mercury which is a liquid.\n/square6Metals can form positive ions by losing electrons to non-metals.\n/square6Metals combine with oxygen to form basic oxides. Aluminium oxide and zinc oxide\nshow the properties of both basic as well as acidic oxides. These oxides are known\nas amphoteric oxides.\n/square6Different metals have different reactivities with water and dilute acids.\n/square6A list of common metals arranged in order of their decreasing reactivity is known\nas an activity series.\n/square6Metals above hydrogen in the Activity series can displace hydrogen from dilute\nacids.\n/square6A more reactive metal displaces a less reactive metal from its salt solution.\n/square6Metals occur in nature as free elements or in the form of their compounds.\n/square6The extraction of metals from their ores and then refining them for use is known\nas metallurgy.\n/square6An alloy is a homogeneous mixture of two or more metals, or a metal and a\nnon-metal.\n/square6The surface of some metals, such as iron, is corroded when they are exposed to\nmoist air for a long period of time. This phenomenon is known as corrosion.\n/square6Non-metals have properties opposite to that of metals. They are neither malleable\nnor ductile. They are bad conductors of heat and electricity, except for graphite,\nwhich conducts electricity.\n2024-25\n\n--- Page 20 ---\nScience56\n/square6Non-metals form negatively charged ions by gaining electrons when reacting with\nmetals.\n/square6Non-metals form oxides which are either acidic or neutral.\n/square6Non-metals do not displace hydrogen from dilute acids. They react with hydrogen\nto form hydrides.\nEXERCISES",
      "content_type": "exercise",
      "token_count": 483,
      "page_number": 18
    },
    {
      "id": "559dc68e-c485-4d29-96f7-886a8149599b",
      "chapter_id": "a33fbb6a-502f-49f7-a054-5ce49ae7d7c3",
      "chunk_index": 0,
      "content": "(a) NaCl solution and copper metal\n(b) MgCl2 solution and aluminium metal\n(c) FeSO4 solution and silver metal\n(d) AgNO3 solution and copper metal.",
      "content_type": "text",
      "token_count": 36,
      "page_number": 18
    },
    {
      "id": "1cc05b15-949a-4b17-b748-f5c70ed5ead7",
      "chapter_id": "d047eca4-ae20-4dca-b136-f05106939de1",
      "chunk_index": 0,
      "content": "rusting?\n(a) Applying grease\n(b) Applying paint\n(c) Applying a coating of zinc\n(d) All of the above.",
      "content_type": "text",
      "token_count": 25,
      "page_number": 18
    },
    {
      "id": "ec068d5f-320b-4f3c-ba44-772960f0daac",
      "chapter_id": "b49649b9-22d0-4420-a147-a06950639450",
      "chunk_index": 0,
      "content": "compound is also soluble in water. The element is likely to be\n(a) calcium\n(b) carbon\n(c) silicon\n(d) iron.",
      "content_type": "text",
      "token_count": 26,
      "page_number": 18
    },
    {
      "id": "272d01cc-83e4-4f4e-9a92-e84cc9ea76f8",
      "chapter_id": "56aadc55-9926-4dbf-9605-5154b2655ba2",
      "chunk_index": 0,
      "content": "(a) zinc is costlier than tin.\n(b) zinc has a higher melting point than tin.\n(c) zinc is more reactive than tin.\n(d) zinc is less reactive than tin.",
      "content_type": "text",
      "token_count": 37,
      "page_number": 19
    },
    {
      "id": "5a60acc5-6d5a-4e1a-aab5-59463e5ed6c5",
      "chapter_id": "2e52c740-2466-42a2-9c35-17425428fcd0",
      "chunk_index": 0,
      "content": "(a) How could you use them to distinguish between samples of metals and\nnon-metals?\n(b) Assess the usefulness of these tests in distinguishing between metals and\nnon-metals.",
      "content_type": "text",
      "token_count": 43,
      "page_number": 19
    },
    {
      "id": "e8dd4618-a25c-4ae0-889d-9d6cf9a0eced",
      "chapter_id": "94d0e3d7-2169-4993-8c31-3b05461c780f",
      "chunk_index": 0,
      "content": "which will not.\n2024-25\n\n--- Page 21 ---\nMetals and Non-metals 57",
      "content_type": "text",
      "token_count": 16,
      "page_number": 19
    },
    {
      "id": "ea7c2c40-f02f-41a3-b15a-ff5f12bd0c96",
      "chapter_id": "575a33f1-8045-4761-b6d3-3da8d0c2cf56",
      "chunk_index": 0,
      "content": "cathode and the electrolyte?",
      "content_type": "text",
      "token_count": 7,
      "page_number": 19
    },
    {
      "id": "cfc86c25-0d3f-4ba7-97c0-756efe987250",
      "chapter_id": "828c9e74-ba20-4d1d-bc4a-3a19300e2fb9",
      "chunk_index": 0,
      "content": "evolved by inverting a test tube over it, as shown in figure below.\n(a) What will be the action of gas on\n(i) dry litmus paper?\n(ii) moist litmus paper?\n(b) Write a balanced chemical\nequation for the reaction\ntaking place.",
      "content_type": "text",
      "token_count": 55,
      "page_number": 19
    },
    {
      "id": "346ec834-413a-435f-9390-9bd542819d84",
      "chapter_id": "05868b1d-7bee-47d1-96ba-b353c4ee819e",
      "chunk_index": 0,
      "content": "rusting of iron.",
      "content_type": "text",
      "token_count": 4,
      "page_number": 19
    },
    {
      "id": "0b2f6410-aa68-4eec-b866-fd7fb9de53dc",
      "chapter_id": "4509d1b8-4cd6-4c22-bb2a-220a8f31dec1",
      "chunk_index": 0,
      "content": "non-metals combine with oxygen?",
      "content_type": "text",
      "token_count": 7,
      "page_number": 19
    },
    {
      "id": "57c128d0-960a-4454-a47a-5f8657517f6c",
      "chapter_id": "0a57066f-c3fe-4855-b55f-63eedd2a16c1",
      "chunk_index": 0,
      "content": "(a) Platinum, gold and silver are\nused to make jewellery.\n(b) Sodium, potassium and\nlithium are stored under oil.\n(c) Aluminium is a highly reactive\nmetal, yet it is used to make\nutensils for cooking.\n(d) Carbonate and sulphide ores\nare usually converted into\noxides during the process of\nextraction.",
      "content_type": "text",
      "token_count": 75,
      "page_number": 19
    },
    {
      "id": "945078a0-23d6-4017-aaf9-e39be5f8c898",
      "chapter_id": "a6a9c28d-924d-401a-bd8a-9bfc32cea2c1",
      "chunk_index": 0,
      "content": "juice. Explain why these sour substances are effective in cleaning the vessels.",
      "content_type": "text",
      "token_count": 19,
      "page_number": 19
    },
    {
      "id": "a9f3f410-bcc8-462b-9a10-263f34b78e5d",
      "chapter_id": "965f37c0-c880-4f6d-9cd1-7fd9999f4c7b",
      "chunk_index": 0,
      "content": "glitter of old and dull gold ornaments. An unsuspecting lady gave a set of gold\nbangles to him which he dipped in a particular solution. The bangles sparkled\nlike new but their weight was reduced drastically. The lady was upset but after a\nfutile argument the man beat a hasty retreat. Can you play the detective to find\nout the nature of the solution he had used?",
      "content_type": "text",
      "token_count": 91,
      "page_number": 19
    },
    {
      "id": "987f7331-c823-4e8d-81e9-9ca66014e487",
      "chapter_id": "39e01087-0676-4682-babf-8048573aa28e",
      "chunk_index": 0,
      "content": "of iron).\nCollection of gas\n2024-25",
      "content_type": "text",
      "token_count": 8,
      "page_number": 20
    }
  ]
}