{
  "textbook": {
    "id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
    "file_name": "Class X Science NCERT - Ch 00 - How do Organisms.pdf",
    "title": "How do Organisms",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 15,
    "file_size_mb": 3.1942567825317383,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:13.952597",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 00 - How do Organisms.pdf"
  },
  "chapters": [
    {
      "id": "55858a2b-564e-4410-bc97-c7a2dfc97839",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 2,
      "title": "2. Why is variation beneficial to the species but not necessarily",
      "topics": [],
      "start_page": 2,
      "end_page": 6,
      "content": "for the individual?\n2024-25\n\n--- Page 3 ---\nHow do Organisms Reproduce? 115\nFigure 7.1(a)Figure 7.1(a)Figure 7.1(a)Figure 7.1(a)Figure 7.1(a)  Binary fission in Amoeba\nActivity 7.2Activity 7.2Activity 7.2Activity 7.2Activity 7.2\n7.2 MODES OF REPRODUCTION USED BY SINGLE7.2 MODES OF REPRODUCTION USED BY SINGLE7.2 MODES OF REPRODUCTION USED BY SINGLE7.2 MODES OF REPRODUCTION USED BY SINGLE7.2 MODES OF REPRODUCTION USED BY SINGLE\nORGANISMSORGANISMSORGANISMSORGANISMSORGANISMS\nActivity 7.1Activity 7.1Activity 7.1Activity 7.1Activity 7.1\n/square6Dissolve about 10 gm of sugar in 100 mL of water .\n/square6Take 20 mL of this solution in a test tube and add a pinch of yeast\ngranules to it.\n/square6Put a cotton plug on the mouth of the test tube and keep it in a\nwarm place.\n/square6After 1 or 2 hours, put a small drop of yeast culture from the test\ntube on a slide and cover it with a coverslip.\n/square6Observe the slide under a microscope.\n/square6Wet a slice of br ead, and keep it in a cool, moist and dark place.\n/square6Observe the surface of the slice with a magnifying glass.\n/square6Record your observations for a week.\nCompare and contrast the ways in which yeast grows in the first\ncase, and how mould grows in the second.\nHaving discussed the context in which reproductive processes work,\nlet us now examine how different organisms actually reproduce. The\nmodes by which various organisms reproduce depend on the body\ndesign of the organisms.\n7.2.1 Fission\nFor unicellular organisms, cell division, or fission, leads to the creation\nof new individuals. Many different patterns of fission have been observed.\nMany bacteria and protozoa simply split into two equal halves during\ncell division. In organisms such as Amoeba, the splitting of the two cells\nduring division can take place in any plane.\nActivity 7.3Activity 7.3Activity 7.3Activity 7.3Activity 7.3\n/square6Observe a permanent slide of\nAmoeba under a microscope.\n/square6Similarly observe another\npermanent slide of Amoeba\nshowing binary fission.\n/square6Now, compare the observations of\nboth the slides.\nHowever, some unicellular or ganisms\nshow somewhat more organisation of their\nbodies, such as is seen in Leishmania (which\ncause kala-azar), which have a whip-like\nstructure at one end of the cell. In such\norganisms, binary fission occurs in a definite orientation in relation to\nFigure 7.1(b)Figure 7.1(b)Figure 7.1(b)Figure 7.1(b)Figure 7.1(b)  Binary fission in Leishmania\n  (a)         (b)          (c)          (d)            (e)                        (f)\n2024-25\n\n--- Page 4 ---\nScience116\nthese structures. Other single-celled organisms, such as the malarial\nparasite, Plasmodium , divide into many daughter cells simultaneously\nby multiple fission.\nYeast, on the other hand, can put out small buds that separate and\ngrow further, as we saw in Activity 7.1.\n7.2.2 Fragmentation\nFigure 7.2Figure 7.2Figure 7.2Figure 7.2Figure 7.2\nMultiple fission in\nPlasmodium\nActivity 7.4Activity 7.4Activity 7.4Activity 7.4Activity 7.4\n/square6Collect water from a lake or pond that appears dark green and\ncontains filamentous structures.\n/square6Put one or two filaments on a slide.\n/square6Put a drop of glycerine on these filaments and cover it with a coverslip.\n/square6Observe the slide under a microscope.\n/square6Can you identify different tissues in the Spirogyra filaments?\nIn multi-cellular organisms with relatively simple body organisation,\nsimple reproductive methods can still work. Spirogyra, for example,\nsimply breaks up into smaller pieces upon maturation. These pieces or\nfragments grow into new individuals. Can we work out the reason for\nthis, based on what we saw in Activity 7.4?\nThis is not true for all multi-cellular organisms. They cannot simply\ndivide cell-by-cell. The reason is that many multi-cellular organisms, as\nwe have seen, are not simply a random collection of cells. Specialised\ncells are organised as tissues, and tissues are organised into organs,\nwhich then have to be placed at definite positions in the body. In such a\ncarefully organised situation, cell-by-cell division would be impractical.\nMulti-cellular organisms, therefore, need to use more complex ways of\nreproduction.\nA basic strategy used in multi-cellular organisms is that different\ncell types perform different specialised functions. Following this general\npattern, reproduction in such organisms is also the function of a specific\ncell type. How is reproduction to be achieved from a single cell type, if\nthe organism itself consists of many cell types? The answer is that there\nmust be a single cell type in the organism that is capable of growing,\nproliferating and making other cell types under the right circumstances.\n7.2.3 Regeneration\nMany fully differentiated organisms have the ability to give rise to new\nindividual organisms from their body parts. That is, if the individual is\nsomehow cut or broken up into many pieces, many of these pieces grow\ninto separate individuals. For example, simple animals like Hydra and\nPlanaria can be cut into any number of pieces and each piece grows\ninto a complete organism. This is known as regeneration (see Fig. 7.3).\nRegeneration is carried out by specialised cells. These cells proliferate\nand make large numbers of cells. From this mass of cells, different cells\nundergo changes to become various cell types and tissues. These changes\n2024-25\n\n--- Page 5 ---\nHow do Organisms Reproduce? 117\nFigure 7.3 Figure 7.3 Figure 7.3 Figure 7.3 Figure 7.3 Regeneration in Planaria\ntake place in an organised\nsequence referred to as\ndevelopment. However ,\nregeneration is not the same\nas reproduction, since most\norganisms would not\nnormally depend on being cut\nup to be able to reproduce.\n7.2.4 Budding\nOrganisms such as Hydra\nuse regenerative cells for\nreproduction in the process of\nbudding. In Hydra, a bud\ndevelops as an outgrowth due\nto repeated cell division at one\nspecific site (Fig. 7.4). These buds develop into tiny individuals and when\nfully mature, detach from the parent body and become new independent\nindividuals.\nFigure 7.4Figure 7.4Figure 7.4Figure 7.4Figure 7.4  Budding in Hydra\n7.2.5 Vegetative Propagation\nThere are many plants in which parts like the root, stem and leaves\ndevelop into new plants under appropriate conditions. Unlike in most\nanimals, plants can indeed use such a mode for reproduction. This\nproperty of vegetative propagation is used in methods such as layering\nor grafting to grow many plants like sugarcane, roses, or grapes for\nagricultural purposes. Plants raised by vegetative propagation can bear\nflowers and fruits earlier than those produced from seeds. Such methods\nalso make possible the propagation of plants such as banana, orange,\nrose and jasmine that have lost the capacity to produce seeds. Another\nadvantage of vegetative propagation is that all plants produced are\ngenetically similar enough to the parent plant to have all its\ncharacteristics.\n2024-25\n\n--- Page 6 ---\nScience118\nSimilarly buds produced in the notches along the leaf\nmargin of Bryophyllum  fall on the soil and develop into\nnew plants (Fig. 7.5).\nActivity 7.6Activity 7.6Activity 7.6Activity 7.6Activity 7.6\n/square6Select a money-plant.\n/square6Cut some pieces such that they contain at least\none leaf.\n/square6Cut out some other portions between two leaves.\n/square6Dip one end of all the pieces in water and observe\nover the next few days.\n/square6Which ones grow and give rise to fresh leaves?\n/square6What can you conclude from your observations?\nTissue cultur e\nIn tissue culture, new plants are grown by removing tissue or separating cells from\nthe growing tip of a plant. The cells are then placed in an artificial medium where they\ndivide rapidly to form a small group of cells or callus. The callus is transferred to\nanother medium containing hormones for growth and differentiation. The plantlets\nare then placed in the soil so that they can grow into mature plants. Using tissue\nculture, many plants can be grown from one parent in disease-free conditions. This\ntechnique is commonly used for ornamental plants.\n7.2.6 Spore Formation\nEven in many simple multi-cellular organisms, specific reproductive\nparts can be identified. The thread-like structures that developed on\nthe bread in Activity 7.2 above are the hyphae of the bread mould\n(Rhizopus). They are not reproductive parts. On the other hand, the\ntiny blob-on-a-stick structures are involved in reproduction. The\nblobs are sporangia, which contain cells, or spores, that can\neventually develop into new Rhizopus individuals (Fig. 7.6). The spores\nare covered by thick walls that protect them until they come into\ncontact with another moist surface and can begin to grow.\nFigure 7.6Figure 7.6Figure 7.6Figure 7.6Figure 7.6\nSpore formation in Rhizopus\nActivity 7.5Activity 7.5Activity 7.5Activity 7.5Activity 7.5\n/square6Take a potato and observe its surface. Can notches be seen?\n/square6Cut the potato into small pieces such that some pieces contain a\nnotch or bud and some do not.\n/square6Spread some cotton on a tray and wet it. Place the potato pieces\non this cotton. Note where the pieces with the buds are placed.\n/square6Observe changes taking place in these potato pieces over the next\nfew days. Make sure that the cotton is kept moistened.\n/square6Which are the potato pieces that give rise to fresh green shoots\nand roots?\nFigure 7.5Figure 7.5Figure 7.5Figure 7.5Figure 7.5\nLeaf of Bryophyllum\nwith buds\nMore to Know?\n2024-25\n\n--- Page 7 ---\nHow do Organisms Reproduce? 119\nAll the modes of reproduction that we have discussed so far allow\nnew generations to be created from a single individual. This is known as\nasexual reproduction.\nQUESTIONS\n?"
    },
    {
      "id": "25899665-e6cc-4297-90eb-8e52e8774fc1",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 5,
      "title": "3. Can you think of reasons why more complex organisms cannot give",
      "topics": [],
      "start_page": 6,
      "end_page": 6,
      "content": "rise to new individuals through regeneration?"
    },
    {
      "id": "87138ecb-4133-41e4-97b7-c04b8be401eb",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 6,
      "title": "4. Why is vegetative propagation practised for growing some types of",
      "topics": [],
      "start_page": 6,
      "end_page": 6,
      "content": "plants?"
    },
    {
      "id": "7edb7689-9ca0-45a5-8c94-da689d11e3ff",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 7,
      "title": "5. Why is DNA copying an essential part of the process of reproduction?",
      "topics": [],
      "start_page": 6,
      "end_page": 14,
      "content": "7.3 SEXUAL REPRODUCTION7.3 SEXUAL REPRODUCTION7.3 SEXUAL REPRODUCTION7.3 SEXUAL REPRODUCTION7.3 SEXUAL REPRODUCTION\nWe are also familiar with modes of r eproduction that depend on the\ninvolvement of two individuals before a new generation can be created.\nBulls alone cannot produce new calves, nor can hens alone produce\nnew chicks. In such cases, both sexes, males and females, are needed to\nproduce new generations. What is the significance of this sexual mode\nof reproduction? Are there any limitations of the asexual mode of\nreproduction, which we have been discussing above?\n7.3.1 Why the Sexual Mode of Reproduction?\nThe creation of two new cells from one involves copying of the DNA as\nwell as of the cellular apparatus. The DNA copying mechanism, as we\nhave noted, cannot be absolutely accurate, and the resultant errors are\na source of variations in populations of organisms. Every individual\norganism cannot be protected by variations, but in a population,\nvariations are useful for ensuring the survival of the species. It would\ntherefore make sense if organisms came up with reproductive modes\nthat allowed more and more variation to be generated.\nWhile DNA-copying mechanisms are not absolutely accurate, they\nare precise enough to make the generation of variation a fairly slow\nprocess. If the DNA copying mechanisms were to be less accurate, many\nof the resultant DNA copies would not be able to work with the cellular\napparatus, and would die. So how can the process of making variants\nbe speeded up? Each new variation is made in a DNA copy that already\nhas variations accumulated from previous generations. Thus, two\ndifferent individuals in a population would have quite different patterns\nof accumulated variations. Since all of these variations are in living\nindividuals, it is assured that they do not have any really bad effects.\nCombining variations from two or more individuals would thus create\nnew combinations of variants. Each combination would be novel, since\nit would involve two different individuals. The sexual mode of\n2024-25\n\n--- Page 8 ---\nScience120\nreproduction incorporates such a process of combining DNA from two\ndifferent individuals during reproduction.\nBut this creates a major difficulty. If each new generation is to be the\ncombination of the DNA copies from two pre-existing individuals, then\neach new generation will end up having twice the amount of DNA that\nthe previous generation had. This is likely to mess up the control of the\ncellular apparatus by the DNA. How many ways can we think of for\nsolving this difficulty?\nWe have seen earlier that as organisms become mor\ne complex, the\nspecialisation of tissue increases. One solution that many multi-cellular\norganisms have found for the problem mentioned above is to have special\nlineages of cells in specialised organs in which only half the number of\nchromosomes and half the amount of DNA as compared to the non-\nreproductive body cells. This is achieved by a process of cell division\ncalled meiosis. Thus, when these germ-cells from two individuals combine\nduring sexual reproduction to form a new individual, it results in re-\nestablishment of the number of chromosomes and the DNA content in\nthe new generation.\nIf the zygote is to grow and develop into an organism which has\nhighly specialised tissues and organs, then it has to have sufficient stores\nof energy for doing this. In very simple organisms, it is seen that the two\ngerm-cells are not very different from one another, or may even be similar.\nBut as the body designs become more complex, the germ-cells also\nspecialise. One germ-cell is large and contains the food-stores while the\nother is smaller and likely to be motile. Conventionally, the motile germ-\ncell is called the male gamete and the germ-cell containing the stored\nfood is called the female gamete. We shall see in the next few sections\nhow the need to create these two different types of gametes give rise to\ndifferences in the male and female reproductive organs and, in some\ncases, differences in the bodies of the male and female organisms.\n7.3.2 Sexual Reproduction in Flowering Plants\nThe reproductive parts of angiosperms are located in the flower. You\nhave already studied the different parts of a flower – sepals, petals,\nstamens and pistil. Stamens and pistil are\nthe reproductive parts of a flower which\ncontain the germ-cells.  What possible\nfunctions could the petals and sepals serve?\nThe flower may be unisexual (papaya,\nwatermelon) when it contains either stamens\nor pistil or bisexual ( Hibiscus, mustard)\nwhen it contains both stamens and pistil.\nStamen is the male reproductive part and it\nproduces pollen grains that are yellowish\nin colour. You must have seen this yellowish\npowder that often sticks to our hands if we\ntouch the stamen of a flower. Pistil is present\nin the centre of a flower and is the female\nreproductive part. It is made of three parts.\nFigure 7.7Figure 7.7Figure 7.7Figure 7.7Figure 7.7\nLongitudinal section of\nflower\n2024-25\n\n--- Page 9 ---\nHow do Organisms Reproduce? 121\nFigure 7.8Figure 7.8Figure 7.8Figure 7.8Figure 7.8\nGermination of pollen on\nstigma\nThe swollen bottom part is the ovary, middle elongated part is the style\nand the terminal part which may be sticky is the stigma. The ovary\ncontains ovules and each ovule has an egg cell. The male germ-cell\nproduced by pollen grain fuses with the female gamete present in\nthe ovule. This fusion of the germ-cells or fertilisation gives us the\nzygote which is capable of growing into a new plant.\nThus the pollen needs to be transferred from the stamen to the\nstigma. If this transfer of pollen occurs in the same flower , it is\nreferred to as self-pollination. On the other hand, if the pollen is\ntransferred fr om one flower to another , it is known as cr oss-\npollination. This transfer of pollen from one flower to another is\nachieved by agents like wind, water or animals.\nAfter the pollen lands on a suitable stigma, it has to reach the\nfemale germ-cells which are in the ovary. For this, a tube grows\nout of the pollen grain and travels through the style to reach the\novary.\nAfter fertilisation, the zygote divides several times to form an\nembryo within the ovule. The ovule develops a tough coat and is\ngradually converted into a seed. The ovary grows rapidly and ripens\nto form a fruit. Meanwhile, the petals, sepals, stamens, style and\nstigma may shrivel and fall off. Have you ever observed any flower\npart still persisting in the fruit? Try and work out the advantages\nof seed-formation for the plant. The seed contains the future plant\nor embryo which develops into a seedling under appropriate\nconditions. This process is known as germination.\nActivity 7.7Activity 7.7Activity 7.7Activity 7.7Activity 7.7\n/square6Soak a few seeds of Bengal gram ( chana)\nand keep them overnight.\n/square6Drain the excess water and cover the seeds\nwith a wet cloth and leave them for a day.\nMake sure that the seeds do not become dry.\n/square6Cut open the seeds carefully and observe\nthe different parts.\n/square6Compare your observations with the Fig. 7.9\nand see if you can identify all the parts.\n7.3.3 Reproduction in Human Beings\nSo far, we have been discussing the variety of modes that different species\nuse for reproduction. Let us now look at the species that we are most\ninterested in, namely, humans. Humans use a sexual mode of\nreproduction. How does this process work?\nLet us begin at an apparently unrelated point. All of us know that\nour bodies change as we become older. You have learnt changes that\ntake place in your body earlier in Class VIII also. W e notice that our\nheight has increased continuously fr\nom early age till now. We acquire\nteeth, we even lose the old, so-called milk teeth and acquire new ones.\nFigure 7.9Figure 7.9Figure 7.9Figure 7.9Figure 7.9\nGermination\n2024-25\n\n--- Page 10 ---\nScience122\nAll of these are changes that can be grouped under the general process\nof growth, in which the body becomes larger. But in early teenage years,\na whole new set of changes occurs that cannot be explained simply as\nbody enlargement. Instead, the appearance of the body changes.\nProportions change, new features appear, and so do new sensations.\nSome of these changes are common to both boys and girls. We begin\nto notice thick hair growing in new parts of the body such as armpits\nand the genital area between the thighs, which can also become darker\nin colour. Thinner hair can also appear on legs and arms, as well as on\nthe face. The skin frequently becomes oily and we might begin to develop\npimples. We begin to be conscious and aware of both our own bodies\nand those of others in new ways.\nOn the other hand, there are also changes taking place that are\ndifferent between boys and girls. In girls, breast size begins to increase,\nwith darkening of the skin of the nipples at the tips of the breasts. Also,\ngirls begin to menstruate at around this time. Boys begin to have new\nthick hair growth on the face and their voices begin to crack. Further,\nthe penis occasionally begins to become enlarged and erect, either in\ndaydreams or at night.\nAll of these changes take place slowly, over a period of months and\nyears. They do not happen all at the same time in one person, nor do\nthey happen at an exact age. In some people, they happen early and\nquickly, while in others, they can happen slowly. Also, each change does\nnot become complete quickly either. So, for example, thick hair on the\nface in boys appears as a few scattered hairs first, and only slowly does\nthe growth begin to become uniform. Even so, all these changes show\ndifferences between people. Just as we have differently shaped noses or\nfingers, so also we have different patterns of hair growth, or size and\nshape of breast or penis. All of these changes are aspects of the sexual\nmaturation of the body.\nWhy does the body show sexual maturation at this age? W e have\ntalked about the need for specialised cell types in multi-cellular bodies\nto carry out specialised functions. The creation of germ-cells to participate\nin sexual reproduction is another specialised function, and we have seen\nthat plants develop special cell and tissue types to create them. Human\nbeings also develop special tissues for this purpose. However, while the\nbody of the individual organism is growing to its adult size, the resources\nof the body are mainly directed at achieving this growth. While that is\nhappening, the maturation of the reproductive tissue is not likely to be\na major priority. Thus, as the rate of general body growth begins to slow\ndown, reproductive tissues begin to mature. This period during\nadolescence is called puberty.\nSo how do all the changes that we have talked about link to the\nreproductive process? We must r emember that the sexual mode of\nreproduction means that germ-cells from two individuals have to join\ntogether. This can happen by the external release of germ-cells from the\nbodies of individuals, as happens in flowering plants. Or it can happen\nby two individuals joining their bodies together for internal transfer of\ngerm-cells for fusion, as happens in many animals. If animals are to\n2024-25\n\n--- Page 11 ---\nHow do Organisms Reproduce? 123\nparticipate in this process of mating, their state of sexual maturity must\nbe identifiable by other individuals. Many changes during puberty, such\nas new hair-growth patterns, are signals that sexual maturation is taking\nplace.\nOn the other hand, the actual transfer of germ-cells between two\npeople needs special organs for the sexual act, such as the penis when it\nis capable of becoming erect. In mammals such as humans, the baby is\ncarried in the mother’s body for a long period, and will be breast-fed\nlater. The female reproductive organs and breasts will need to mature to\naccommodate these possibilities. Let us look at the systems involved in\nthe process of sexual reproduction.\n7.3.3 (a) Male Reproductive System\nThe male reproductive system (Fig. 7.10)\nconsists of portions which produce the\ngerm-cells and other portions that deliver\nthe germ-cells to the site of fertilisation.\nThe formation of germ-cells or sperms\ntakes place in the testes. These are located\noutside the abdominal cavity in scrotum\nbecause sperm formation requires a lower\ntemperature than the normal body\ntemperature. We have discussed the role of the\ntestes in the secretion of the hormone,\ntestosterone, in the pr evious chapter. In\naddition to regulating the formation of sperms,\ntestosterone brings about changes in\nappearance seen in boys at the time of puberty.\nThe sperms formed are delivered\nthrough the vas deferens which unites with\na tube coming from the urinary bladder. The\nurethra thus forms a common passage for\nboth the sperms and urine. Along the path\nof the vas deferens, glands like the prostate\nand the seminal vesicles add their secretions\nso that the sperms are now in a fluid which\nmakes their transport easier and this fluid\nalso provides nutrition. The sperms are tiny\nbodies that consist of mainly genetic\nmaterial and a long tail that helps them to\nmove towards the female germ-cell.\n7.3.3 (b) Female Reproductive System\nThe female germ-cells or eggs are made in\nthe ovaries. They are also responsible for the\nproduction of some hormones. Look at\nFig. 7.11 and identify the various organs in\nthe female reproductive system.\nFigure 7.10 Figure 7.10 Figure 7.10 Figure 7.10 Figure 7.10 Human– male reproductive system\nFigure 7.11 Figure 7.11 Figure 7.11 Figure 7.11 Figure 7.11 Human –female reproductive system\n2024-25\n\n--- Page 12 ---\nScience124\nWhen a girl is born, the ovaries already contain thousands of\nimmature eggs. On reaching puberty, some of these start maturing. One\negg is produced every month by one of the ovaries. The egg is carried\nfrom the ovary to the womb through a thin oviduct or fallopian tube.\nThe two oviducts unite into an elastic bag-like structure known as the\nuterus. The uterus opens into the vagina through the cervix.\nThe sperms enter through the vaginal passage during sexual\nintercourse. They travel upwards and reach the oviduct where they may\nencounter the egg. The fertilised egg (zygote) starts dividing and form a\nball of cells or embryo. The embryo is implanted in the lining of the uterus\nwhere they continue to grow and develop organs to become foetus. We\nhave seen in earlier sections that the mother’s body is designed to\nundertake the development of the child. Hence the uterus prepares itself\nevery month to receive and nurture the growing embryo. The lining\nthickens and is richly supplied with blood to nourish the growing embryo.\nThe embryo gets nutrition from the mother’s blood with the help of a\nspecial tissue called placenta. This is a disc which is embedded in the\nuterine wall. It contains villi on the embryo’s side of the tissue. On the\nmother’s side are blood spaces, which surround the villi. This provides\na large surface area for glucose and oxygen to pass from the mother to\nthe embryo. The developing embryo will also generate waste substances\nwhich can be removed by transferring them into the mother’s blood\nthrough the placenta. The development of the child inside the mother’s\nbody takes approximately nine months. The child is born as a result of\nrhythmic contractions of the muscles in the uterus.\n7.3.3 (c) What happens when the Egg is not F ertilised?\nIf the egg is not fertilised, it lives for about one day. Since the ovary\nreleases one egg every month, the uterus also prepares itself every month\nto receive a fertilised egg. Thus its lining becomes thick and spongy.\nThis would be required for nourishing the embryo if fertilisation had\ntaken place. Now, however, this lining is not needed any longer. So, the\nlining slowly breaks and comes out through the vagina as blood and\nmucous. This cycle takes place roughly every month and is known as\nmenstruation. It usually lasts for about two to eight days.\n7.3.3 (d) Reproductive Health\nAs we have seen, the process of sexual maturation is gradual, and takes\nplace while general body growth is still going on. Therefore, some degree\nof sexual maturation does not necessarily mean that the body or the\nmind is ready for sexual acts or for having and bringing up children.\nHow do we decide if the body or the mind is ready for this major\nresponsibility? All of us are under many different kinds of pressures\nabout these issues. There can be pressure from our friends for\nparticipating in many activities, whether we really want to or not. There\ncan be pressure from families to get married and start having children.\nThere can be pressure from government agencies to avoid having\nchildren. In this situation, making choices can become very difficult.\n2024-25\n\n--- Page 13 ---\nHow do Organisms Reproduce? 125\nWe must also consider the possible health consequences of having\nsex. We have discussed in Class IX that diseases can be transmitted\nfrom person to person in a variety of ways. Since the sexual act is a\nvery intimate connection of bodies, it is not surprising that many\ndiseases can be sexually transmitted. These include bacterial infections\nsuch as gonorrhoea and syphilis, and viral infections such as warts\nand HIV-AIDS. Is it possible to prevent the transmission of such diseases\nduring the sexual act? Using a covering, called a condom, for the penis\nduring sex helps to prevent transmission of many of these infections to\nsome extent.\nThe sexual act always has the potential to lead to pregnancy.\nPregnancy will make major demands on the body and the mind of the\nwoman, and if she is not ready for it, her health will be adversely\naffected. Therefore, many ways have been devised to avoid pregnancy.\nThese contraceptive methods fall in a number of categories. One\ncategory is the creation of a mechanical barrier so that sperm does not\nreach the egg. Condoms on the penis or similar coverings worn in the\nvagina can serve this purpose. Another category of contraceptives acts\nby changing the hormonal balance of the body so that eggs are not\nreleased and fertilisation cannot occur . These drugs commonly need\nto be taken orally as pills. However , since they change hor monal\nbalances, they can cause side-effects too. Other contraceptive devices\nsuch as the loop or the copper -T are placed in the uterus to pr event\npregnancy. Again, they can cause side effects due to irritation of the\nuterus. If the vas deferens in the male is blocked, sperm transfer will\nbe prevented. If the fallopian tube in the female is blocked, the egg will\nnot be able to reach the uterus. In both cases fertilisation will not take\nplace. Surgical methods can be used to create such blocks. While\nsurgical methods are safe in the long run, surgery itself can cause\ninfections and other problems if not performed properly. Surgery can\nalso be used for removal of unwanted pregnancies. These may be\nmisused by people who do not want a particular child, as happens in\nillegal sex-selective abortion of female foetuses. For a healthy society,\nthe female-male sex ratio must be maintained. Because of reckless\nfemale foeticides, child sex ratio is declining at an alarming rate in\nsome sections of our society, although prenatal sex determination has\nbeen prohibited by law.\nWe have noted earlier that r eproduction is the pr\nocess by which\norganisms increase their populations. The rates of birth and death in a\ngiven population will determine its size. The size of the human population\nis a cause for concern for many people. This is because an expanding\npopulation makes it harder to improve everybody’s standard of living.\nHowever, if inequality in society is the main reason for poor standards of\nliving for many people, the size of the population is relatively unimportant.\nIf we look around us, what can we identify as the most important\nreason(s) for poor living standards?\n2024-25\n\n--- Page 14 ---\nScience126\nWhat you have learnt\n/square6Reproduction, unlike other life processes, is not essential to maintain the life of an\nindividual organism.\n/square6Reproduction involves creation of a DNA copy and additional cellular apparatus\nby the cell involved in the process.\n/square6Various organisms use different modes of reproduction depending on their body\ndesign.\n/square6In fission, many bacteria and protozoa simply divide into two or more daughter\ncells.\n/square6Organisms such as hydra can regenerate if they are broken into pieces. They can\nalso give out buds which mature into new individuals.\n/square6Roots, stems and leaves of some plants develop into new plants through vegetative\npropagation.\n/square6These are examples of asexual reproduction where new generations are created\nfrom a single individual.\n/square6Sexual reproduction involves two individuals for the creation of a new individual.\n/square6DNA copying mechanisms creates variations which are useful for ensuring the\nsurvival of the species. Modes of sexual reproduction allow for greater variation to\nbe generated.\n/square6Reproduction in flowering plants involves transfer of pollen grains from the anther\nto the stigma which is referred to as pollination. This is followed by fertilisation.\n/square6Changes in the body at puberty, such as increase in breast size in girls and new\nfacial hair growth in boys, are signs of sexual maturation.\n/square6The male reproductive system in human beings consists of testes which produce\nsperms, vas deferens, seminal vesicles, prostate gland, urethra and penis.\n/square6The female reproductive system in human beings consists of ovaries, fallopian\ntubes, uterus and vagina.\n/square6Sexual reproduction in human beings involves the introduction of sperm in the\nvagina of the female. Fertilisation occurs in the fallopian tube.\n/square6Contraception to avoid pregnancy can be achieved by the use of condoms, oral\npills, copper-T and other methods.\nQUESTIONS\n?"
    },
    {
      "id": "1b25e83e-054b-4908-bc39-78ce65d36926",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 12,
      "title": "5. If a woman is using a copper -T, will it help in pr otecting her fr om",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "sexually transmitted diseases?\n2024-25\n\n--- Page 15 ---\nHow do Organisms Reproduce? 127\nEXERCISES"
    },
    {
      "id": "4def76cc-8ce5-4cf8-b628-b06e0638a889",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 13,
      "title": "1. Asexual reproduction takes place through budding in",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "(a) Amoeba.\n(b) Yeast.\n(c) Plasmodium.\n(d) Leishmania."
    },
    {
      "id": "2c992f03-3533-45ae-ab9d-793de57f405c",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 14,
      "title": "2. Which of the following is not a part of the female reproductive system in human",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "beings?\n(a) Ovary\n(b) Uterus\n(c) Vas deferens\n(d) Fallopian tube"
    },
    {
      "id": "3e480636-f604-495e-a519-073afdb884d2",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 15,
      "title": "3. The anther contains",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "(a) sepals.\n(b) ovules.\n(c) pistil.\n(d) pollen grains."
    },
    {
      "id": "74407d0e-913c-497c-8555-9726c93b481a",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 21,
      "title": "9. How are the modes for reproduction different in unicellular and",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "multicellular organisms?"
    },
    {
      "id": "7d81d312-816f-428d-9ac6-fb1c0272d4d9",
      "textbook_id": "be9deace-4b71-450f-a2e5-fc09cb451dbd",
      "chapter_number": 23,
      "title": "11. What could be the reasons for adopting contraceptive methods?",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "cb12b1c0-a796-4dc4-90bc-54036b26cb68",
      "chapter_id": "55858a2b-564e-4410-bc97-c7a2dfc97839",
      "chunk_index": 0,
      "content": "for the individual?\n2024-25\n\n--- Page 3 ---\nHow do Organisms Reproduce? 115\nFigure 7.1(a)Figure 7.1(a)Figure 7.1(a)Figure 7.1(a)Figure 7.1(a)  Binary fission in Amoeba\nActivity 7.2Activity 7.2Activity 7.2Activity 7.2Activity 7.2\n7.2 MODES OF REPRODUCTION USED BY SINGLE7.2 MODES OF REPRODUCTION USED BY SINGLE7.2 MODES OF REPRODUCTION USED BY SINGLE7.2 MODES OF REPRODUCTION USED BY SINGLE7.2 MODES OF REPRODUCTION USED BY SINGLE\nORGANISMSORGANISMSORGANISMSORGANISMSORGANISMS\nActivity 7.1Activity 7.1Activity 7.1Activity 7.1Activity 7.1\n/square6Dissolve about 10 gm of sugar in 100 mL of water .\n/square6Take 20 mL of this solution in a test tube and add a pinch of yeast\ngranules to it.\n/square6Put a cotton plug on the mouth of the test tube and keep it in a\nwarm place.\n/square6After 1 or 2 hours, put a small drop of yeast culture from the test\ntube on a slide and cover it with a coverslip.\n/square6Observe the slide under a microscope.\n/square6Wet a slice of br ead, and keep it in a cool, moist and dark place.\n/square6Observe the surface of the slice with a magnifying glass.\n/square6Record your observations for a week.\nCompare and contrast the ways in which yeast grows in the first\ncase, and how mould grows in the second.\nHaving discussed the context in which reproductive processes work,\nlet us now examine how different organisms actually reproduce. The\nmodes by which various organisms reproduce depend on the body\ndesign of the organisms.\n7.2.1 Fission\nFor unicellular organisms, cell division, or fission, leads to the creation\nof new individuals. Many different patterns of fission have been observed.\nMany bacteria and protozoa simply split into two equal halves during\ncell division. In organisms such as Amoeba, the splitting of the two cells\nduring division can take place in any plane.\nActivity 7.3Activity 7.3Activity 7.3Activity 7.3Activity 7.3\n/square6Observe a permanent slide of\nAmoeba under a microscope.\n/square6Similarly observe another\npermanent slide of Amoeba\nshowing binary fission.\n/square6Now, compare the observations of\nboth the slides.\nHowever, some unicellular or ganisms\nshow somewhat more organisation of their\nbodies, such as is seen in Leishmania (which\ncause kala-azar), which have a whip-like\nstructure at one end of the cell. In such\norganisms, binary fission occurs in a definite orientation in relation to\nFigure 7.1(b)Figure 7.1(b)Figure 7.1(b)Figure 7.1(b)Figure 7.1(b)  Binary fission in Leishmania\n  (a)         (b)          (c)          (d)            (e)                        (f)\n2024-25",
      "content_type": "exercise",
      "token_count": 636,
      "page_number": 2
    },
    {
      "id": "47e8c16b-9ab6-4f59-9306-4056e30edb0a",
      "chapter_id": "55858a2b-564e-4410-bc97-c7a2dfc97839",
      "chunk_index": 1,
      "content": "--- Page 4 ---\nScience116\nthese structures. Other single-celled organisms, such as the malarial\nparasite, Plasmodium , divide into many daughter cells simultaneously\nby multiple fission.\nYeast, on the other hand, can put out small buds that separate and\ngrow further, as we saw in Activity 7.1.\n7.2.2 Fragmentation\nFigure 7.2Figure 7.2Figure 7.2Figure 7.2Figure 7.2\nMultiple fission in\nPlasmodium\nActivity 7.4Activity 7.4Activity 7.4Activity 7.4Activity 7.4\n/square6Collect water from a lake or pond that appears dark green and\ncontains filamentous structures.\n/square6Put one or two filaments on a slide.\n/square6Put a drop of glycerine on these filaments and cover it with a coverslip.\n/square6Observe the slide under a microscope.\n/square6Can you identify different tissues in the Spirogyra filaments?\nIn multi-cellular organisms with relatively simple body organisation,\nsimple reproductive methods can still work. Spirogyra, for example,\nsimply breaks up into smaller pieces upon maturation. These pieces or\nfragments grow into new individuals. Can we work out the reason for\nthis, based on what we saw in Activity 7.4?\nThis is not true for all multi-cellular organisms. They cannot simply\ndivide cell-by-cell. The reason is that many multi-cellular organisms, as\nwe have seen, are not simply a random collection of cells. Specialised\ncells are organised as tissues, and tissues are organised into organs,\nwhich then have to be placed at definite positions in the body. In such a\ncarefully organised situation, cell-by-cell division would be impractical.\nMulti-cellular organisms, therefore, need to use more complex ways of\nreproduction.\nA basic strategy used in multi-cellular organisms is that different\ncell types perform different specialised functions. Following this general\npattern, reproduction in such organisms is also the function of a specific\ncell type. How is reproduction to be achieved from a single cell type, if\nthe organism itself consists of many cell types? The answer is that there\nmust be a single cell type in the organism that is capable of growing,\nproliferating and making other cell types under the right circumstances.\n7.2.3 Regeneration\nMany fully differentiated organisms have the ability to give rise to new\nindividual organisms from their body parts. That is, if the individual is\nsomehow cut or broken up into many pieces, many of these pieces grow\ninto separate individuals. For example, simple animals like Hydra and\nPlanaria can be cut into any number of pieces and each piece grows\ninto a complete organism. This is known as regeneration (see Fig. 7.3).\nRegeneration is carried out by specialised cells. These cells proliferate\nand make large numbers of cells. From this mass of cells, different cells\nundergo changes to become various cell types and tissues. These changes\n2024-25",
      "content_type": "example",
      "token_count": 706,
      "page_number": 2
    },
    {
      "id": "3c5543e8-f90a-41a6-a22d-ad01c5593c14",
      "chapter_id": "55858a2b-564e-4410-bc97-c7a2dfc97839",
      "chunk_index": 2,
      "content": "--- Page 5 ---\nHow do Organisms Reproduce? 117\nFigure 7.3 Figure 7.3 Figure 7.3 Figure 7.3 Figure 7.3 Regeneration in Planaria\ntake place in an organised\nsequence referred to as\ndevelopment. However ,\nregeneration is not the same\nas reproduction, since most\norganisms would not\nnormally depend on being cut\nup to be able to reproduce.\n7.2.4 Budding\nOrganisms such as Hydra\nuse regenerative cells for\nreproduction in the process of\nbudding. In Hydra, a bud\ndevelops as an outgrowth due\nto repeated cell division at one\nspecific site (Fig. 7.4). These buds develop into tiny individuals and when\nfully mature, detach from the parent body and become new independent\nindividuals.\nFigure 7.4Figure 7.4Figure 7.4Figure 7.4Figure 7.4  Budding in Hydra\n7.2.5 Vegetative Propagation\nThere are many plants in which parts like the root, stem and leaves\ndevelop into new plants under appropriate conditions. Unlike in most\nanimals, plants can indeed use such a mode for reproduction. This\nproperty of vegetative propagation is used in methods such as layering\nor grafting to grow many plants like sugarcane, roses, or grapes for\nagricultural purposes. Plants raised by vegetative propagation can bear\nflowers and fruits earlier than those produced from seeds. Such methods\nalso make possible the propagation of plants such as banana, orange,\nrose and jasmine that have lost the capacity to produce seeds. Another\nadvantage of vegetative propagation is that all plants produced are\ngenetically similar enough to the parent plant to have all its\ncharacteristics.\n2024-25",
      "content_type": "text",
      "token_count": 389,
      "page_number": 2
    },
    {
      "id": "884c53b1-6c19-48eb-af50-2de961e26402",
      "chapter_id": "55858a2b-564e-4410-bc97-c7a2dfc97839",
      "chunk_index": 3,
      "content": "--- Page 6 ---\nScience118\nSimilarly buds produced in the notches along the leaf\nmargin of Bryophyllum  fall on the soil and develop into\nnew plants (Fig. 7.5).\nActivity 7.6Activity 7.6Activity 7.6Activity 7.6Activity 7.6\n/square6Select a money-plant.\n/square6Cut some pieces such that they contain at least\none leaf.\n/square6Cut out some other portions between two leaves.\n/square6Dip one end of all the pieces in water and observe\nover the next few days.\n/square6Which ones grow and give rise to fresh leaves?\n/square6What can you conclude from your observations?\nTissue cultur e\nIn tissue culture, new plants are grown by removing tissue or separating cells from\nthe growing tip of a plant. The cells are then placed in an artificial medium where they\ndivide rapidly to form a small group of cells or callus. The callus is transferred to\nanother medium containing hormones for growth and differentiation. The plantlets\nare then placed in the soil so that they can grow into mature plants. Using tissue\nculture, many plants can be grown from one parent in disease-free conditions. This\ntechnique is commonly used for ornamental plants.\n7.2.6 Spore Formation\nEven in many simple multi-cellular organisms, specific reproductive\nparts can be identified. The thread-like structures that developed on\nthe bread in Activity 7.2 above are the hyphae of the bread mould\n(Rhizopus). They are not reproductive parts. On the other hand, the\ntiny blob-on-a-stick structures are involved in reproduction. The\nblobs are sporangia, which contain cells, or spores, that can\neventually develop into new Rhizopus individuals (Fig. 7.6). The spores\nare covered by thick walls that protect them until they come into\ncontact with another moist surface and can begin to grow.\nFigure 7.6Figure 7.6Figure 7.6Figure 7.6Figure 7.6\nSpore formation in Rhizopus\nActivity 7.5Activity 7.5Activity 7.5Activity 7.5Activity 7.5\n/square6Take a potato and observe its surface. Can notches be seen?\n/square6Cut the potato into small pieces such that some pieces contain a\nnotch or bud and some do not.\n/square6Spread some cotton on a tray and wet it. Place the potato pieces\non this cotton. Note where the pieces with the buds are placed.\n/square6Observe changes taking place in these potato pieces over the next\nfew days. Make sure that the cotton is kept moistened.\n/square6Which are the potato pieces that give rise to fresh green shoots\nand roots?\nFigure 7.5Figure 7.5Figure 7.5Figure 7.5Figure 7.5\nLeaf of Bryophyllum\nwith buds\nMore to Know?\n2024-25\n\n--- Page 7 ---\nHow do Organisms Reproduce? 119\nAll the modes of reproduction that we have discussed so far allow\nnew generations to be created from a single individual. This is known as\nasexual reproduction.\nQUESTIONS\n?",
      "content_type": "exercise",
      "token_count": 684,
      "page_number": 6
    },
    {
      "id": "b559a919-e7e5-48e3-b924-09f713a70b30",
      "chapter_id": "25899665-e6cc-4297-90eb-8e52e8774fc1",
      "chunk_index": 0,
      "content": "rise to new individuals through regeneration?",
      "content_type": "text",
      "token_count": 11,
      "page_number": 6
    },
    {
      "id": "c6ad62ac-a653-4b18-90cd-7c4505ba2465",
      "chapter_id": "87138ecb-4133-41e4-97b7-c04b8be401eb",
      "chunk_index": 0,
      "content": "plants?",
      "content_type": "text",
      "token_count": 1,
      "page_number": 6
    },
    {
      "id": "091c806f-d67c-481a-a40e-fe804e0195fc",
      "chapter_id": "7edb7689-9ca0-45a5-8c94-da689d11e3ff",
      "chunk_index": 0,
      "content": "7.3 SEXUAL REPRODUCTION7.3 SEXUAL REPRODUCTION7.3 SEXUAL REPRODUCTION7.3 SEXUAL REPRODUCTION7.3 SEXUAL REPRODUCTION\nWe are also familiar with modes of r eproduction that depend on the\ninvolvement of two individuals before a new generation can be created.\nBulls alone cannot produce new calves, nor can hens alone produce\nnew chicks. In such cases, both sexes, males and females, are needed to\nproduce new generations. What is the significance of this sexual mode\nof reproduction? Are there any limitations of the asexual mode of\nreproduction, which we have been discussing above?\n7.3.1 Why the Sexual Mode of Reproduction?\nThe creation of two new cells from one involves copying of the DNA as\nwell as of the cellular apparatus. The DNA copying mechanism, as we\nhave noted, cannot be absolutely accurate, and the resultant errors are\na source of variations in populations of organisms. Every individual\norganism cannot be protected by variations, but in a population,\nvariations are useful for ensuring the survival of the species. It would\ntherefore make sense if organisms came up with reproductive modes\nthat allowed more and more variation to be generated.\nWhile DNA-copying mechanisms are not absolutely accurate, they\nare precise enough to make the generation of variation a fairly slow\nprocess. If the DNA copying mechanisms were to be less accurate, many\nof the resultant DNA copies would not be able to work with the cellular\napparatus, and would die. So how can the process of making variants\nbe speeded up? Each new variation is made in a DNA copy that already\nhas variations accumulated from previous generations. Thus, two\ndifferent individuals in a population would have quite different patterns\nof accumulated variations. Since all of these variations are in living\nindividuals, it is assured that they do not have any really bad effects.\nCombining variations from two or more individuals would thus create\nnew combinations of variants. Each combination would be novel, since\nit would involve two different individuals. The sexual mode of\n2024-25",
      "content_type": "text",
      "token_count": 515,
      "page_number": 6
    },
    {
      "id": "a2a1b572-309a-423c-aee0-df82f3c4df8e",
      "chapter_id": "7edb7689-9ca0-45a5-8c94-da689d11e3ff",
      "chunk_index": 1,
      "content": "--- Page 8 ---\nScience120\nreproduction incorporates such a process of combining DNA from two\ndifferent individuals during reproduction.\nBut this creates a major difficulty. If each new generation is to be the\ncombination of the DNA copies from two pre-existing individuals, then\neach new generation will end up having twice the amount of DNA that\nthe previous generation had. This is likely to mess up the control of the\ncellular apparatus by the DNA. How many ways can we think of for\nsolving this difficulty?\nWe have seen earlier that as organisms become mor\ne complex, the\nspecialisation of tissue increases. One solution that many multi-cellular\norganisms have found for the problem mentioned above is to have special\nlineages of cells in specialised organs in which only half the number of\nchromosomes and half the amount of DNA as compared to the non-\nreproductive body cells. This is achieved by a process of cell division\ncalled meiosis. Thus, when these germ-cells from two individuals combine\nduring sexual reproduction to form a new individual, it results in re-\nestablishment of the number of chromosomes and the DNA content in\nthe new generation.\nIf the zygote is to grow and develop into an organism which has\nhighly specialised tissues and organs, then it has to have sufficient stores\nof energy for doing this. In very simple organisms, it is seen that the two\ngerm-cells are not very different from one another, or may even be similar.\nBut as the body designs become more complex, the germ-cells also\nspecialise. One germ-cell is large and contains the food-stores while the\nother is smaller and likely to be motile. Conventionally, the motile germ-\ncell is called the male gamete and the germ-cell containing the stored\nfood is called the female gamete. We shall see in the next few sections\nhow the need to create these two different types of gametes give rise to\ndifferences in the male and female reproductive organs and, in some\ncases, differences in the bodies of the male and female organisms.\n7.3.2 Sexual Reproduction in Flowering Plants\nThe reproductive parts of angiosperms are located in the flower. You\nhave already studied the different parts of a flower – sepals, petals,\nstamens and pistil. Stamens and pistil are\nthe reproductive parts of a flower which\ncontain the germ-cells.  What possible\nfunctions could the petals and sepals serve?\nThe flower may be unisexual (papaya,\nwatermelon) when it contains either stamens\nor pistil or bisexual ( Hibiscus, mustard)\nwhen it contains both stamens and pistil.\nStamen is the male reproductive part and it\nproduces pollen grains that are yellowish\nin colour. You must have seen this yellowish\npowder that often sticks to our hands if we\ntouch the stamen of a flower. Pistil is present\nin the centre of a flower and is the female\nreproductive part. It is made of three parts.\nFigure 7.7Figure 7.7Figure 7.7Figure 7.7Figure 7.7\nLongitudinal section of\nflower\n2024-25",
      "content_type": "exercise",
      "token_count": 735,
      "page_number": 6
    },
    {
      "id": "fb474378-4153-43bf-aa8d-be475f9eee14",
      "chapter_id": "7edb7689-9ca0-45a5-8c94-da689d11e3ff",
      "chunk_index": 2,
      "content": "--- Page 9 ---\nHow do Organisms Reproduce? 121\nFigure 7.8Figure 7.8Figure 7.8Figure 7.8Figure 7.8\nGermination of pollen on\nstigma\nThe swollen bottom part is the ovary, middle elongated part is the style\nand the terminal part which may be sticky is the stigma. The ovary\ncontains ovules and each ovule has an egg cell. The male germ-cell\nproduced by pollen grain fuses with the female gamete present in\nthe ovule. This fusion of the germ-cells or fertilisation gives us the\nzygote which is capable of growing into a new plant.\nThus the pollen needs to be transferred from the stamen to the\nstigma. If this transfer of pollen occurs in the same flower , it is\nreferred to as self-pollination. On the other hand, if the pollen is\ntransferred fr om one flower to another , it is known as cr oss-\npollination. This transfer of pollen from one flower to another is\nachieved by agents like wind, water or animals.\nAfter the pollen lands on a suitable stigma, it has to reach the\nfemale germ-cells which are in the ovary. For this, a tube grows\nout of the pollen grain and travels through the style to reach the\novary.\nAfter fertilisation, the zygote divides several times to form an\nembryo within the ovule. The ovule develops a tough coat and is\ngradually converted into a seed. The ovary grows rapidly and ripens\nto form a fruit. Meanwhile, the petals, sepals, stamens, style and\nstigma may shrivel and fall off. Have you ever observed any flower\npart still persisting in the fruit? Try and work out the advantages\nof seed-formation for the plant. The seed contains the future plant\nor embryo which develops into a seedling under appropriate\nconditions. This process is known as germination.\nActivity 7.7Activity 7.7Activity 7.7Activity 7.7Activity 7.7\n/square6Soak a few seeds of Bengal gram ( chana)\nand keep them overnight.\n/square6Drain the excess water and cover the seeds\nwith a wet cloth and leave them for a day.\nMake sure that the seeds do not become dry.\n/square6Cut open the seeds carefully and observe\nthe different parts.\n/square6Compare your observations with the Fig. 7.9\nand see if you can identify all the parts.\n7.3.3 Reproduction in Human Beings\nSo far, we have been discussing the variety of modes that different species\nuse for reproduction. Let us now look at the species that we are most\ninterested in, namely, humans. Humans use a sexual mode of\nreproduction. How does this process work?\nLet us begin at an apparently unrelated point. All of us know that\nour bodies change as we become older. You have learnt changes that\ntake place in your body earlier in Class VIII also. W e notice that our\nheight has increased continuously fr\nom early age till now. We acquire\nteeth, we even lose the old, so-called milk teeth and acquire new ones.\nFigure 7.9Figure 7.9Figure 7.9Figure 7.9Figure 7.9\nGermination\n2024-25",
      "content_type": "text",
      "token_count": 706,
      "page_number": 6
    },
    {
      "id": "6c331c88-5fbe-4dcf-b037-848734234b18",
      "chapter_id": "7edb7689-9ca0-45a5-8c94-da689d11e3ff",
      "chunk_index": 3,
      "content": "--- Page 10 ---\nScience122\nAll of these are changes that can be grouped under the general process\nof growth, in which the body becomes larger. But in early teenage years,\na whole new set of changes occurs that cannot be explained simply as\nbody enlargement. Instead, the appearance of the body changes.\nProportions change, new features appear, and so do new sensations.\nSome of these changes are common to both boys and girls. We begin\nto notice thick hair growing in new parts of the body such as armpits\nand the genital area between the thighs, which can also become darker\nin colour. Thinner hair can also appear on legs and arms, as well as on\nthe face. The skin frequently becomes oily and we might begin to develop\npimples. We begin to be conscious and aware of both our own bodies\nand those of others in new ways.\nOn the other hand, there are also changes taking place that are\ndifferent between boys and girls. In girls, breast size begins to increase,\nwith darkening of the skin of the nipples at the tips of the breasts. Also,\ngirls begin to menstruate at around this time. Boys begin to have new\nthick hair growth on the face and their voices begin to crack. Further,\nthe penis occasionally begins to become enlarged and erect, either in\ndaydreams or at night.\nAll of these changes take place slowly, over a period of months and\nyears. They do not happen all at the same time in one person, nor do\nthey happen at an exact age. In some people, they happen early and\nquickly, while in others, they can happen slowly. Also, each change does\nnot become complete quickly either. So, for example, thick hair on the\nface in boys appears as a few scattered hairs first, and only slowly does\nthe growth begin to become uniform. Even so, all these changes show\ndifferences between people. Just as we have differently shaped noses or\nfingers, so also we have different patterns of hair growth, or size and\nshape of breast or penis. All of these changes are aspects of the sexual\nmaturation of the body.\nWhy does the body show sexual maturation at this age? W e have\ntalked about the need for specialised cell types in multi-cellular bodies\nto carry out specialised functions. The creation of germ-cells to participate\nin sexual reproduction is another specialised function, and we have seen\nthat plants develop special cell and tissue types to create them. Human\nbeings also develop special tissues for this purpose. However, while the\nbody of the individual organism is growing to its adult size, the resources\nof the body are mainly directed at achieving this growth. While that is\nhappening, the maturation of the reproductive tissue is not likely to be\na major priority. Thus, as the rate of general body growth begins to slow\ndown, reproductive tissues begin to mature. This period during\nadolescence is called puberty.\nSo how do all the changes that we have talked about link to the\nreproductive process? We must r emember that the sexual mode of\nreproduction means that germ-cells from two individuals have to join\ntogether. This can happen by the external release of germ-cells from the\nbodies of individuals, as happens in flowering plants. Or it can happen\nby two individuals joining their bodies together for internal transfer of\ngerm-cells for fusion, as happens in many animals. If animals are to\n2024-25",
      "content_type": "example",
      "token_count": 829,
      "page_number": 6
    },
    {
      "id": "f4e3ca08-257e-4a08-a0dd-fba1042f83f8",
      "chapter_id": "7edb7689-9ca0-45a5-8c94-da689d11e3ff",
      "chunk_index": 4,
      "content": "--- Page 11 ---\nHow do Organisms Reproduce? 123\nparticipate in this process of mating, their state of sexual maturity must\nbe identifiable by other individuals. Many changes during puberty, such\nas new hair-growth patterns, are signals that sexual maturation is taking\nplace.\nOn the other hand, the actual transfer of germ-cells between two\npeople needs special organs for the sexual act, such as the penis when it\nis capable of becoming erect. In mammals such as humans, the baby is\ncarried in the mother’s body for a long period, and will be breast-fed\nlater. The female reproductive organs and breasts will need to mature to\naccommodate these possibilities. Let us look at the systems involved in\nthe process of sexual reproduction.\n7.3.3 (a) Male Reproductive System\nThe male reproductive system (Fig. 7.10)\nconsists of portions which produce the\ngerm-cells and other portions that deliver\nthe germ-cells to the site of fertilisation.\nThe formation of germ-cells or sperms\ntakes place in the testes. These are located\noutside the abdominal cavity in scrotum\nbecause sperm formation requires a lower\ntemperature than the normal body\ntemperature. We have discussed the role of the\ntestes in the secretion of the hormone,\ntestosterone, in the pr evious chapter. In\naddition to regulating the formation of sperms,\ntestosterone brings about changes in\nappearance seen in boys at the time of puberty.\nThe sperms formed are delivered\nthrough the vas deferens which unites with\na tube coming from the urinary bladder. The\nurethra thus forms a common passage for\nboth the sperms and urine. Along the path\nof the vas deferens, glands like the prostate\nand the seminal vesicles add their secretions\nso that the sperms are now in a fluid which\nmakes their transport easier and this fluid\nalso provides nutrition. The sperms are tiny\nbodies that consist of mainly genetic\nmaterial and a long tail that helps them to\nmove towards the female germ-cell.\n7.3.3 (b) Female Reproductive System\nThe female germ-cells or eggs are made in\nthe ovaries. They are also responsible for the\nproduction of some hormones. Look at\nFig. 7.11 and identify the various organs in\nthe female reproductive system.\nFigure 7.10 Figure 7.10 Figure 7.10 Figure 7.10 Figure 7.10 Human– male reproductive system\nFigure 7.11 Figure 7.11 Figure 7.11 Figure 7.11 Figure 7.11 Human –female reproductive system\n2024-25",
      "content_type": "text",
      "token_count": 593,
      "page_number": 6
    },
    {
      "id": "5cb61bcd-5caa-4398-be92-e7a8644b7151",
      "chapter_id": "7edb7689-9ca0-45a5-8c94-da689d11e3ff",
      "chunk_index": 5,
      "content": "--- Page 12 ---\nScience124\nWhen a girl is born, the ovaries already contain thousands of\nimmature eggs. On reaching puberty, some of these start maturing. One\negg is produced every month by one of the ovaries. The egg is carried\nfrom the ovary to the womb through a thin oviduct or fallopian tube.\nThe two oviducts unite into an elastic bag-like structure known as the\nuterus. The uterus opens into the vagina through the cervix.\nThe sperms enter through the vaginal passage during sexual\nintercourse. They travel upwards and reach the oviduct where they may\nencounter the egg. The fertilised egg (zygote) starts dividing and form a\nball of cells or embryo. The embryo is implanted in the lining of the uterus\nwhere they continue to grow and develop organs to become foetus. We\nhave seen in earlier sections that the mother’s body is designed to\nundertake the development of the child. Hence the uterus prepares itself\nevery month to receive and nurture the growing embryo. The lining\nthickens and is richly supplied with blood to nourish the growing embryo.\nThe embryo gets nutrition from the mother’s blood with the help of a\nspecial tissue called placenta. This is a disc which is embedded in the\nuterine wall. It contains villi on the embryo’s side of the tissue. On the\nmother’s side are blood spaces, which surround the villi. This provides\na large surface area for glucose and oxygen to pass from the mother to\nthe embryo. The developing embryo will also generate waste substances\nwhich can be removed by transferring them into the mother’s blood\nthrough the placenta. The development of the child inside the mother’s\nbody takes approximately nine months. The child is born as a result of\nrhythmic contractions of the muscles in the uterus.\n7.3.3 (c) What happens when the Egg is not F ertilised?\nIf the egg is not fertilised, it lives for about one day. Since the ovary\nreleases one egg every month, the uterus also prepares itself every month\nto receive a fertilised egg. Thus its lining becomes thick and spongy.\nThis would be required for nourishing the embryo if fertilisation had\ntaken place. Now, however, this lining is not needed any longer. So, the\nlining slowly breaks and comes out through the vagina as blood and\nmucous. This cycle takes place roughly every month and is known as\nmenstruation. It usually lasts for about two to eight days.\n7.3.3 (d) Reproductive Health\nAs we have seen, the process of sexual maturation is gradual, and takes\nplace while general body growth is still going on. Therefore, some degree\nof sexual maturation does not necessarily mean that the body or the\nmind is ready for sexual acts or for having and bringing up children.\nHow do we decide if the body or the mind is ready for this major\nresponsibility? All of us are under many different kinds of pressures\nabout these issues. There can be pressure from our friends for\nparticipating in many activities, whether we really want to or not. There\ncan be pressure from families to get married and start having children.\nThere can be pressure from government agencies to avoid having\nchildren. In this situation, making choices can become very difficult.\n2024-25",
      "content_type": "text",
      "token_count": 789,
      "page_number": 6
    },
    {
      "id": "307134c0-2639-4461-ae55-ea2a60bbfccc",
      "chapter_id": "7edb7689-9ca0-45a5-8c94-da689d11e3ff",
      "chunk_index": 6,
      "content": "--- Page 13 ---\nHow do Organisms Reproduce? 125\nWe must also consider the possible health consequences of having\nsex. We have discussed in Class IX that diseases can be transmitted\nfrom person to person in a variety of ways. Since the sexual act is a\nvery intimate connection of bodies, it is not surprising that many\ndiseases can be sexually transmitted. These include bacterial infections\nsuch as gonorrhoea and syphilis, and viral infections such as warts\nand HIV-AIDS. Is it possible to prevent the transmission of such diseases\nduring the sexual act? Using a covering, called a condom, for the penis\nduring sex helps to prevent transmission of many of these infections to\nsome extent.\nThe sexual act always has the potential to lead to pregnancy.\nPregnancy will make major demands on the body and the mind of the\nwoman, and if she is not ready for it, her health will be adversely\naffected. Therefore, many ways have been devised to avoid pregnancy.\nThese contraceptive methods fall in a number of categories. One\ncategory is the creation of a mechanical barrier so that sperm does not\nreach the egg. Condoms on the penis or similar coverings worn in the\nvagina can serve this purpose. Another category of contraceptives acts\nby changing the hormonal balance of the body so that eggs are not\nreleased and fertilisation cannot occur . These drugs commonly need\nto be taken orally as pills. However , since they change hor monal\nbalances, they can cause side-effects too. Other contraceptive devices\nsuch as the loop or the copper -T are placed in the uterus to pr event\npregnancy. Again, they can cause side effects due to irritation of the\nuterus. If the vas deferens in the male is blocked, sperm transfer will\nbe prevented. If the fallopian tube in the female is blocked, the egg will\nnot be able to reach the uterus. In both cases fertilisation will not take\nplace. Surgical methods can be used to create such blocks. While\nsurgical methods are safe in the long run, surgery itself can cause\ninfections and other problems if not performed properly. Surgery can\nalso be used for removal of unwanted pregnancies. These may be\nmisused by people who do not want a particular child, as happens in\nillegal sex-selective abortion of female foetuses. For a healthy society,\nthe female-male sex ratio must be maintained. Because of reckless\nfemale foeticides, child sex ratio is declining at an alarming rate in\nsome sections of our society, although prenatal sex determination has\nbeen prohibited by law.\nWe have noted earlier that r eproduction is the pr\nocess by which\norganisms increase their populations. The rates of birth and death in a\ngiven population will determine its size. The size of the human population\nis a cause for concern for many people. This is because an expanding\npopulation makes it harder to improve everybody’s standard of living.\nHowever, if inequality in society is the main reason for poor standards of\nliving for many people, the size of the population is relatively unimportant.\nIf we look around us, what can we identify as the most important\nreason(s) for poor living standards?\n2024-25",
      "content_type": "exercise",
      "token_count": 779,
      "page_number": 6
    },
    {
      "id": "4525f571-4a23-4372-84df-1d83662963cd",
      "chapter_id": "7edb7689-9ca0-45a5-8c94-da689d11e3ff",
      "chunk_index": 7,
      "content": "--- Page 14 ---\nScience126\nWhat you have learnt\n/square6Reproduction, unlike other life processes, is not essential to maintain the life of an\nindividual organism.\n/square6Reproduction involves creation of a DNA copy and additional cellular apparatus\nby the cell involved in the process.\n/square6Various organisms use different modes of reproduction depending on their body\ndesign.\n/square6In fission, many bacteria and protozoa simply divide into two or more daughter\ncells.\n/square6Organisms such as hydra can regenerate if they are broken into pieces. They can\nalso give out buds which mature into new individuals.\n/square6Roots, stems and leaves of some plants develop into new plants through vegetative\npropagation.\n/square6These are examples of asexual reproduction where new generations are created\nfrom a single individual.\n/square6Sexual reproduction involves two individuals for the creation of a new individual.\n/square6DNA copying mechanisms creates variations which are useful for ensuring the\nsurvival of the species. Modes of sexual reproduction allow for greater variation to\nbe generated.\n/square6Reproduction in flowering plants involves transfer of pollen grains from the anther\nto the stigma which is referred to as pollination. This is followed by fertilisation.\n/square6Changes in the body at puberty, such as increase in breast size in girls and new\nfacial hair growth in boys, are signs of sexual maturation.\n/square6The male reproductive system in human beings consists of testes which produce\nsperms, vas deferens, seminal vesicles, prostate gland, urethra and penis.\n/square6The female reproductive system in human beings consists of ovaries, fallopian\ntubes, uterus and vagina.\n/square6Sexual reproduction in human beings involves the introduction of sperm in the\nvagina of the female. Fertilisation occurs in the fallopian tube.\n/square6Contraception to avoid pregnancy can be achieved by the use of condoms, oral\npills, copper-T and other methods.\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 497,
      "page_number": 14
    },
    {
      "id": "acddb585-0b0a-42e6-963f-32b27e9966a4",
      "chapter_id": "1b25e83e-054b-4908-bc39-78ce65d36926",
      "chunk_index": 0,
      "content": "sexually transmitted diseases?\n2024-25\n\n--- Page 15 ---\nHow do Organisms Reproduce? 127\nEXERCISES",
      "content_type": "exercise",
      "token_count": 24,
      "page_number": 14
    },
    {
      "id": "1ce9d597-e603-4192-a3ca-c177a84f22ed",
      "chapter_id": "4def76cc-8ce5-4cf8-b628-b06e0638a889",
      "chunk_index": 0,
      "content": "(a) Amoeba.\n(b) Yeast.\n(c) Plasmodium.\n(d) Leishmania.",
      "content_type": "text",
      "token_count": 13,
      "page_number": 14
    },
    {
      "id": "34d275d0-bbd9-47ea-b6af-0d5d0ca6643e",
      "chapter_id": "2c992f03-3533-45ae-ab9d-793de57f405c",
      "chunk_index": 0,
      "content": "beings?\n(a) Ovary\n(b) Uterus\n(c) Vas deferens\n(d) Fallopian tube",
      "content_type": "text",
      "token_count": 16,
      "page_number": 14
    },
    {
      "id": "2f7e37b2-507e-427f-84b7-903eff4a8646",
      "chapter_id": "3e480636-f604-495e-a519-073afdb884d2",
      "chunk_index": 0,
      "content": "(a) sepals.\n(b) ovules.\n(c) pistil.\n(d) pollen grains.",
      "content_type": "text",
      "token_count": 13,
      "page_number": 14
    },
    {
      "id": "15f7ca96-0630-4fa8-ab9c-ed1669504f8f",
      "chapter_id": "74407d0e-913c-497c-8555-9726c93b481a",
      "chunk_index": 0,
      "content": "multicellular organisms?",
      "content_type": "text",
      "token_count": 6,
      "page_number": 15
    },
    {
      "id": "94e7358c-e726-4e90-befe-1a2b3d67556a",
      "chapter_id": "7d81d312-816f-428d-9ac6-fb1c0272d4d9",
      "chunk_index": 0,
      "content": "2024-25",
      "content_type": "text",
      "token_count": 1,
      "page_number": 15
    }
  ]
}