{
  "textbook": {
    "id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
    "file_name": "Class X Science NCERT - Ch 02 - From the data.pdf",
    "title": "From the data",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 21,
    "file_size_mb": 11.2694730758667,
    "status": "ready",
    "processed_at": "2025-09-28T10:54:55.806200",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 02 - From the data.pdf"
  },
  "chapters": [
    {
      "id": "3fe28909-2455-48f9-a68e-6be33c6fa957",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 1,
      "title": "1. What would be the electron dot structure of carbon dioxide which has",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "the formula CO 2?"
    },
    {
      "id": "6265d226-0712-4e87-9ae1-e0a82cc0b8e9",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 2,
      "title": "2. What would be the electron dot structure of a molecule of sulphur which",
      "topics": [],
      "start_page": 4,
      "end_page": 9,
      "content": "is made up of eight atoms of sulphur? (Hint –  The eight atoms of sulphur\nare joined together in the form of a ring.)\nFigure 4.5Figure 4.5Figure 4.5Figure 4.5Figure 4.5\nElectron dot structure for\nmethane\npoints of these compounds. Since the electrons are shared between\natoms and no charged particles are formed, such covalent compounds\nare generally poor conductors of electricity.\nAllotropes of carbon\nThe element carbon occurs in different forms in nature with\nwidely varying physical properties. Both diamond and\ngraphite are formed by carbon atoms, the difference lies in\nthe manner in which the carbon atoms are bonded to one\nanother. In diamond, each carbon atom is bonded to four\nother carbon atoms forming a rigid three-dimensional\nstructure. In graphite, each carbon atom is bonded to three\nother carbon atoms in the same plane giving a hexagonal array.\nOne of these bonds is a double-bond, and thus the valency of\ncarbon is satisfied. Graphite structure is formed by the\nhexagonal arrays being placed in layers one above the other.\nMore to Know!\nThe structure of graphite\n2024-25\n\n--- Page 5 ---\nScience62\n4.2 VERSATILE NATURE OF CARBON\nWe have seen the for mation of covalent bonds by the sharing of\nelectrons in various elements and compounds. We have also seen the\nstructure of a simple carbon compound, methane. In the beginning\nof the Chapter, we saw how many things we use contain carbon. In\nfact, we ourselves are made up of carbon compounds. The numbers\nof carbon compounds whose formulae are known to chemists was\nrecently estimated to be in million s! This outnumbers by a large\nmargin the compounds formed by all the other elements put together.\nWhy is it that this property is seen in carbon and no other element?\nThe nature of the covalent bond enables carbon to form a large number\nof compounds. Two factors noticed in the case of carbon ar e –\n(i) Carbon has the unique ability to form bonds with other atoms of\ncarbon, giving rise to large molecules. This property is called\ncatenation. These compounds may have long chains of carbon,\nbranched chains of carbon or even carbon atoms arranged in rings.\nIn addition, carbon atoms may be linked by single, double or triple\nbonds. Compounds of carbon, which are linked by only single\nbonds between the carbon atoms are called saturated compounds.\nCompounds of carbon having double or triple bonds between their\ncarbon atoms are called unsaturated compounds.\nNo other element exhibits the property of catenation to the extent\nseen in carbon compounds. Silicon forms compounds with\nhydrogen which have chains of upto seven or eight atoms, but these\ncompounds are very reactive. The carbon-carbon bond is very strong\nand hence stable. This gives us the large number of compounds\nwith many carbon atoms linked to each other.\n(ii) Since carbon has a valency of four, it is capable of bonding with\nfour other atoms of carbon or atoms of some other mono-valent\nelement. Compounds of carbon are formed with oxygen, hydrogen,\nnitrogen, sulphur, chlorine and many other elements giving rise to\ncompounds with specific properties which depend on the elements\nother than carbon present in the molecule.\nAgain the bonds that carbon forms with most other elements are\nvery strong making these compounds exceptionally stable. One\nreason for the formation of strong bonds by carbon is its small size.\nThis enables the nucleus to hold on to the shared pairs of electrons\nstrongly. The bonds formed by elements having bigger atoms are\nmuch weaker.\n2024-25\n\n--- Page 6 ---\nCarbon and its Compounds 63\nOrganic compounds\nThe two characteristic features seen in carbon, that is, tetravalency and catenation, put\ntogether give rise to a large number of compounds. Many have the same non-carbon\natom or group of atoms attached to different carbon chains. These compounds were\ninitially extracted from natural substances and it was thought that these carbon\ncompounds or organic compounds could only be formed within a living system. That is,\nit was postulated that a ‘vital force’ was necessary for their synthesis. Friedrich Wöhler\ndisproved this in 1828 by preparing urea from ammonium cyanate. But carbon\ncompounds, except for carbides, oxides of carbon, carbonate and hydrogencarbonate\nsalts continue to be studied under organic chemistry.\n4.2.1 Saturated and Unsaturated Carbon Compounds4.2.1 Saturated and Unsaturated Carbon Compounds4.2.1 Saturated and Unsaturated Carbon Compounds4.2.1 Saturated and Unsaturated Carbon Compounds4.2.1 Saturated and Unsaturated Carbon Compounds\nWe have already seen the structur e of methane. Another compound\nformed between carbon and hydrogen is ethane with a formula of C2H6.\nIn order to arrive at the structure of simple carbon\ncompounds, the first step is to link the carbon atoms\ntogether with a single bond (Fig. 4.6a) and then use the\nhydrogen atoms to satisfy the remaining valencies of carbon\n(Fig. 4.6b). For example, the structure of ethane is arrived\nin the following steps –\nC—C Step 1\nFigure 4.6 Figure 4.6 Figure 4.6 Figure 4.6 Figure 4.6 (a) Carbon atoms linked together with a single bond\nThree valencies of each carbon atom remain unsatisfied,\nso each is bonded to three hydrogen atoms giving:\nStep 2\nFigure 4.6 Figure 4.6 Figure 4.6 Figure 4.6 Figure 4.6 (b)     Each carbon atom bonded to three hydrogen atoms\nThe electron dot structure of ethane is shown in Fig. 4.6(c).\nCan you draw the structure of propane, which has the molecular\nformula C3H8 in a similar manner? You will see that the valencies of all\nthe atoms are satisfied by single bonds between them. Such carbon\ncompounds are called saturated compounds. These compounds are\nnormally not very reactive.\nHowever, another compound of carbon and hydrogen has the formula\nC2H4 and is called ethene. How can this molecule be depicted? We follow\nthe same step-wise approach as above.\nCarbon-carbon atoms linked together with a single bond (Step 1).\nWe see that one valency per carbon atom r emains unsatisfied\n(Step 2). This can be satisfied only if there is a double bond between the\ntwo carbons (Step 3).\nFigure 4.6Figure 4.6Figure 4.6Figure 4.6Figure 4.6\n(c)     Electron dot structure of\nethane\nMore to Know!\nStep 2\nStep 3\nC—C        Step 1\n2024-25\n\n--- Page 7 ---\nScience64\nThe electron dot structure for ethene is given in Fig. 4.7.\nYet another compound of hydrogen and carbon has the formula\nC2H2 and is called ethyne. Can you draw the electron dot\nstructure for ethyne? How many bonds are necessary between\nthe two carbon atoms in order to satisfy their valencies? Such\ncompounds of carbon having double or triple bonds between\nthe carbon atoms are known as unsaturated carbon compounds\nand they are more reactive than the saturated carbon\ncompounds.\n4.2.2 Chains, Branches and Rings\nIn the earlier section, we mentioned the carbon compounds methane,\nethane and propane, containing respectively 1, 2 and 3 carbon atoms.\nSuch ‘chains’ of carbon atoms can contain many more carbon atoms.\nThe names and structures of six of these are given in Table 4.2.\nFigure 4.7Figure 4.7Figure 4.7Figure 4.7Figure 4.7\nStructure of ethene\nTable 4.2 Formulae and structures of saturated compounds of carbon and hydrogen\nNo. of C Name Formula Structure\natoms\n1 Methane CH4\n2 Ethane C2H6\n3 Propane C3H8\n4 Butane C4H10\n5 Pentane C5H12\n6 Hexane C6H14\n2024-25\n\n--- Page 8 ---\nCarbon and its Compounds 65\nBut, let us take another look at butane. If we make the carbon\n‘skeleton’ with four carbon atoms, we see that two different possible\n‘skeletons’ are –\nC—C—C—C\nFigure 4.8 Figure 4.8 Figure 4.8 Figure 4.8 Figure 4.8 (a) Two possible carbon-skeletons\nFilling the remaining valencies with hydrogen gives us –\nFigure 4.8 Figure 4.8 Figure 4.8 Figure 4.8 Figure 4.8 (b) Complete molecules for two structures with formula C4H10\nWe see that both these structures have the same formula C4H10. Such\ncompounds with identical molecular formula but different structures\nare called structural isomers.\nIn addition to straight and branched carbon chains, some compounds\nhave carbon atoms arranged in the form of a ring. For example, cyclohexane\nhas the formula C6H12 and the following structure –\n(a) (b)\nFigure 4.9 Figure 4.9 Figure 4.9 Figure 4.9 Figure 4.9 Structure of cyclohexane (a) carbon skeleton (b) complete molecule\nCan you draw the electron dot structure for cyclohexane? Straight\nchain, branched chain and cyclic carbon compounds, all may be saturated\nor unsaturated. For example, benzene, C6H6, has the following structure –\nBenzene — C 6H6\nFigure 4.10 Figure 4.10 Figure 4.10 Figure 4.10 Figure 4.10 Structure of benzene\nAll these carbon compounds which contain only carbon and\nhydrogen are called hydrocarbons. Among these, the saturated\nhydrocarbons are called alkanes. The unsaturated hydrocarbons which\ncontain one or more double bonds are called alkenes. Those containing\none or more triple bonds are called alkynes.\n4.2.3 Will you be my Friend?\nCarbon seems to be a very friendly element. So far we have been looking at\ncompounds containing carbon and hydrogen only. But carbon also forms\n2024-25\n\n--- Page 9 ---\nScience66\nbonds with other elements such as halogens, oxygen, nitrogen and sulphur.\nIn a hydrocarbon chain, one or more hydrogens can be replaced by these\nelements, such that the valency of carbon remains satisfied. In such\ncompounds, the element replacing hydrogen is referred to as a heteroatom.\nThese heteroatoms are also present in some groups as given in Table 4.3.\nThese heteroatoms and\nthe group containing\nthese confer specific\nproperties to the\ncompound, regardless\nof the length and nature\nof the carbon chain and\nhence are called\nfunctional groups. Some\nimportant functional\ngroups are given in the\nTable 4.3. Free valency or\nvalencies of the group\nare shown by the single\nline. The functional group\nis attached to the carbon\nchain through this\nvalency by replacing one\nhydrogen   atom or\natoms.\n4.2.4 Homologous Series\nYou have seen that carbon atoms can be linked together to form chains\nof varying lengths. These chains can be branched also. In addition,\nhydrogen atom or other atoms on these carbon chains can be replaced\nby any of the functional groups that we saw above. The presence of a\nfunctional group such as alcohol decides the properties of the carbon\ncompound, regardless of the length of the carbon chain. For example,\nthe chemical properties of CH3OH, C2H5OH, C3H7OH and C4H9OH are all\nvery similar. Hence, such a series of compounds in which the same\nfunctional group substitutes for hydrogen in a carbon chain is called a\nhomologous series.\nLet us look at the homologous series that we saw earlier in Table\n4.2. If we look at the formulae of successive compounds, say –\nCH4 and C2H6 — these differ by a –CH2- unit\nC2H6 and C3H8 — these differ by a –CH2- unit\nWhat is the difference between the next pair – propane and butane (C4H10)?\nCan you find out the difference in molecular masses between these\npairs (the atomic mass of carbon is 12 u and the atomic mass of hydrogen\nis 1 u)?\nSimilarly, take the homologous series for alkenes. The first member\nof the series is ethene which we have already come across in\nSection 4.2.1. What is the formula for ethene? The succeeding members\nhave the formula C3H6, C4H8 and C5H10. Do these also differ by a –CH2–\nTable 4.3 Some functional groups in carbon compounds\nHetero HeteroHetero HeteroHetero Class of Class ofClass of Class ofClass of Formula ofFormula ofFormula ofFormula ofFormula of\natom atomatom atomatom compoundscompoundscompoundscompoundscompounds functional groupfunctional groupfunctional groupfunctional groupfunctional group\nCl/Br Halo- (Chloro/bromo) —Cl, —Br\nalkane (substitutes for\nhydrogen atom)\nOxygen 1. Alcohol —OH"
    },
    {
      "id": "54d83fee-7aea-463a-bad2-fbccb09b22b3",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 5,
      "title": "4. Carboxylic acid",
      "topics": [],
      "start_page": 9,
      "end_page": 10,
      "content": "2024-25\n\n--- Page 10 ---\nCarbon and its Compounds 67\nunit? Do you see any relation between the number of carbon and\nhydrogen atoms in these compounds? The general formula for alkenes\ncan be written as CnH2n, where n = 2, 3, 4. Can you similarly generate the\ngeneral formula for alkanes and alkynes?\nAs the molecular mass increases in any homologous series, a\ngradation in physical properties is seen. This is because the melting and\nboiling points increase with increasing molecular mass. Other physical\nproperties such as solubility in a particular solvent also show a similar\ngradation. But the chemical properties, which are determined solely by\nthe functional group, remain similar in a homologous series.\nActivity 4.2Activity 4.2Activity 4.2Activity 4.2Activity 4.2\n4.2.5 Nomenclature of Carbon Compounds\nThe names of compounds in a homologous series are based on the name\nof the basic carbon chain modified by a “prefix” “phrase before” or “suffix”\n“phrase after” indicating the nature of the functional group. For example,\nthe names of the alcohols taken in Activity 4.2 are methanol, ethanol,\npropanol and butanol.\nNaming a carbon compound can be done by the following method –\n(i) Identify the number of carbon atoms in the compound. A compound\nhaving three carbon atoms would have the name propane.\n(ii) In case a functional group is present, it is indicated in the\nname of the compound with either a prefix or a suffix (as given\nin Table 4.4).\n(iii) If the name of the functional group is to be given as a suffix, and the\nsuffix of the functional group begins with a vowel a, e, i, o, u, then\nthe name of the carbon chain is modified by deleting the final ‘e’ and\nadding the appropriate suffix. For example, a three-carbon chain\nwith a ketone group would be named in the following manner –\nPropane – ‘e’ = propan + ‘one’ = propanone.\n(iv) If the carbon chain is unsaturated, then the final ‘ane’ in the name\nof the carbon chain is substituted by ‘ene’ or ‘yne’ as given in\nTable 4.4. For example, a three-carbon chain with a double bond\nwould be called propene and if it has a triple bond, it would be\ncalled propyne.\n/square6Calculate the difference in the formulae and molecular masses\nfor (a) CH3OH and C2H5OH (b) C2H5OH and C3H7OH, and (c) C3H7OH\nand C4H9OH.\n/square6Is there any similarity in these three?\n/square6Arrange these alcohols in the order of increasing carbon atoms to\nget a family. Can we call this family a homologous series?\n/square6Generate the homologous series for compounds containing up to\nfour carbons for the other functional groups given in Table 4.3.\n2024-25\n\n--- Page 11 ---\nScience68\nbromo, etc.\nQUESTIONS"
    },
    {
      "id": "43a9ed41-fdd1-426e-8482-fb4e8c4401d9",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 7,
      "title": "2. What are the two properties of carbon which lead to the huge number",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "of carbon compounds we see around us?"
    },
    {
      "id": "6267f572-e773-4c8e-b4dd-186f5188ebb1",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 8,
      "title": "3. What will be the formula and electron dot structure of cyclopentane?",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": " Table 4.4 Nomenclature of organic compounds\nClass of Prefix/Suffix Example\ncompounds"
    },
    {
      "id": "d755dfdd-4012-47c4-bd70-566cb6503747",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 9,
      "title": "1. Halo alkane Prefix-chloro, Chloropropane",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "Bromopropane"
    },
    {
      "id": "5e539028-5d8b-4928-aaeb-4b490f1af5b9",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 15,
      "title": "7. Alkynes Suffix - yne Propyne",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "2024-25\n\n--- Page 12 ---\nCarbon and its Compounds 69\n?"
    },
    {
      "id": "f737cb0a-13dc-40e8-86bc-63b7afeb8cb5",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 16,
      "title": "4. Draw the structures for the following compounds.",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "(i) Ethanoic acid (ii) Bromopentane *\n(iii) Butanone (iv) Hexanal.\n*Are structural isomers possible for bromopentane?"
    },
    {
      "id": "cd03d6f8-9502-4ba5-83bd-04444a44c5c3",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 17,
      "title": "5. How would you name the following compounds?",
      "topics": [],
      "start_page": 10,
      "end_page": 13,
      "content": "(i) CH3—CH 2—Br (ii)   \n(iii)\n4.3 CHEMICAL PROPERTIES OF CARBON COMPOUNDS\nIn this section we will be studying about some of the chemical properties\nof carbon compounds. Since most of the fuels we use are either carbon\nor its compounds, we shall first study combustion.\n4.3.1 Combustion4.3.1 Combustion4.3.1 Combustion4.3.1 Combustion4.3.1 Combustion\nCarbon, in all its allotropic forms, burns in oxygen to give carbon dioxide\nalong with the release of heat and light. Most carbon compounds also\nrelease a large amount of heat and light on burning. These are the\noxidation reactions that you learnt about in the first Chapter –\n(i) C + O2 →  CO2 + heat and light\n(ii) CH4 + O2 →  CO2 + H2O + heat and light\n(iii) CH3CH2OH + O2 →  CO2 + H2O + heat and light\nBalance the latter two reactions like you learnt in the first Chapter.\nActivity 4.3Activity 4.3Activity 4.3Activity 4.3Activity 4.3\nCAUTION: This Activity needs the teacher’s assistance.\n/square6Take some carbon compounds (naphthalene,\ncamphor, alcohol) one by one on a spatula and bur n\nthem.\n/square6Observe the nature of the flame and note whether\nsmoke is produced.\n/square6Place a metal plate above the flame. Is there a deposition\non the plate in case of any of the compounds?\nActivity 4.4Activity 4.4Activity 4.4Activity 4.4Activity 4.4\n/square6Light a bunsen burner and\nadjust the air hole at the\nbase to get different types of\nflames/presence of smoke.\n/square6When do you get a yellow,\nsooty flame?\n/square6When do you get a blue\nflame?\nSaturated hydrocarbons will generally give a clean flame while\nunsaturated carbon compounds will give a yellow flame with lots of\nblack smoke. This results in a sooty deposit on the metal plate in Activity\n4.3. However, limiting the supply of air results in incomplete combustion\nof even saturated hydrocarbons giving a sooty flame. The gas/kerosene\nstove used at home has inlets for air so that a sufficiently oxygen-rich\n2024-25\n\n--- Page 13 ---\nScience70\nmixture is burnt to give a clean blue flame. If you observe the bottoms of\ncooking vessels getting blackened, it means that the air holes are blocked\nand fuel is getting wasted. Fuels such as coal and petroleum have some\namount of nitrogen and sulphur in them. Their combustion results in\nthe formation of oxides of sulphur and nitrogen which are major\npollutants in the environment.\nDo You Know?\nWhy do substances burn with or without a flame?\nHave you ever observed either a coal or a wood fire? If not, the next time you get a\nchance, take close note of what happens when the wood or coal starts to burn. You\nhave seen above that a candle or the LPG in the gas stove burns with a flame. However,\nyou will observe the coal or charcoal in an ‘angithi’ sometimes just glows red and\ngives out heat without a flame. This is because a flame is only produced when gaseous\nsubstances burn. When wood or charcoal is ignited, the volatile substances present\nvapourise and burn with a flame in the beginning.\nA luminous flame is seen when the atoms of the gaseous substance are heated and\nstart to glow. The colour produced by each element is a characteristic property of\nthat element. Try and heat a copper wire in the flame of a gas stove and observe its\ncolour. You have seen that incomplete combustion gives soot which is carbon. On\nthis basis, what will you attribute the yellow colour of a candle flame to?\nFormation of coal and petroleum\nCoal and petroleum have been formed from biomass which has been subjected to\nvarious biological and geological processes. Coal is the remains of trees, ferns, and\nother plants that lived millions of years ago. These were crushed into the earth,\nperhaps by earthquakes or volcanic eruptions. They were pressed down by layers of\nearth and rock. They slowly decayed into coal. Oil and gas are the remains of millions\nof tiny plants and animals that lived in the sea. When they died, their bodies sank to\nthe sea bed and were covered by silt. Bacteria attacked the dead remains, turning\nthem into oil and gas under the high pressures they were being subjected to.\nMeanwhile, the silt was slowly compressed into rock. The oil and gas seeped into the\nporous parts of the rock, and got trapped like water in a sponge. Can you guess why\ncoal and petroleum are called fossil fuels?\n4.3.2 Oxidation\nActivity 4.5Activity 4.5Activity 4.5Activity 4.5Activity 4.5\n/square6Take about 3 mL of ethanol in a test tube and warm it\ngently in a water bath.\n/square6Add a 5% solution of alkaline potassium permanganate\ndrop by drop to this solution.\n/square6Does the colour of potassium permanganate persist when\nit is added initially?\n/square6Why does the colour of potassium permanganate not\ndisappear when excess is added?\nYou have lear nt\nabout oxidation reactions in\nthe first Chapter . Carbon\ncompounds can be easily\noxidised on combustion. In\naddition to this complete\noxidation, we have reactions\nin which alcohols are\nconverted to carboxylic\nacids –\nMore to Know!\n2024-25\n\n--- Page 14 ---\nCarbon and its Compounds 71\nWe see that some substances are capable of adding oxygen to others.\nThese substances are known as oxidising agents.\nAlkaline potassium permanganate or acidified potassium dichromate\nare oxidising alcohols to acids, that is, adding oxygen to the starting\nmaterial. Hence they are known as oxidising agents.\n4.3.3 Addition Reaction\nUnsaturated hydrocarbons add hydrogen in the presence of catalysts\nsuch as palladium or nickel to give saturated hydrocarbons. Catalysts\nare substances that cause a reaction to occur or proceed at a different\nrate without the reaction itself being affected. This reaction is commonly\nused in the hydrogenation of vegetable oils using a nickel catalyst.\nVegetable oils generally have long unsaturated carbon chains while\nanimal fats have saturated carbon chains.\nYou must have seen advertisements stating that some vegetable oils\nare ‘healthy’. Animal fats generally contain saturated fatty acids which\nare said to be harmful for health. Oils containing unsaturated fatty acids\nshould be chosen for cooking.\n4.3.4 Substitution Reaction\nSaturated hydrocarbons are fairly unreactive and are inert in the presence\nof most reagents. However, in the presence of sunlight, chlorine is added\nto hydrocarbons in a very fast reaction. Chlorine can replace the hydrogen\natoms one by one. It is called a substitution reaction because one type\nof atom or a group of atoms takes the place of another . A number of\nproducts are usually formed with the higher homologues of alkanes.\nCH4 + Cl2 →  CH3Cl + HCl (in the presence of sunlight)\n?\nQUESTIONS"
    },
    {
      "id": "36c46015-dca9-4063-b472-ab113479eb42",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 19,
      "title": "2. A mixture of oxygen and ethyne is burnt for welding. Can you tell why",
      "topics": [],
      "start_page": 13,
      "end_page": 16,
      "content": "a mixture of ethyne and air is not used?\n4.4 SOME IMPORT ANT C ARBON COMPOUNDS – ETHANOL\nAND ETHANOIC ACID\nMany carbon compounds are invaluable to us. But here we shall study\nthe properties of two commercially important compounds – ethanol and\nethanoic acid.\n2024-25\n\n--- Page 15 ---\nScience72\n4.4.1 Properties of Ethanol\nEthanol is a liquid at room temperature (refer to Table 4.1 for the melting\nand boiling points of ethanol). Ethanol is commonly called alcohol and\nis the active ingredient of all alcoholic drinks. In addition, because it is a\ngood solvent, it is also used in medicines such as tincture iodine, cough\nsyrups, and many tonics. Ethanol is also soluble in water in all\nproportions. Consumption of small quantities of dilute ethanol causes\ndrunkenness. Even though this practice is condemned, it is a socially\nwidespread practice. However, intake of even a small quantity of pure\nethanol (called absolute alcohol) can be lethal. Also, long-term\nconsumption of alcohol leads to many health problems.\nReactions of EthanolReactions of EthanolReactions of EthanolReactions of EthanolReactions of Ethanol\n(i) Reaction with sodium –\nActivity 4.6Activity 4.6Activity 4.6Activity 4.6Activity 4.6\nTeacher’s demonstration  –\n/square6Drop a small piece of sodium,\nabout the size of a couple of\ngrains of rice, into ethanol\n(absolute alcohol).\n/square6What do you observe?\n/square6How will you test the gas evolved?\n2Na + 2CH3CH2OH →  2CH3CH2O– Na+ + H2\n (Sodium ethoxide)\nAlcohols react with sodium leading to the\nevolution of hydrogen. With ethanol, the other\nproduct is sodium ethoxide. Can you recall which\nother substances produce hydrogen on reacting with\nmetals?\n(ii) Reaction to give unsaturated hydrocarbon: Heating ethanol at\n443 K with excess concentrated sulphuric acid results in the\ndehydration of ethanol to give ethene –\nCH CH OH CH  = CH  + H O3 2 2 2 2\nHo\nt Conc.\nH SO2 4\n−  →   \nThe concentrated sulphuric acid can be regarded as a dehydrating\nagent which removes water from ethanol.\nHow do alcohols affect living beings?\nWhen large quantities of ethanol are consumed, it tends to slow metabolic processes\nand to depress the central nervous system. This results in lack of coordination,\nmental confusion, drowsiness, lowering of the normal inhibitions, and finally stupor.\nThe individual may feel relaxed without realising that his sense of judgement, sense\nof timing, and muscular coordination have been seriously impaired.\nUnlike ethanol, intake of methanol in very small quantities can cause death. Methanol\nis oxidised to methanal in the liver. Methanal reacts rapidly with the components of\ncells. It coagulates the protoplasm, in much the same way an egg is coagulated by\ncooking. Methanol also affects the optic nerve, causing blindness.\nEthanol is an important industrial solvent. To prevent the misuse of ethanol produced\nfor industrial use, it is made unfit for drinking by adding poisonous substances\nlike methanol to it. Dyes are also added to colour the alcohol blue so that it can be\nidentified easily. This is called denatured alcohol.\nDo You Know?\n2024-25\n\n--- Page 16 ---\nCarbon and its Compounds 73\n4.4.2 Properties of Ethanoic Acid\nEthanoic acid is commonly called acetic acid and\nbelongs to a group of acids called carboxylic\nacids. 5-8% solution of acetic acid in water is\ncalled vinegar and is used widely as a preservative\nin pickles. The melting point of pure ethanoic acid\nis 290 K and hence it often freezes during winter\nin cold climates. This gave rise to its name glacial\nacetic acid.\nThe group of organic compounds called\ncarboxylic acids are obviously characterised by\ntheir acidic nature. However, unlike mineral acids\nlike HCl, which are completely ionised, carboxylic\nacids are weak acids.\nActivity 4.7Activity 4.7Activity 4.7Activity 4.7Activity 4.7\nn Compare the pH of dilute acetic acid\nand dilute hydrochloric acid using\nboth litmus paper and universal\nindicator.\nn Are both acids indicated by the\nlitmus test?\nn Does the universal indicator show\nthem as equally strong acids?\nActivity 4.8Activity 4.8Activity 4.8Activity 4.8Activity 4.8\nn Take 1 mL ethanol (absolute alcohol)\nand 1 mL glacial acetic acid along\nwith a few drops of concentrated\nsulphuric acid in a test tube.\nn Warm in a water-bath for at least five\nminutes as shown in Fig. 4.11.\nn Pour into a beaker containing\n20-50 mL of water and smell the\nresulting mixture.\nReactions of ethanoic acid:Reactions of ethanoic acid:Reactions of ethanoic acid:Reactions of ethanoic acid:Reactions of ethanoic acid:\n(i) Esterification reaction: Esters are most commonly\nformed by reaction of an acid and an alcohol.\nEthanoic acid reacts with absolute ethanol in the\npresence of an acid catalyst to give an ester –\nCH COOH CH CH OH CH C C CH CH H O3 3 2 3 2 3 2\nAcid\nO\n(E\n− + − − − − − +\n11\nt thanoic acid)            (Ethanol)                               (Ester)\nO\nGenerally, esters are sweet-smelling substances. These are used in\nmaking perfumes and as flavouring agents. On treating with sodium\nhydroxide, which is an alkali, the ester is converted back to  alcohol\nand sodium salt of carboxylic acid. This reaction is known as\nsaponification because it is used in the preparation of soap. Soaps\nare sodium or potassium salts of long chain carboxylic acid.\nFigure 4.11Figure 4.11Figure 4.11Figure 4.11Figure 4.11\nFormation of ester\nAlcohol as a fuelAlcohol as a fuelAlcohol as a fuelAlcohol as a fuelAlcohol as a fuel\nSugarcane plants are one of the most efficient convertors of sunlight into chemical\nenergy. Sugarcane juice can be used to prepare molasses which is fermented to give\nalcohol (ethanol). Some countries now use alcohol as an additive in petrol since it is a\ncleaner fuel which gives rise to only carbon dioxide and water on burning in sufficient\nair (oxygen).\nMore to Know!\n2024-25\n\n--- Page 17 ---\nScience74\nCH COOC H C H OH+CH COONa3 2 5 2 5 3\nNaOH\n(ii) Reaction with a base: Like mineral acids, ethanoic acid reacts with\na base such as sodium hydroxide to give a salt (sodium ethanoate\nor commonly called sodium acetate) and water:\nNaOH + CH3COOH →  CH3COONa + H2O\nHow does ethanoic acid react with carbonates and\nhydrogencarbonates?\nLet us perform an activity to find out.\nActivity 4.9Activity 4.9Activity 4.9Activity 4.9Activity 4.9\n/square6Set up the apparatus as shown in Chapter 2, Activity 2.5.\n/square6Take a spatula full of sodium carbonate in a test tube and add 2 mL of dilute\nethanoic acid.\n/square6What do you observe?\n/square6Pass the gas pr oduced through freshly prepared lime-water. What do you observe?\n/square6Can the gas produced by the reaction between ethanoic acid and sodium carbonate be\nidentified by this test?\n/square6Repeat this Activity with sodium hydrogencarbonate instead of sodium carbonate.\n(iii) Reaction with carbonates and hydrogencarbonates: Ethanoic acid\nreacts with carbonates and hydrogencarbonates to give rise to a\nsalt, carbon dioxide and water. The salt produced is commonly called\nsodium acetate.\n2CH3COOH + Na2CO3 →  2CH3COONa + H2O + CO2\nCH3COOH + NaHCO3 →  CH3COONa + H2O + CO2\nQUESTIONS"
    },
    {
      "id": "7831c14d-5abe-4a7c-9cf9-4765076def84",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 20,
      "title": "1. How would you distinguish experimentally between an alcohol and",
      "topics": [],
      "start_page": 16,
      "end_page": 16,
      "content": "a carboxylic acid?"
    },
    {
      "id": "c71032a7-e044-45b5-8e81-005eba369a0c",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 21,
      "title": "2. What are oxidising agents?",
      "topics": [],
      "start_page": 16,
      "end_page": 18,
      "content": "4.5 SOAPS AND DETERGENTS\nActivity 4.10Activity 4.10Activity 4.10Activity 4.10Activity 4.10\n/square6Take about 10 mL of water each in two test tubes.\n/square6Add a drop of oil (cooking oil) to both  the test tubes\nand label them as A and B.\n/square6To test tube B, add a few drops of soap solution.\n/square6Now shake both the test tubes vigourously for\nthe same period of time.\n/square6Can you see the oil and water layers separately\nin both the test tubes immediately after you\nstop shaking them?\n/square6Leave the test tubes undisturbed for some time\nand observe. Does the oil layer separate out?\nIn which test tube does this happen first?\nFigure 4.12Figure 4.12Figure 4.12Figure 4.12Figure 4.12\nFormation of micelles\n?\n2024-25\n\n--- Page 18 ---\nCarbon and its Compounds 75\nThis activity demonstrates the effect of soap in cleaning. Most dirt is\noily in nature and as you know, oil does not dissolve in water . The\nmolecules of soap are sodium or potassium salts of long-chain carboxylic\nacids. The ionic-end of soap interacts with water while the carbon chain\ninteracts with oil. The soap molecules, thus form structures called\nmicelles (see Fig. 4.12) where one end of the molecules is towards the oil\ndroplet while the ionic-end faces outside. This forms an emulsion in\nwater. The soap micelle thus helps  in pulling out the dirt in water and\nwe can wash our clothes clean (Fig. 4.13).\nCan you draw the structure of the micelle that would be formed if\nyou dissolve soap in a hydrocarbon?\nMicelles\nSoaps are molecules in which the two ends have differing properties, one is hydrophilic,\nthat is, it interacts with water, while the other end is hydrophobic, that is, it interacts\nwith hydrocarbons. When soap is at the surface of water, the hydrophobic ‘tail’ of soap\nwill not be soluble in water and the soap will align along the surface of water with the\nionic end in water and the hydrocarbon ‘tail’ protruding out of water. Inside water,\nthese molecules have a unique orientation that keeps\nthe hydr ocarbon portion out of the water . Thus,\nclusters of molecules in which the hydrophobic tails\nare in the interior of the cluster and the ionic ends\nare on the surface of the cluster. This formation is\ncalled a micelle. Soap in the form of a micelle is able\nto clean, since the oily dirt will be collected in the\ncentre of the micelle. The micelles stay in solution as\na colloid and will not come together to precipitate\nbecause of ion-ion repulsion. Thus, the dirt\nsuspended in the micelles is also easily rinsed away.\nThe soap micelles are large enough to scatter light.\nHence a soap solution appears cloudy.\nFigure 4.13Figure 4.13Figure 4.13Figure 4.13Figure 4.13  Effect of soap in cleaning\nMore to Know!\n2024-25\n\n--- Page 19 ---\nScience76\nActivity 4.11Activity 4.11Activity 4.11Activity 4.11Activity 4.11\n/square6Take about 10 mL of distilled water (or rain water) and 10 mL of\nhard water (from a tubewell or hand-pump) in separate test tubes.\n/square6Add a couple of drops of soap solution to both.\n/square6Shake the test tubes vigorously for an equal period of time and\nobserve the amount of foam formed.\n/square6In which test tube do you get more foam?\n/square6In which test tube do you observe a white curdy precipitate?\nNote for the teache r : If hard water is not available in your locality,\nprepare some hard water by dissolving hydrogencarbonates/\nsulphates/chlorides of calcium or magnesium in water .\nActivity 4.12Activity 4.12Activity 4.12Activity 4.12Activity 4.12\n/square6Take two test tubes with about 10 mL of hard water in each.\n/square6Add five drops of soap solution to one and five drops of detergent\nsolution to the other .\n/square6Shake both test tubes for the same period.\n/square6Do both test tubes have the same amount of foam?\n/square6In which test tube is a curdy solid formed?\n?\nQUESTIONS"
    },
    {
      "id": "5a53a341-de4c-4698-9aaf-9be0235860a9",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 23,
      "title": "2. People use a variety of methods to wash clothes. Usually after adding",
      "topics": [],
      "start_page": 18,
      "end_page": 19,
      "content": "the soap, they ‘beat’ the clothes on a stone, or beat it with a paddle,\nscrub with a brush or the mixture is agitated in a washing machine.\nWhy is agitation necessary to get clean clothes?\nHave you ever observed while bathing that foam is formed with\ndifficulty and an insoluble substance (scum) remains after washing with\nwater? This is caused by the reaction of soap with the calcium and\nmagnesium salts, which cause the hardness of water. Hence you need\nto use a larger amount of soap. This problem is overcome by using\nanother class of compounds called detergents as cleansing agents.\nDetergents are generally sodium salts of sulphonic acids or ammonium\nsalts with chlorides or bromides ions, etc. Both have long hydrocarbon\nchain. The charged ends of these compounds do not form insoluble\nprecipitates with the calcium and magnesium ions in hard water. Thus,\nthey remain effective in hard water. Detergents are usually used to make\nshampoos and products for cleaning clothes.\n2024-25\n\n--- Page 20 ---\nCarbon and its Compounds 77\nWhat you have learnt\n/square6Carbon is a versatile element that forms the basis for all living organisms and many\nof the things we use.\n/square6This large variety of compounds is formed by carbon because of its tetravalency\nand the property of catenation that it exhibits.\n/square6Covalent bonds are formed by the sharing of electrons between two atoms so that\nboth can achieve a completely filled outermost shell.\n/square6Carbon forms covalent bonds with itself and other elements such as hydrogen,\noxygen, sulphur, nitrogen and chlorine.\n/square6Carbon also forms compounds containing double and triple bonds between carbon\natoms. These carbon chains may be in the form of straight chains, branched chains\nor rings.\n/square6The ability of carbon to form chains gives rise to a homologous series of compounds\nin which the same functional group is attached to carbon chains of different lengths.\n/square6The functional groups such as alcohols, aldehydes, ketones and carboxylic acids\nbestow characteristic properties to the carbon compounds that contain them.\n/square6Carbon and its compounds are some of our major sources of fuels.\n/square6Ethanol and ethanoic acid are carbon compounds of importance in our daily lives.\n/square6The action of soaps and detergents is based on the presence of both hydrophobic\nand hydrophilic groups in the molecule and this helps to emulsify the oily dirt and\nhence its removal.\nEXERCISES"
    },
    {
      "id": "f8f8d1b4-460a-4e39-adba-3e152fc00aa3",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 24,
      "title": "1. Ethane, with the molecular formula C2H6 has",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "(a) 6 covalent bonds.\n(b) 7 covalent bonds.\n(c) 8 covalent bonds.\n(d) 9 covalent bonds."
    },
    {
      "id": "d358b596-601e-41a0-b9ab-b725f92bf07f",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 25,
      "title": "2. Butanone is a four-carbon compound with the functional group",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "(a) carboxylic acid.\n(b) aldehyde.\n(c) ketone.\n(d) alcohol."
    },
    {
      "id": "c64a8603-ad1b-46d6-93fd-c60028288f10",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 26,
      "title": "3. While cooking, if the bottom of the vessel is getting blackened on the outside,",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "it means that\n(a) the food is not cooked completely.\n(b) the fuel is not burning completely.\n(c) the fuel is wet.\n(d) the fuel is burning completely.\n2024-25\n\n--- Page 21 ---\nScience78"
    },
    {
      "id": "784fcdbc-22ac-4614-a294-01838632beeb",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 28,
      "title": "5. Draw the electron dot structures for",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "(a) ethanoic acid.\n(b) H2S.\n(c) propanone.\n(d) F2 ."
    },
    {
      "id": "aaa28bc8-076b-4abf-8728-02f67b9e3e87",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 30,
      "title": "7. How can ethanol and ethanoic acid be differentiated on the basis of their physical",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "and chemical properties?"
    },
    {
      "id": "8aa0979c-8329-4b8e-b5e7-715c02debc10",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 31,
      "title": "8. Why does micelle formation take place when soap is added to water? Will a micelle",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "be formed in other solvents such as ethanol also?"
    },
    {
      "id": "4188a02a-dd7b-407c-8044-a2ea2fe710f5",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 36,
      "title": "13. Which of the following hydrocarbons undergo addition reactions:",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "C2H6, C3H8, C3H6, C2H2 and CH4."
    },
    {
      "id": "cebfcdf9-9592-4dba-b550-cc311c882cdd",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 37,
      "title": "14. Give a test that can be used to differentiate between saturated and unsaturated",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "hydrocarbons."
    },
    {
      "id": "35b239e9-80ed-4ffb-b25a-8bd7852e2e20",
      "textbook_id": "fb4ec220-90bd-462f-a3c9-d2264e73349c",
      "chapter_number": 38,
      "title": "15. Explain the mechanism of the cleaning action of soaps.",
      "topics": [],
      "start_page": 19,
      "end_page": 20,
      "content": " I Use molecular model kits to make models of the compounds you have learnt in\nthis Chapter.\nII /square6Take about 20 mL of castor oil/cotton seed oil/linseed oil/soyabean oil in a\nbeaker. Add 30 mL of 20 % sodium hydroxide solution. Heat the mixture with\ncontinuous stirring for a few minutes till the mixture thickens. Add 5-10 g of\ncommon salt to this. Stir the mixture well and allow it to cool.\n/square6You can cut out the soap in fancy shapes. You can also add perfume to the\nsoap before it sets.\nGroup  Activity\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "af6394ca-0cb3-423f-80a9-9e026d006b69",
      "chapter_id": "3fe28909-2455-48f9-a68e-6be33c6fa957",
      "chunk_index": 0,
      "content": "the formula CO 2?",
      "content_type": "text",
      "token_count": 4,
      "page_number": 4
    },
    {
      "id": "4acd49c1-054c-4e0a-9e85-eeaeff840d69",
      "chapter_id": "6265d226-0712-4e87-9ae1-e0a82cc0b8e9",
      "chunk_index": 0,
      "content": "is made up of eight atoms of sulphur? (Hint –  The eight atoms of sulphur\nare joined together in the form of a ring.)\nFigure 4.5Figure 4.5Figure 4.5Figure 4.5Figure 4.5\nElectron dot structure for\nmethane\npoints of these compounds. Since the electrons are shared between\natoms and no charged particles are formed, such covalent compounds\nare generally poor conductors of electricity.\nAllotropes of carbon\nThe element carbon occurs in different forms in nature with\nwidely varying physical properties. Both diamond and\ngraphite are formed by carbon atoms, the difference lies in\nthe manner in which the carbon atoms are bonded to one\nanother. In diamond, each carbon atom is bonded to four\nother carbon atoms forming a rigid three-dimensional\nstructure. In graphite, each carbon atom is bonded to three\nother carbon atoms in the same plane giving a hexagonal array.\nOne of these bonds is a double-bond, and thus the valency of\ncarbon is satisfied. Graphite structure is formed by the\nhexagonal arrays being placed in layers one above the other.\nMore to Know!\nThe structure of graphite\n2024-25",
      "content_type": "text",
      "token_count": 272,
      "page_number": 4
    },
    {
      "id": "18d96e41-b69b-4510-b3b3-ff0505198e6e",
      "chapter_id": "6265d226-0712-4e87-9ae1-e0a82cc0b8e9",
      "chunk_index": 1,
      "content": "--- Page 5 ---\nScience62\n4.2 VERSATILE NATURE OF CARBON\nWe have seen the for mation of covalent bonds by the sharing of\nelectrons in various elements and compounds. We have also seen the\nstructure of a simple carbon compound, methane. In the beginning\nof the Chapter, we saw how many things we use contain carbon. In\nfact, we ourselves are made up of carbon compounds. The numbers\nof carbon compounds whose formulae are known to chemists was\nrecently estimated to be in million s! This outnumbers by a large\nmargin the compounds formed by all the other elements put together.\nWhy is it that this property is seen in carbon and no other element?\nThe nature of the covalent bond enables carbon to form a large number\nof compounds. Two factors noticed in the case of carbon ar e –\n(i) Carbon has the unique ability to form bonds with other atoms of\ncarbon, giving rise to large molecules. This property is called\ncatenation. These compounds may have long chains of carbon,\nbranched chains of carbon or even carbon atoms arranged in rings.\nIn addition, carbon atoms may be linked by single, double or triple\nbonds. Compounds of carbon, which are linked by only single\nbonds between the carbon atoms are called saturated compounds.\nCompounds of carbon having double or triple bonds between their\ncarbon atoms are called unsaturated compounds.\nNo other element exhibits the property of catenation to the extent\nseen in carbon compounds. Silicon forms compounds with\nhydrogen which have chains of upto seven or eight atoms, but these\ncompounds are very reactive. The carbon-carbon bond is very strong\nand hence stable. This gives us the large number of compounds\nwith many carbon atoms linked to each other.\n(ii) Since carbon has a valency of four, it is capable of bonding with\nfour other atoms of carbon or atoms of some other mono-valent\nelement. Compounds of carbon are formed with oxygen, hydrogen,\nnitrogen, sulphur, chlorine and many other elements giving rise to\ncompounds with specific properties which depend on the elements\nother than carbon present in the molecule.\nAgain the bonds that carbon forms with most other elements are\nvery strong making these compounds exceptionally stable. One\nreason for the formation of strong bonds by carbon is its small size.\nThis enables the nucleus to hold on to the shared pairs of electrons\nstrongly. The bonds formed by elements having bigger atoms are\nmuch weaker.\n2024-25",
      "content_type": "text",
      "token_count": 604,
      "page_number": 4
    },
    {
      "id": "4af7bc9b-ff31-4669-a820-7509ec660320",
      "chapter_id": "6265d226-0712-4e87-9ae1-e0a82cc0b8e9",
      "chunk_index": 2,
      "content": "--- Page 6 ---\nCarbon and its Compounds 63\nOrganic compounds\nThe two characteristic features seen in carbon, that is, tetravalency and catenation, put\ntogether give rise to a large number of compounds. Many have the same non-carbon\natom or group of atoms attached to different carbon chains. These compounds were\ninitially extracted from natural substances and it was thought that these carbon\ncompounds or organic compounds could only be formed within a living system. That is,\nit was postulated that a ‘vital force’ was necessary for their synthesis. Friedrich Wöhler\ndisproved this in 1828 by preparing urea from ammonium cyanate. But carbon\ncompounds, except for carbides, oxides of carbon, carbonate and hydrogencarbonate\nsalts continue to be studied under organic chemistry.\n4.2.1 Saturated and Unsaturated Carbon Compounds4.2.1 Saturated and Unsaturated Carbon Compounds4.2.1 Saturated and Unsaturated Carbon Compounds4.2.1 Saturated and Unsaturated Carbon Compounds4.2.1 Saturated and Unsaturated Carbon Compounds\nWe have already seen the structur e of methane. Another compound\nformed between carbon and hydrogen is ethane with a formula of C2H6.\nIn order to arrive at the structure of simple carbon\ncompounds, the first step is to link the carbon atoms\ntogether with a single bond (Fig. 4.6a) and then use the\nhydrogen atoms to satisfy the remaining valencies of carbon\n(Fig. 4.6b). For example, the structure of ethane is arrived\nin the following steps –\nC—C Step 1\nFigure 4.6 Figure 4.6 Figure 4.6 Figure 4.6 Figure 4.6 (a) Carbon atoms linked together with a single bond\nThree valencies of each carbon atom remain unsatisfied,\nso each is bonded to three hydrogen atoms giving:\nStep 2\nFigure 4.6 Figure 4.6 Figure 4.6 Figure 4.6 Figure 4.6 (b)     Each carbon atom bonded to three hydrogen atoms\nThe electron dot structure of ethane is shown in Fig. 4.6(c).\nCan you draw the structure of propane, which has the molecular\nformula C3H8 in a similar manner? You will see that the valencies of all\nthe atoms are satisfied by single bonds between them. Such carbon\ncompounds are called saturated compounds. These compounds are\nnormally not very reactive.\nHowever, another compound of carbon and hydrogen has the formula\nC2H4 and is called ethene. How can this molecule be depicted? We follow\nthe same step-wise approach as above.\nCarbon-carbon atoms linked together with a single bond (Step 1).\nWe see that one valency per carbon atom r emains unsatisfied\n(Step 2). This can be satisfied only if there is a double bond between the\ntwo carbons (Step 3).\nFigure 4.6Figure 4.6Figure 4.6Figure 4.6Figure 4.6\n(c)     Electron dot structure of\nethane\nMore to Know!\nStep 2\nStep 3\nC—C        Step 1\n2024-25",
      "content_type": "example",
      "token_count": 676,
      "page_number": 4
    },
    {
      "id": "ea9a1f43-38a2-4efc-97a2-0ed85c9a74fe",
      "chapter_id": "6265d226-0712-4e87-9ae1-e0a82cc0b8e9",
      "chunk_index": 3,
      "content": "--- Page 7 ---\nScience64\nThe electron dot structure for ethene is given in Fig. 4.7.\nYet another compound of hydrogen and carbon has the formula\nC2H2 and is called ethyne. Can you draw the electron dot\nstructure for ethyne? How many bonds are necessary between\nthe two carbon atoms in order to satisfy their valencies? Such\ncompounds of carbon having double or triple bonds between\nthe carbon atoms are known as unsaturated carbon compounds\nand they are more reactive than the saturated carbon\ncompounds.\n4.2.2 Chains, Branches and Rings\nIn the earlier section, we mentioned the carbon compounds methane,\nethane and propane, containing respectively 1, 2 and 3 carbon atoms.\nSuch ‘chains’ of carbon atoms can contain many more carbon atoms.\nThe names and structures of six of these are given in Table 4.2.\nFigure 4.7Figure 4.7Figure 4.7Figure 4.7Figure 4.7\nStructure of ethene\nTable 4.2 Formulae and structures of saturated compounds of carbon and hydrogen\nNo. of C Name Formula Structure\natoms\n1 Methane CH4\n2 Ethane C2H6\n3 Propane C3H8\n4 Butane C4H10\n5 Pentane C5H12\n6 Hexane C6H14\n2024-25\n\n--- Page 8 ---\nCarbon and its Compounds 65\nBut, let us take another look at butane. If we make the carbon\n‘skeleton’ with four carbon atoms, we see that two different possible\n‘skeletons’ are –\nC—C—C—C\nFigure 4.8 Figure 4.8 Figure 4.8 Figure 4.8 Figure 4.8 (a) Two possible carbon-skeletons\nFilling the remaining valencies with hydrogen gives us –\nFigure 4.8 Figure 4.8 Figure 4.8 Figure 4.8 Figure 4.8 (b) Complete molecules for two structures with formula C4H10\nWe see that both these structures have the same formula C4H10. Such\ncompounds with identical molecular formula but different structures\nare called structural isomers.\nIn addition to straight and branched carbon chains, some compounds\nhave carbon atoms arranged in the form of a ring. For example, cyclohexane\nhas the formula C6H12 and the following structure –\n(a) (b)\nFigure 4.9 Figure 4.9 Figure 4.9 Figure 4.9 Figure 4.9 Structure of cyclohexane (a) carbon skeleton (b) complete molecule\nCan you draw the electron dot structure for cyclohexane? Straight\nchain, branched chain and cyclic carbon compounds, all may be saturated\nor unsaturated. For example, benzene, C6H6, has the following structure –\nBenzene — C 6H6\nFigure 4.10 Figure 4.10 Figure 4.10 Figure 4.10 Figure 4.10 Structure of benzene\nAll these carbon compounds which contain only carbon and\nhydrogen are called hydrocarbons. Among these, the saturated\nhydrocarbons are called alkanes. The unsaturated hydrocarbons which\ncontain one or more double bonds are called alkenes. Those containing\none or more triple bonds are called alkynes.\n4.2.3 Will you be my Friend?\nCarbon seems to be a very friendly element. So far we have been looking at\ncompounds containing carbon and hydrogen only. But carbon also forms\n2024-25",
      "content_type": "example",
      "token_count": 709,
      "page_number": 4
    },
    {
      "id": "e6e770e1-6cfb-4791-8f2b-172f7b861d13",
      "chapter_id": "6265d226-0712-4e87-9ae1-e0a82cc0b8e9",
      "chunk_index": 4,
      "content": "--- Page 9 ---\nScience66\nbonds with other elements such as halogens, oxygen, nitrogen and sulphur.\nIn a hydrocarbon chain, one or more hydrogens can be replaced by these\nelements, such that the valency of carbon remains satisfied. In such\ncompounds, the element replacing hydrogen is referred to as a heteroatom.\nThese heteroatoms are also present in some groups as given in Table 4.3.\nThese heteroatoms and\nthe group containing\nthese confer specific\nproperties to the\ncompound, regardless\nof the length and nature\nof the carbon chain and\nhence are called\nfunctional groups. Some\nimportant functional\ngroups are given in the\nTable 4.3. Free valency or\nvalencies of the group\nare shown by the single\nline. The functional group\nis attached to the carbon\nchain through this\nvalency by replacing one\nhydrogen   atom or\natoms.\n4.2.4 Homologous Series\nYou have seen that carbon atoms can be linked together to form chains\nof varying lengths. These chains can be branched also. In addition,\nhydrogen atom or other atoms on these carbon chains can be replaced\nby any of the functional groups that we saw above. The presence of a\nfunctional group such as alcohol decides the properties of the carbon\ncompound, regardless of the length of the carbon chain. For example,\nthe chemical properties of CH3OH, C2H5OH, C3H7OH and C4H9OH are all\nvery similar. Hence, such a series of compounds in which the same\nfunctional group substitutes for hydrogen in a carbon chain is called a\nhomologous series.\nLet us look at the homologous series that we saw earlier in Table\n4.2. If we look at the formulae of successive compounds, say –\nCH4 and C2H6 — these differ by a –CH2- unit\nC2H6 and C3H8 — these differ by a –CH2- unit\nWhat is the difference between the next pair – propane and butane (C4H10)?\nCan you find out the difference in molecular masses between these\npairs (the atomic mass of carbon is 12 u and the atomic mass of hydrogen\nis 1 u)?\nSimilarly, take the homologous series for alkenes. The first member\nof the series is ethene which we have already come across in\nSection 4.2.1. What is the formula for ethene? The succeeding members\nhave the formula C3H6, C4H8 and C5H10. Do these also differ by a –CH2–\nTable 4.3 Some functional groups in carbon compounds\nHetero HeteroHetero HeteroHetero Class of Class ofClass of Class ofClass of Formula ofFormula ofFormula ofFormula ofFormula of\natom atomatom atomatom compoundscompoundscompoundscompoundscompounds functional groupfunctional groupfunctional groupfunctional groupfunctional group\nCl/Br Halo- (Chloro/bromo) —Cl, —Br\nalkane (substitutes for\nhydrogen atom)\nOxygen 1. Alcohol —OH",
      "content_type": "example",
      "token_count": 655,
      "page_number": 9
    },
    {
      "id": "2befc7d0-ff5c-4772-aead-ad067c8cdf0a",
      "chapter_id": "54d83fee-7aea-463a-bad2-fbccb09b22b3",
      "chunk_index": 0,
      "content": "2024-25\n\n--- Page 10 ---\nCarbon and its Compounds 67\nunit? Do you see any relation between the number of carbon and\nhydrogen atoms in these compounds? The general formula for alkenes\ncan be written as CnH2n, where n = 2, 3, 4. Can you similarly generate the\ngeneral formula for alkanes and alkynes?\nAs the molecular mass increases in any homologous series, a\ngradation in physical properties is seen. This is because the melting and\nboiling points increase with increasing molecular mass. Other physical\nproperties such as solubility in a particular solvent also show a similar\ngradation. But the chemical properties, which are determined solely by\nthe functional group, remain similar in a homologous series.\nActivity 4.2Activity 4.2Activity 4.2Activity 4.2Activity 4.2\n4.2.5 Nomenclature of Carbon Compounds\nThe names of compounds in a homologous series are based on the name\nof the basic carbon chain modified by a “prefix” “phrase before” or “suffix”\n“phrase after” indicating the nature of the functional group. For example,\nthe names of the alcohols taken in Activity 4.2 are methanol, ethanol,\npropanol and butanol.\nNaming a carbon compound can be done by the following method –\n(i) Identify the number of carbon atoms in the compound. A compound\nhaving three carbon atoms would have the name propane.\n(ii) In case a functional group is present, it is indicated in the\nname of the compound with either a prefix or a suffix (as given\nin Table 4.4).\n(iii) If the name of the functional group is to be given as a suffix, and the\nsuffix of the functional group begins with a vowel a, e, i, o, u, then\nthe name of the carbon chain is modified by deleting the final ‘e’ and\nadding the appropriate suffix. For example, a three-carbon chain\nwith a ketone group would be named in the following manner –\nPropane – ‘e’ = propan + ‘one’ = propanone.\n(iv) If the carbon chain is unsaturated, then the final ‘ane’ in the name\nof the carbon chain is substituted by ‘ene’ or ‘yne’ as given in\nTable 4.4. For example, a three-carbon chain with a double bond\nwould be called propene and if it has a triple bond, it would be\ncalled propyne.\n/square6Calculate the difference in the formulae and molecular masses\nfor (a) CH3OH and C2H5OH (b) C2H5OH and C3H7OH, and (c) C3H7OH\nand C4H9OH.\n/square6Is there any similarity in these three?\n/square6Arrange these alcohols in the order of increasing carbon atoms to\nget a family. Can we call this family a homologous series?\n/square6Generate the homologous series for compounds containing up to\nfour carbons for the other functional groups given in Table 4.3.\n2024-25\n\n--- Page 11 ---\nScience68\nbromo, etc.\nQUESTIONS",
      "content_type": "example",
      "token_count": 661,
      "page_number": 10
    },
    {
      "id": "40476f45-723c-4368-ba26-638230367e1d",
      "chapter_id": "43a9ed41-fdd1-426e-8482-fb4e8c4401d9",
      "chunk_index": 0,
      "content": "of carbon compounds we see around us?",
      "content_type": "text",
      "token_count": 9,
      "page_number": 10
    },
    {
      "id": "c6556603-d259-4f41-a46c-e2b3a47bdb9a",
      "chapter_id": "6267f572-e773-4c8e-b4dd-186f5188ebb1",
      "chunk_index": 0,
      "content": "Table 4.4 Nomenclature of organic compounds\nClass of Prefix/Suffix Example\ncompounds",
      "content_type": "example",
      "token_count": 21,
      "page_number": 10
    },
    {
      "id": "ccf39d53-574a-4bdd-8cf3-0b76af41d819",
      "chapter_id": "d755dfdd-4012-47c4-bd70-566cb6503747",
      "chunk_index": 0,
      "content": "Bromopropane",
      "content_type": "text",
      "token_count": 3,
      "page_number": 10
    },
    {
      "id": "eae9f9fe-bbbf-4a2b-a750-121aae712d03",
      "chapter_id": "5e539028-5d8b-4928-aaeb-4b490f1af5b9",
      "chunk_index": 0,
      "content": "2024-25\n\n--- Page 12 ---\nCarbon and its Compounds 69\n?",
      "content_type": "text",
      "token_count": 13,
      "page_number": 10
    },
    {
      "id": "0c03e631-80b8-4954-8fab-923ae4e4c968",
      "chapter_id": "f737cb0a-13dc-40e8-86bc-63b7afeb8cb5",
      "chunk_index": 0,
      "content": "(i) Ethanoic acid (ii) Bromopentane *\n(iii) Butanone (iv) Hexanal.\n*Are structural isomers possible for bromopentane?",
      "content_type": "text",
      "token_count": 29,
      "page_number": 10
    },
    {
      "id": "1bc98120-1cb3-4d2b-8e47-b42c1d275b1e",
      "chapter_id": "cd03d6f8-9502-4ba5-83bd-04444a44c5c3",
      "chunk_index": 0,
      "content": "(i) CH3—CH 2—Br (ii)   \n(iii)\n4.3 CHEMICAL PROPERTIES OF CARBON COMPOUNDS\nIn this section we will be studying about some of the chemical properties\nof carbon compounds. Since most of the fuels we use are either carbon\nor its compounds, we shall first study combustion.\n4.3.1 Combustion4.3.1 Combustion4.3.1 Combustion4.3.1 Combustion4.3.1 Combustion\nCarbon, in all its allotropic forms, burns in oxygen to give carbon dioxide\nalong with the release of heat and light. Most carbon compounds also\nrelease a large amount of heat and light on burning. These are the\noxidation reactions that you learnt about in the first Chapter –\n(i) C + O2 →  CO2 + heat and light\n(ii) CH4 + O2 →  CO2 + H2O + heat and light\n(iii) CH3CH2OH + O2 →  CO2 + H2O + heat and light\nBalance the latter two reactions like you learnt in the first Chapter.\nActivity 4.3Activity 4.3Activity 4.3Activity 4.3Activity 4.3\nCAUTION: This Activity needs the teacher’s assistance.\n/square6Take some carbon compounds (naphthalene,\ncamphor, alcohol) one by one on a spatula and bur n\nthem.\n/square6Observe the nature of the flame and note whether\nsmoke is produced.\n/square6Place a metal plate above the flame. Is there a deposition\non the plate in case of any of the compounds?\nActivity 4.4Activity 4.4Activity 4.4Activity 4.4Activity 4.4\n/square6Light a bunsen burner and\nadjust the air hole at the\nbase to get different types of\nflames/presence of smoke.\n/square6When do you get a yellow,\nsooty flame?\n/square6When do you get a blue\nflame?\nSaturated hydrocarbons will generally give a clean flame while\nunsaturated carbon compounds will give a yellow flame with lots of\nblack smoke. This results in a sooty deposit on the metal plate in Activity\n4.3. However, limiting the supply of air results in incomplete combustion\nof even saturated hydrocarbons giving a sooty flame. The gas/kerosene\nstove used at home has inlets for air so that a sufficiently oxygen-rich\n2024-25",
      "content_type": "text",
      "token_count": 483,
      "page_number": 10
    },
    {
      "id": "069ae88c-a75d-45f1-b37f-ff4224f56031",
      "chapter_id": "cd03d6f8-9502-4ba5-83bd-04444a44c5c3",
      "chunk_index": 1,
      "content": "--- Page 13 ---\nScience70\nmixture is burnt to give a clean blue flame. If you observe the bottoms of\ncooking vessels getting blackened, it means that the air holes are blocked\nand fuel is getting wasted. Fuels such as coal and petroleum have some\namount of nitrogen and sulphur in them. Their combustion results in\nthe formation of oxides of sulphur and nitrogen which are major\npollutants in the environment.\nDo You Know?\nWhy do substances burn with or without a flame?\nHave you ever observed either a coal or a wood fire? If not, the next time you get a\nchance, take close note of what happens when the wood or coal starts to burn. You\nhave seen above that a candle or the LPG in the gas stove burns with a flame. However,\nyou will observe the coal or charcoal in an ‘angithi’ sometimes just glows red and\ngives out heat without a flame. This is because a flame is only produced when gaseous\nsubstances burn. When wood or charcoal is ignited, the volatile substances present\nvapourise and burn with a flame in the beginning.\nA luminous flame is seen when the atoms of the gaseous substance are heated and\nstart to glow. The colour produced by each element is a characteristic property of\nthat element. Try and heat a copper wire in the flame of a gas stove and observe its\ncolour. You have seen that incomplete combustion gives soot which is carbon. On\nthis basis, what will you attribute the yellow colour of a candle flame to?\nFormation of coal and petroleum\nCoal and petroleum have been formed from biomass which has been subjected to\nvarious biological and geological processes. Coal is the remains of trees, ferns, and\nother plants that lived millions of years ago. These were crushed into the earth,\nperhaps by earthquakes or volcanic eruptions. They were pressed down by layers of\nearth and rock. They slowly decayed into coal. Oil and gas are the remains of millions\nof tiny plants and animals that lived in the sea. When they died, their bodies sank to\nthe sea bed and were covered by silt. Bacteria attacked the dead remains, turning\nthem into oil and gas under the high pressures they were being subjected to.\nMeanwhile, the silt was slowly compressed into rock. The oil and gas seeped into the\nporous parts of the rock, and got trapped like water in a sponge. Can you guess why\ncoal and petroleum are called fossil fuels?\n4.3.2 Oxidation\nActivity 4.5Activity 4.5Activity 4.5Activity 4.5Activity 4.5\n/square6Take about 3 mL of ethanol in a test tube and warm it\ngently in a water bath.\n/square6Add a 5% solution of alkaline potassium permanganate\ndrop by drop to this solution.\n/square6Does the colour of potassium permanganate persist when\nit is added initially?\n/square6Why does the colour of potassium permanganate not\ndisappear when excess is added?\nYou have lear nt\nabout oxidation reactions in\nthe first Chapter . Carbon\ncompounds can be easily\noxidised on combustion. In\naddition to this complete\noxidation, we have reactions\nin which alcohols are\nconverted to carboxylic\nacids –\nMore to Know!\n2024-25",
      "content_type": "text",
      "token_count": 755,
      "page_number": 10
    },
    {
      "id": "42c2197b-4d88-45ee-b21f-ff376a8a4872",
      "chapter_id": "cd03d6f8-9502-4ba5-83bd-04444a44c5c3",
      "chunk_index": 2,
      "content": "--- Page 14 ---\nCarbon and its Compounds 71\nWe see that some substances are capable of adding oxygen to others.\nThese substances are known as oxidising agents.\nAlkaline potassium permanganate or acidified potassium dichromate\nare oxidising alcohols to acids, that is, adding oxygen to the starting\nmaterial. Hence they are known as oxidising agents.\n4.3.3 Addition Reaction\nUnsaturated hydrocarbons add hydrogen in the presence of catalysts\nsuch as palladium or nickel to give saturated hydrocarbons. Catalysts\nare substances that cause a reaction to occur or proceed at a different\nrate without the reaction itself being affected. This reaction is commonly\nused in the hydrogenation of vegetable oils using a nickel catalyst.\nVegetable oils generally have long unsaturated carbon chains while\nanimal fats have saturated carbon chains.\nYou must have seen advertisements stating that some vegetable oils\nare ‘healthy’. Animal fats generally contain saturated fatty acids which\nare said to be harmful for health. Oils containing unsaturated fatty acids\nshould be chosen for cooking.\n4.3.4 Substitution Reaction\nSaturated hydrocarbons are fairly unreactive and are inert in the presence\nof most reagents. However, in the presence of sunlight, chlorine is added\nto hydrocarbons in a very fast reaction. Chlorine can replace the hydrogen\natoms one by one. It is called a substitution reaction because one type\nof atom or a group of atoms takes the place of another . A number of\nproducts are usually formed with the higher homologues of alkanes.\nCH4 + Cl2 →  CH3Cl + HCl (in the presence of sunlight)\n?\nQUESTIONS",
      "content_type": "exercise",
      "token_count": 401,
      "page_number": 13
    },
    {
      "id": "c0e5eee2-9598-4a31-b1a1-a6c8cffddeeb",
      "chapter_id": "36c46015-dca9-4063-b472-ab113479eb42",
      "chunk_index": 0,
      "content": "a mixture of ethyne and air is not used?\n4.4 SOME IMPORT ANT C ARBON COMPOUNDS – ETHANOL\nAND ETHANOIC ACID\nMany carbon compounds are invaluable to us. But here we shall study\nthe properties of two commercially important compounds – ethanol and\nethanoic acid.\n2024-25",
      "content_type": "text",
      "token_count": 66,
      "page_number": 13
    },
    {
      "id": "dc465a2d-3c00-4551-87d2-6b5233e92bef",
      "chapter_id": "36c46015-dca9-4063-b472-ab113479eb42",
      "chunk_index": 1,
      "content": "--- Page 15 ---\nScience72\n4.4.1 Properties of Ethanol\nEthanol is a liquid at room temperature (refer to Table 4.1 for the melting\nand boiling points of ethanol). Ethanol is commonly called alcohol and\nis the active ingredient of all alcoholic drinks. In addition, because it is a\ngood solvent, it is also used in medicines such as tincture iodine, cough\nsyrups, and many tonics. Ethanol is also soluble in water in all\nproportions. Consumption of small quantities of dilute ethanol causes\ndrunkenness. Even though this practice is condemned, it is a socially\nwidespread practice. However, intake of even a small quantity of pure\nethanol (called absolute alcohol) can be lethal. Also, long-term\nconsumption of alcohol leads to many health problems.\nReactions of EthanolReactions of EthanolReactions of EthanolReactions of EthanolReactions of Ethanol\n(i) Reaction with sodium –\nActivity 4.6Activity 4.6Activity 4.6Activity 4.6Activity 4.6\nTeacher’s demonstration  –\n/square6Drop a small piece of sodium,\nabout the size of a couple of\ngrains of rice, into ethanol\n(absolute alcohol).\n/square6What do you observe?\n/square6How will you test the gas evolved?\n2Na + 2CH3CH2OH →  2CH3CH2O– Na+ + H2\n (Sodium ethoxide)\nAlcohols react with sodium leading to the\nevolution of hydrogen. With ethanol, the other\nproduct is sodium ethoxide. Can you recall which\nother substances produce hydrogen on reacting with\nmetals?\n(ii) Reaction to give unsaturated hydrocarbon: Heating ethanol at\n443 K with excess concentrated sulphuric acid results in the\ndehydration of ethanol to give ethene –\nCH CH OH CH  = CH  + H O3 2 2 2 2\nHo\nt Conc.\nH SO2 4\n−  →   \nThe concentrated sulphuric acid can be regarded as a dehydrating\nagent which removes water from ethanol.\nHow do alcohols affect living beings?\nWhen large quantities of ethanol are consumed, it tends to slow metabolic processes\nand to depress the central nervous system. This results in lack of coordination,\nmental confusion, drowsiness, lowering of the normal inhibitions, and finally stupor.\nThe individual may feel relaxed without realising that his sense of judgement, sense\nof timing, and muscular coordination have been seriously impaired.\nUnlike ethanol, intake of methanol in very small quantities can cause death. Methanol\nis oxidised to methanal in the liver. Methanal reacts rapidly with the components of\ncells. It coagulates the protoplasm, in much the same way an egg is coagulated by\ncooking. Methanol also affects the optic nerve, causing blindness.\nEthanol is an important industrial solvent. To prevent the misuse of ethanol produced\nfor industrial use, it is made unfit for drinking by adding poisonous substances\nlike methanol to it. Dyes are also added to colour the alcohol blue so that it can be\nidentified easily. This is called denatured alcohol.\nDo You Know?\n2024-25",
      "content_type": "exercise",
      "token_count": 708,
      "page_number": 13
    },
    {
      "id": "555e947f-49d3-4e21-9b10-beb6e7b9210f",
      "chapter_id": "36c46015-dca9-4063-b472-ab113479eb42",
      "chunk_index": 2,
      "content": "--- Page 16 ---\nCarbon and its Compounds 73\n4.4.2 Properties of Ethanoic Acid\nEthanoic acid is commonly called acetic acid and\nbelongs to a group of acids called carboxylic\nacids. 5-8% solution of acetic acid in water is\ncalled vinegar and is used widely as a preservative\nin pickles. The melting point of pure ethanoic acid\nis 290 K and hence it often freezes during winter\nin cold climates. This gave rise to its name glacial\nacetic acid.\nThe group of organic compounds called\ncarboxylic acids are obviously characterised by\ntheir acidic nature. However, unlike mineral acids\nlike HCl, which are completely ionised, carboxylic\nacids are weak acids.\nActivity 4.7Activity 4.7Activity 4.7Activity 4.7Activity 4.7\nn Compare the pH of dilute acetic acid\nand dilute hydrochloric acid using\nboth litmus paper and universal\nindicator.\nn Are both acids indicated by the\nlitmus test?\nn Does the universal indicator show\nthem as equally strong acids?\nActivity 4.8Activity 4.8Activity 4.8Activity 4.8Activity 4.8\nn Take 1 mL ethanol (absolute alcohol)\nand 1 mL glacial acetic acid along\nwith a few drops of concentrated\nsulphuric acid in a test tube.\nn Warm in a water-bath for at least five\nminutes as shown in Fig. 4.11.\nn Pour into a beaker containing\n20-50 mL of water and smell the\nresulting mixture.\nReactions of ethanoic acid:Reactions of ethanoic acid:Reactions of ethanoic acid:Reactions of ethanoic acid:Reactions of ethanoic acid:\n(i) Esterification reaction: Esters are most commonly\nformed by reaction of an acid and an alcohol.\nEthanoic acid reacts with absolute ethanol in the\npresence of an acid catalyst to give an ester –\nCH COOH CH CH OH CH C C CH CH H O3 3 2 3 2 3 2\nAcid\nO\n(E\n− + − − − − − +\n11\nt thanoic acid)            (Ethanol)                               (Ester)\nO\nGenerally, esters are sweet-smelling substances. These are used in\nmaking perfumes and as flavouring agents. On treating with sodium\nhydroxide, which is an alkali, the ester is converted back to  alcohol\nand sodium salt of carboxylic acid. This reaction is known as\nsaponification because it is used in the preparation of soap. Soaps\nare sodium or potassium salts of long chain carboxylic acid.\nFigure 4.11Figure 4.11Figure 4.11Figure 4.11Figure 4.11\nFormation of ester\nAlcohol as a fuelAlcohol as a fuelAlcohol as a fuelAlcohol as a fuelAlcohol as a fuel\nSugarcane plants are one of the most efficient convertors of sunlight into chemical\nenergy. Sugarcane juice can be used to prepare molasses which is fermented to give\nalcohol (ethanol). Some countries now use alcohol as an additive in petrol since it is a\ncleaner fuel which gives rise to only carbon dioxide and water on burning in sufficient\nair (oxygen).\nMore to Know!\n2024-25",
      "content_type": "text",
      "token_count": 679,
      "page_number": 13
    },
    {
      "id": "4ad5235b-4833-43b5-ae2a-f994585f95f5",
      "chapter_id": "36c46015-dca9-4063-b472-ab113479eb42",
      "chunk_index": 3,
      "content": "--- Page 17 ---\nScience74\nCH COOC H C H OH+CH COONa3 2 5 2 5 3\nNaOH\n(ii) Reaction with a base: Like mineral acids, ethanoic acid reacts with\na base such as sodium hydroxide to give a salt (sodium ethanoate\nor commonly called sodium acetate) and water:\nNaOH + CH3COOH →  CH3COONa + H2O\nHow does ethanoic acid react with carbonates and\nhydrogencarbonates?\nLet us perform an activity to find out.\nActivity 4.9Activity 4.9Activity 4.9Activity 4.9Activity 4.9\n/square6Set up the apparatus as shown in Chapter 2, Activity 2.5.\n/square6Take a spatula full of sodium carbonate in a test tube and add 2 mL of dilute\nethanoic acid.\n/square6What do you observe?\n/square6Pass the gas pr oduced through freshly prepared lime-water. What do you observe?\n/square6Can the gas produced by the reaction between ethanoic acid and sodium carbonate be\nidentified by this test?\n/square6Repeat this Activity with sodium hydrogencarbonate instead of sodium carbonate.\n(iii) Reaction with carbonates and hydrogencarbonates: Ethanoic acid\nreacts with carbonates and hydrogencarbonates to give rise to a\nsalt, carbon dioxide and water. The salt produced is commonly called\nsodium acetate.\n2CH3COOH + Na2CO3 →  2CH3COONa + H2O + CO2\nCH3COOH + NaHCO3 →  CH3COONa + H2O + CO2\nQUESTIONS",
      "content_type": "exercise",
      "token_count": 313,
      "page_number": 16
    },
    {
      "id": "8f821fa1-e12c-4ea9-909a-9b2fb9cb3ef2",
      "chapter_id": "7831c14d-5abe-4a7c-9cf9-4765076def84",
      "chunk_index": 0,
      "content": "a carboxylic acid?",
      "content_type": "text",
      "token_count": 4,
      "page_number": 16
    },
    {
      "id": "f16a0a8f-84e8-43fd-9a94-955674a25328",
      "chapter_id": "c71032a7-e044-45b5-8e81-005eba369a0c",
      "chunk_index": 0,
      "content": "4.5 SOAPS AND DETERGENTS\nActivity 4.10Activity 4.10Activity 4.10Activity 4.10Activity 4.10\n/square6Take about 10 mL of water each in two test tubes.\n/square6Add a drop of oil (cooking oil) to both  the test tubes\nand label them as A and B.\n/square6To test tube B, add a few drops of soap solution.\n/square6Now shake both the test tubes vigourously for\nthe same period of time.\n/square6Can you see the oil and water layers separately\nin both the test tubes immediately after you\nstop shaking them?\n/square6Leave the test tubes undisturbed for some time\nand observe. Does the oil layer separate out?\nIn which test tube does this happen first?\nFigure 4.12Figure 4.12Figure 4.12Figure 4.12Figure 4.12\nFormation of micelles\n?\n2024-25\n\n--- Page 18 ---\nCarbon and its Compounds 75\nThis activity demonstrates the effect of soap in cleaning. Most dirt is\noily in nature and as you know, oil does not dissolve in water . The\nmolecules of soap are sodium or potassium salts of long-chain carboxylic\nacids. The ionic-end of soap interacts with water while the carbon chain\ninteracts with oil. The soap molecules, thus form structures called\nmicelles (see Fig. 4.12) where one end of the molecules is towards the oil\ndroplet while the ionic-end faces outside. This forms an emulsion in\nwater. The soap micelle thus helps  in pulling out the dirt in water and\nwe can wash our clothes clean (Fig. 4.13).\nCan you draw the structure of the micelle that would be formed if\nyou dissolve soap in a hydrocarbon?\nMicelles\nSoaps are molecules in which the two ends have differing properties, one is hydrophilic,\nthat is, it interacts with water, while the other end is hydrophobic, that is, it interacts\nwith hydrocarbons. When soap is at the surface of water, the hydrophobic ‘tail’ of soap\nwill not be soluble in water and the soap will align along the surface of water with the\nionic end in water and the hydrocarbon ‘tail’ protruding out of water. Inside water,\nthese molecules have a unique orientation that keeps\nthe hydr ocarbon portion out of the water . Thus,\nclusters of molecules in which the hydrophobic tails\nare in the interior of the cluster and the ionic ends\nare on the surface of the cluster. This formation is\ncalled a micelle. Soap in the form of a micelle is able\nto clean, since the oily dirt will be collected in the\ncentre of the micelle. The micelles stay in solution as\na colloid and will not come together to precipitate\nbecause of ion-ion repulsion. Thus, the dirt\nsuspended in the micelles is also easily rinsed away.\nThe soap micelles are large enough to scatter light.\nHence a soap solution appears cloudy.\nFigure 4.13Figure 4.13Figure 4.13Figure 4.13Figure 4.13  Effect of soap in cleaning\nMore to Know!\n2024-25",
      "content_type": "exercise",
      "token_count": 680,
      "page_number": 16
    },
    {
      "id": "2839d37e-c4cb-496f-af95-5977edbb8d82",
      "chapter_id": "c71032a7-e044-45b5-8e81-005eba369a0c",
      "chunk_index": 1,
      "content": "--- Page 19 ---\nScience76\nActivity 4.11Activity 4.11Activity 4.11Activity 4.11Activity 4.11\n/square6Take about 10 mL of distilled water (or rain water) and 10 mL of\nhard water (from a tubewell or hand-pump) in separate test tubes.\n/square6Add a couple of drops of soap solution to both.\n/square6Shake the test tubes vigorously for an equal period of time and\nobserve the amount of foam formed.\n/square6In which test tube do you get more foam?\n/square6In which test tube do you observe a white curdy precipitate?\nNote for the teache r : If hard water is not available in your locality,\nprepare some hard water by dissolving hydrogencarbonates/\nsulphates/chlorides of calcium or magnesium in water .\nActivity 4.12Activity 4.12Activity 4.12Activity 4.12Activity 4.12\n/square6Take two test tubes with about 10 mL of hard water in each.\n/square6Add five drops of soap solution to one and five drops of detergent\nsolution to the other .\n/square6Shake both test tubes for the same period.\n/square6Do both test tubes have the same amount of foam?\n/square6In which test tube is a curdy solid formed?\n?\nQUESTIONS",
      "content_type": "exercise",
      "token_count": 275,
      "page_number": 18
    },
    {
      "id": "cdb66e08-6243-4942-a5a8-5e3a340dc9c8",
      "chapter_id": "5a53a341-de4c-4698-9aaf-9be0235860a9",
      "chunk_index": 0,
      "content": "the soap, they ‘beat’ the clothes on a stone, or beat it with a paddle,\nscrub with a brush or the mixture is agitated in a washing machine.\nWhy is agitation necessary to get clean clothes?\nHave you ever observed while bathing that foam is formed with\ndifficulty and an insoluble substance (scum) remains after washing with\nwater? This is caused by the reaction of soap with the calcium and\nmagnesium salts, which cause the hardness of water. Hence you need\nto use a larger amount of soap. This problem is overcome by using\nanother class of compounds called detergents as cleansing agents.\nDetergents are generally sodium salts of sulphonic acids or ammonium\nsalts with chlorides or bromides ions, etc. Both have long hydrocarbon\nchain. The charged ends of these compounds do not form insoluble\nprecipitates with the calcium and magnesium ions in hard water. Thus,\nthey remain effective in hard water. Detergents are usually used to make\nshampoos and products for cleaning clothes.\n2024-25\n\n--- Page 20 ---\nCarbon and its Compounds 77\nWhat you have learnt\n/square6Carbon is a versatile element that forms the basis for all living organisms and many\nof the things we use.\n/square6This large variety of compounds is formed by carbon because of its tetravalency\nand the property of catenation that it exhibits.\n/square6Covalent bonds are formed by the sharing of electrons between two atoms so that\nboth can achieve a completely filled outermost shell.\n/square6Carbon forms covalent bonds with itself and other elements such as hydrogen,\noxygen, sulphur, nitrogen and chlorine.\n/square6Carbon also forms compounds containing double and triple bonds between carbon\natoms. These carbon chains may be in the form of straight chains, branched chains\nor rings.\n/square6The ability of carbon to form chains gives rise to a homologous series of compounds\nin which the same functional group is attached to carbon chains of different lengths.\n/square6The functional groups such as alcohols, aldehydes, ketones and carboxylic acids\nbestow characteristic properties to the carbon compounds that contain them.\n/square6Carbon and its compounds are some of our major sources of fuels.\n/square6Ethanol and ethanoic acid are carbon compounds of importance in our daily lives.\n/square6The action of soaps and detergents is based on the presence of both hydrophobic\nand hydrophilic groups in the molecule and this helps to emulsify the oily dirt and\nhence its removal.\nEXERCISES",
      "content_type": "exercise",
      "token_count": 614,
      "page_number": 19
    },
    {
      "id": "088febea-1ae4-4d11-b788-611bddaa9bab",
      "chapter_id": "f8f8d1b4-460a-4e39-adba-3e152fc00aa3",
      "chunk_index": 0,
      "content": "(a) 6 covalent bonds.\n(b) 7 covalent bonds.\n(c) 8 covalent bonds.\n(d) 9 covalent bonds.",
      "content_type": "text",
      "token_count": 21,
      "page_number": 19
    },
    {
      "id": "0d687ee2-fe53-4646-8dde-9d10065d763f",
      "chapter_id": "d358b596-601e-41a0-b9ab-b725f92bf07f",
      "chunk_index": 0,
      "content": "(a) carboxylic acid.\n(b) aldehyde.\n(c) ketone.\n(d) alcohol.",
      "content_type": "text",
      "token_count": 14,
      "page_number": 19
    },
    {
      "id": "5a5a05a6-f65f-4045-a0c1-9588f79ec5f9",
      "chapter_id": "c64a8603-ad1b-46d6-93fd-c60028288f10",
      "chunk_index": 0,
      "content": "it means that\n(a) the food is not cooked completely.\n(b) the fuel is not burning completely.\n(c) the fuel is wet.\n(d) the fuel is burning completely.\n2024-25\n\n--- Page 21 ---\nScience78",
      "content_type": "text",
      "token_count": 46,
      "page_number": 19
    },
    {
      "id": "ef1f636a-911d-462f-a8e5-0adc06a811cf",
      "chapter_id": "784fcdbc-22ac-4614-a294-01838632beeb",
      "chunk_index": 0,
      "content": "(a) ethanoic acid.\n(b) H2S.\n(c) propanone.\n(d) F2 .",
      "content_type": "text",
      "token_count": 12,
      "page_number": 19
    },
    {
      "id": "04af7ba5-a493-4e70-8016-3b38392bbdcb",
      "chapter_id": "aaa28bc8-076b-4abf-8728-02f67b9e3e87",
      "chunk_index": 0,
      "content": "and chemical properties?",
      "content_type": "text",
      "token_count": 6,
      "page_number": 19
    },
    {
      "id": "6dabac53-25f4-45b0-a25a-fba2e753694a",
      "chapter_id": "8aa0979c-8329-4b8e-b5e7-715c02debc10",
      "chunk_index": 0,
      "content": "be formed in other solvents such as ethanol also?",
      "content_type": "exercise",
      "token_count": 12,
      "page_number": 19
    },
    {
      "id": "4e5d83e1-e4fb-4379-a69d-f304d7ddd7b6",
      "chapter_id": "4188a02a-dd7b-407c-8044-a2ea2fe710f5",
      "chunk_index": 0,
      "content": "C2H6, C3H8, C3H6, C2H2 and CH4.",
      "content_type": "text",
      "token_count": 7,
      "page_number": 19
    },
    {
      "id": "8728a5c9-1202-48ea-a7d5-2b2199b04fd5",
      "chapter_id": "cebfcdf9-9592-4dba-b550-cc311c882cdd",
      "chunk_index": 0,
      "content": "hydrocarbons.",
      "content_type": "text",
      "token_count": 3,
      "page_number": 19
    },
    {
      "id": "03f20bfd-874b-4c0a-9a78-d28153089171",
      "chapter_id": "35b239e9-80ed-4ffb-b25a-8bd7852e2e20",
      "chunk_index": 0,
      "content": "I Use molecular model kits to make models of the compounds you have learnt in\nthis Chapter.\nII /square6Take about 20 mL of castor oil/cotton seed oil/linseed oil/soyabean oil in a\nbeaker. Add 30 mL of 20 % sodium hydroxide solution. Heat the mixture with\ncontinuous stirring for a few minutes till the mixture thickens. Add 5-10 g of\ncommon salt to this. Stir the mixture well and allow it to cool.\n/square6You can cut out the soap in fancy shapes. You can also add perfume to the\nsoap before it sets.\nGroup  Activity\n2024-25",
      "content_type": "text",
      "token_count": 131,
      "page_number": 20
    }
  ]
}