{
  "textbook": {
    "id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
    "file_name": "Class X Science NCERT - Ch 00 - 11CHAPTER.pdf",
    "title": "11CHAPTER",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 24,
    "file_size_mb": 1.870981216430664,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:14.700869",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 00 - 11CHAPTER.pdf"
  },
  "chapters": [
    {
      "id": "05d65d08-9593-4820-8c38-33381ca1c96c",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 3,
      "title": "3. Calculate the number of electrons constituting one coulomb of charge.",
      "topics": [],
      "start_page": 2,
      "end_page": 3,
      "content": "2024-25\n\n--- Page 3 ---\nElectricity 173\n11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE\nWhat makes the electric charge to flow? Let us consider the analogy of\nflow of water. Charges do not flow in a copper wire by themselves, just as\nwater in a perfectly horizontal tube does not flow. If one end of the tube\nis connected to a tank of water kept at a higher level, such that there is a\npressure difference between the two ends of the tube, water flows out of\nthe other end of the tube. For flow of charges in a conducting metallic\nwire, the gravity, of course, has no role to play; the electrons move only\nif there is a difference of electric pressure – called the potential difference –\nalong the conductor. This difference of potential may be produced by a\nbattery, consisting of one or more electric cells. The chemical action within\na cell generates the potential difference across the terminals of the cell,\neven when no current is drawn from it. When the cell is connected to a\nconducting circuit element, the potential difference sets the charges in\nmotion in the conductor and produces an electric current. In order to\nmaintain the current in a given electric circuit, the cell has to expend its\nchemical energy stored in it.\nWe define the electric potential difference between two points in an\nelectric circuit carrying some current as the work done to move a unit\ncharge from one point to the other –\nPotential differ\nence (V) between two points = Work done (W)/Charge (Q)\nV = W/Q (11.2)\nThe SI unit of electric potential difference is volt (V), named after\nAlessandro Volta (1745– 1827), an Italian physicist. One volt is the\npotential difference between two points in a current carrying conductor\nwhen 1 joule of work is done to move a charge of 1 coulomb from one\npoint to the other.\nTherefore, 1 volt = \n1 joule\n1 coulomb\n(11.3)\n1 V  = 1 J C–1\nThe potential difference is measured by means of an instrument called\nthe voltmeter. The voltmeter is always connected in parallel across the\npoints between which the potential difference is to be measured.\nExample 11.2\nHow much work is done in moving a charge of 2 C across two points\nhaving a potential difference 12 V?\nSolution\nThe amount of charge Q, that flows between two points at potential\ndifference V (= 12 V) is 2 C. Thus, the amount of work W, done in\nmoving the charge [from Eq. (11.2)] is\n2024-25\n\n--- Page 4 ---\nScience174\nW = VQ\n= 12 V × 2 C\n= 24 J.\nQUESTIONS\n?\n11.3 CIRCUIT DIAGRAM11.3 CIRCUIT DIAGRAM11.3 CIRCUIT DIAGRAM11.3 CIRCUIT DIAGRAM11.3 CIRCUIT DIAGRAM\nWe know that an electric circuit, as shown in Fig. 11.1, comprises a cell\n(or a battery), a plug key, electrical component(s), and connecting wires.\nIt is often convenient to draw a schematic diagram, in which different\ncomponents of the circuit are represented by the symbols conveniently\nused. Conventional symbols  used to represent some of the most\ncommonly used electrical components are given in Table 11.1.\nTable 11.1 Symbols of some commonly used components in circuit diagrams\nSl. Components Symbols\nNo.\n1 An electric cell\n2 A battery or a combination of cells\n3 Plug key or switch (open)\n4 Plug key or switch (closed)\n5 A wire joint\n6 Wires crossing without joining"
    },
    {
      "id": "75eb43c9-193d-484d-9c36-bf6a4595cd8c",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 4,
      "title": "1. Name a device that helps to maintain a potential difference across a",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "conductor ."
    },
    {
      "id": "48d85b7f-cf72-4d73-ab30-9f5f9e2c284f",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 5,
      "title": "2. What is meant by saying that the potential difference between two points",
      "topics": [],
      "start_page": 4,
      "end_page": 4,
      "content": "is 1 V?"
    },
    {
      "id": "90f40c5a-67a5-452f-8708-3589cca9021a",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 6,
      "title": "3. How much energy is given to each coulomb of charge passing through a",
      "topics": [],
      "start_page": 4,
      "end_page": 9,
      "content": "6 V battery?\n2024-25\n\n--- Page 5 ---\nElectricity 175\n11.4 OHM’S LA11.4 OHM’S LA11.4 OHM’S LA11.4 OHM’S LA11.4 OHM’S LA W WW WW\nIs there a relationship between the potential difference across a conductor\nand the current through it? Let us explore with an Activity.\nActivity 11.1Activity 11.1Activity 11.1Activity 11.1Activity 11.1\n/square6Set up a circuit as shown in Fig. 11.2,\nconsisting of a nichrome wire XY of length,\nsay 0.5 m, an ammeter , a voltmeter and\nfour cells of 1.5 V each. (Nichrome is an\nalloy of nickel, chromium, manganese, and\niron metals.)\n/square6First use only one cell as the source in the\ncircuit. Note the reading in the ammeter I,\nfor the current and reading of the voltmeter\nV for the potential difference across the\nnichrome wire XY in the circuit. Tabulate\nthem in the Table given.\n/square6Next connect two cells in the circuit and\nnote the respective readings of the ammeter and voltmeter for the values of current through\nthe nichrome wire and potential difference across the nichrome wire.\n/square6Repeat the above steps using three cells and then four cells in the circuit separately.\n/square6Calculate the ratio of V to I for each pair of potential difference V and current I.\nS. Number of cells Current through Potential difference V/I\nNo. used in the the nichrome across the (volt/ampere)\ncircuit wire, I nichrome\n(ampere) wire, V (volt)\n1 1\n2 2\n3 3\n4 4\n/square6Plot a graph between V and I, and observe the nature of the graph.\n7 Electric bulb  or    \n8 A resistor of resistance R\n9 Variable r esistance or r heostat  or \n10 Ammeter\n11 Voltmeter\nFigure 11.2Figure 11.2Figure 11.2Figure 11.2Figure 11.2  Electric circuit for studying Ohm’s law\n2024-25\n\n--- Page 6 ---\nScience176\nFigure 11.3Figure 11.3Figure 11.3Figure 11.3Figure 11.3\nV–I graph for a nichrome wire. A\nstraight line plot shows that as the\ncurrent through a wire increases, the\npotential difference across the wire\nincreases linearly – this is Ohm’s law.\nActivity 11.2Activity 11.2Activity 11.2Activity 11.2Activity 11.2\n/square6Take a nichrome wire, a torch bulb, a 10 W bulb and an ammeter (0 – 5 A range), a plug\nkey and some connecting wires.\n/square6Set up the circuit by connecting four dry cells of 1.5 V each in series with the ammeter\nleaving a gap XY in the circuit, as shown in Fig. 11.4.\nIn this Activity, you will find that approximately the\nsame value for V/I is obtained in each case. Thus the V–I\ngraph is a straight line that passes through the origin of\nthe graph, as shown in Fig. 11.3. Thus, \nV/I is a constant\nratio.\nIn 1827, a German physicist Georg Simon Ohm\n(1787–1854) found out the relationship between the current\nI, flowing in a metallic wire and the potential difference\nacross its terminals. The potential difference, V, across the\nends of a given metallic wire in an electric circuit is directly\nproportional to the current flowing through it,  provided its\ntemperature remains the same. This is called Ohm’s law. In\nother words –\nV ∝  I (11.4)\nor V/I = constant\n= R\nor V = IR (11.5)\nIn Eq. (11.4), R is a constant for the given metallic wire\nat a given temperature and is called its resistance. It is the\nproperty of a conductor to resist the flow of charges  through it. Its SI\nunit is ohm, represented by the Greek letter Ω . According to Ohm’s law,\nR = V/I (11.6)\nIf the potential difference across the two ends of a conductor is 1 V\nand the current through it is 1 A, then the resistance R, of the conductor\nis 1 Ω . That is, 1 ohm = \n1 volt\n1 ampere\nAlso from Eq. (11.5) we get\nI = V/R (11.7)\nIt is obvious from Eq. (11.7) that the current through a resistor is\ninversely proportional to its resistance. If the resistance is doubled the\ncurrent gets halved. In many practical cases it is necessary to increase\nor decrease the current in an electric circuit. A component used to\nregulate current without changing the voltage source is called variable\nresistance. In an electric circuit, a device called rheostat is often used to\nchange the resistance in the circuit. We will now study about electrical\nresistance of a conductor with the help of following Activity.\n2024-25\n\n--- Page 7 ---\nElectricity 177\nIn this Activity we observe that the current is different for different\ncomponents. Why do they differ? Certain components offer an easy path\nfor the flow of electric current while the others resist the flow. We know\nthat motion of electrons in an electric circuit constitutes an electric\ncurrent. The electrons, however, are not completely free to move within a\nconductor. They are restrained by the attraction of the atoms among\nwhich they move. Thus, motion of electrons through a conductor is\nretarded by its resistance. A component of a given size that offers a low\nresistance is a good conductor. A conductor having some appreciable\nresistance is called a resistor. A component of identical size that offers a\nhigher resistance is a poor conductor. An insulator of the same size offers\neven higher resistance.\n11.5 FA11.5 FA11.5 FA\n11.5 FA11.5 FA CTORS ON WHICH THE RESISTCTORS ON WHICH THE RESISTCTORS ON WHICH THE RESISTCTORS ON WHICH THE RESISTCTORS ON WHICH THE RESIST ANCE OF AANCE OF AANCE OF AANCE OF AANCE OF A\nCONDUCTOR DEPENDSCONDUCTOR DEPENDSCONDUCTOR DEPENDSCONDUCTOR DEPENDSCONDUCTOR DEPENDS\nFigure 11.4Figure 11.4Figure 11.4Figure 11.4Figure 11.4\n/square6Complete the cir cuit by connecting the nichr ome wir e in the gap XY . Plug the key. Note\ndown the ammeter reading. Take out the key from the plug. [Note:  Always take out the key\nfrom the plug after measuring the current through the circuit. ]\n/square6Replace the nichrome wire with the torch bulb in the circuit and find the current through\nit by measuring the r eading of the ammeter .\n/square6Now repeat the above step with the 10 W bulb in the gap XY .\n/square6Are the ammeter readings different for different components connected in the gap XY?\nWhat do the above observations indicate?\n/square6You may r epeat this Activity by keeping any material component in the gap. Observe the\nammeter readings in each case. Analyse the observations.\nActivity 11.3Activity 11.3Activity 11.3Activity 11.3Activity 11.3\n/square6Complete an electric cir cuit consisting of a cell, an ammeter , a nichrome wir e of length l\n[say, marked (1)]  \nand a plug key, as shown in Fig. 11.5.\n2024-25\n\n--- Page 8 ---\nScience178\nIt is observed that the ammeter reading decreases to one-half when\nthe length of the wire is doubled. The ammeter reading is increased when\na thicker wire of the same material and of the same length is used in the\ncircuit. A change in ammeter reading is observed when a wire of different\nmaterial of the same length and the same area of cross-section is used.\nOn applying Ohm’s law [Eqs. (11.5) – (11.7)], we observe that the\nresistance of the conductor depends (i) on its length, (ii) on its area of\ncross-section, and (iii) on the nature of its material. Precise measurements\nhave shown that resistance of a uniform metallic conductor is directly\nproportional to its length (l ) and inversely proportional to the area of\ncross-section (A). That is,\nR ∝  l (11.8)\nand R ∝  1/A (11.9)\nCombining Eqs. (11.8) and (11.9) we get\nR ∝  l\nA\nor, R = ρ l\nA (11.10)\nwhere ρ (rho) is a constant of proportionality and is called the electrical\nresistivity of the material of the conductor. The SI unit of resistivity is\nΩ  m. It is a characteristic property of the material. The metals and alloys\nFigure 11.5 Figure 11.5 Figure 11.5 Figure 11.5 Figure 11.5 Electric circuit to study the factors on which the  resistance of conducting wires depends\n/square6Now, plug the key. Note the curr ent in the ammeter .\n/square6Replace the nichrome wire by another nichrome wire of same thickness but twice the\nlength, that is 2 l [marked (2) in the Fig. 11.5].\n/square6Note the ammeter reading.\n/square6Now replace the wire by a thicker nichrome wire, of the same length l [marked (3)]. A\nthicker wire has a larger cross-sectional area. Again note down the current through the\ncircuit.\n/square6Instead of taking a nichrome wire, connect a copper wire [marked (4) in Fig. 11.5] in the\ncircuit. Let the wire be of the same length and same area of cross-section as that of the\nfirst nichrome wire [marked (1)]. Note the value of the current.\n/square6Notice the difference in the current in all cases.\n/square6Does the current depend on the length of the conductor?\n/square6Does the current depend on the area of cross-section of the wire used?\n2024-25\n\n--- Page 9 ---\nElectricity 179\nhave very low resistivity in the  range of 10–8  Ω  m to  10–6  Ω  m. They are\ngood conductors of electricity. Insulators like rubber and glass have\nresistivity of the order of 10 12 to 10 17 Ω  m. Both the resistance and\nresistivity of a material vary with temperature.\nTable 11.2 reveals that the resistivity of an alloy is generally higher\nthan that of its constituent metals. Alloys do not oxidise (burn) readily\nat high temperatures. For this reason, they are commonly used in\nelectrical heating devices, like electric iron, toasters etc. Tungsten is used\nalmost exclusively for filaments of electric bulbs, whereas copper and\naluminium are generally used for electrical transmission lines.\nTable 11.2 Electrical resistivity* of some substances at 20°C\nMaterial Resistivity ( ΩΩΩ\nΩΩ  m)\nConductors Silver 1.60 × 10–8\nCopper 1.62 × 10–8\nAluminium 2.63 × 10–8\nTungsten 5.20 × 10–8\nNickel 6.84 × 10–8\nIron 10.0 × 10–8\nChromium 12.9 × 10–8\nMercury 94.0 × 10–8\nManganese 1.84 × 10–6\nAlloys Constantan 49 × 10–6\n(alloy of Cu and Ni)\nManganin 44 × 10–6\n(alloy of Cu, Mn and Ni)\nNichrome 100 × 10–6\n(alloy of Ni, Cr, Mn and Fe)\nInsulators Glass 1010 – 1014\nHard rubber 1013 – 1016\nEbonite 1015 – 1017\nDiamond 1012 - 1013\nPaper (dry) 1012\n* You need not memorise these values. Y ou can use these values for solving numerical\nproblems.\nExample 11.3\n(a) How much current will an electric bulb draw from a 220 V source,\nif the resistance of the bulb filament is 1200 Ω ? (b) How much\ncurrent will an electric heater coil draw from a 220 V source, if\nthe resistance of the heater coil is 100 Ω ?\nSolution\n(a) We are given V = 220 V; R = 1200 Ω .\nFrom Eq. (12.6), we have the current I = 220 V/1200 Ω  = 0.18 A.\n(b) We are given, V = 220 V, R = 100 Ω .\nFrom Eq. (11.6), we have the current I = 220 V/100 Ω  = 2.2 A.\nNote the difference of current drawn by an electric bulb and electric\nheater from the same 220 V source!\n2024-25\n\n--- Page 10 ---\nScience180\nExample 11.4\nThe potential difference between the terminals of an electric heater\nis 60 V when it draws a current of 4 A from the source. What current\nwill the heater draw if the potential difference is increased to 120 V?\nSolution\nWe are given, potential difference V =  60 V, current I = 4 A.\nAccording to Ohm’s law, \n60 V= = 154 A\nVR I= Ω .\nWhen the potential difference is increased to 120 V the current is\ngiven by\ncurrent = \n120 V= = 8 A15 \nV\nR Ω .\nThe current through the heater becomes 8 A.\nExample 11.5\nResistance of a metal wire of length 1 m is 26 Ω  at 20°C. If the\ndiameter of the wire is 0.3 mm, what will be the resistivity of the\nmetal at that temperature? Using Table 11.2, predict the material\nof the wire.\nSolution\nWe are given the resistance R of the wir\ne = 26 Ω , the diameter\nd = 0.3 mm = 3 × 10 -4 m, and the length l of the wire = 1 m.\nTherefore, from Eq. (11.10), the resistivity of the given metallic wire is\nρ =  (RA/l)  =  (Rπ d2/4l )\nSubstitution of values in this gives\nρ =  1.84 × 10–6  Ω  m\nThe resistivity of the metal at 20°C is 1.84 × 10 –6  Ω  m. From\nTable 11.2, we see that this is the resistivity of manganese.\nExample 11.6\nA wire of given material having length l and area of cross-section A\nhas a resistance of 4 Ω.  What would be the resistance of another wire\nof the same material having length l/2 and area of cross-section 2A?\nSolution\nFor first wire\n R1\nρ= l\nA = 4Ω\nNow for second wire\nR2 ρ /2= 2\nl\nA  ρ= 1\n4\nl\nA\nR2\n1= 4 R1\nR2= 1Ω\nThe resistance of the new wire is 1Ω .\n2024-25\n\n--- Page 11 ---\nElectricity 181\nQUESTIONS\n?"
    },
    {
      "id": "1c3b45e5-beae-466a-ac2c-fe7a31592981",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 7,
      "title": "1. On what factors does the resistance of a",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "conductor depend?"
    },
    {
      "id": "0452858a-7e0d-4090-977a-ef14917589ca",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 8,
      "title": "2. Will current flow more easily through a thick",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "wire or a thin wire of the same material, when\nconnected to the same source? Why?"
    },
    {
      "id": "fb1d7fe8-76a2-4ada-8794-7efca864221e",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 9,
      "title": "3. Let the resistance of an electrical component",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "remains constant while the potential difference\nacross the two ends of the component\ndecreases to half of its former value. What\nchange will occur in the current through it?"
    },
    {
      "id": "3f716b53-cafe-454f-b9c2-e35301aeb5a4",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 10,
      "title": "4. Why are coils of electric toasters and electric",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "irons made of an alloy rather than a pure\nmetal?"
    },
    {
      "id": "f6067550-2d45-401c-8ad4-550e4acdb2d5",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 11,
      "title": "5. Use the data in Table 11.2 to answer the",
      "topics": [],
      "start_page": 9,
      "end_page": 12,
      "content": "following –\n(a) Which among iron and mercury is a better\nconductor?\n(b) Which material is the best conductor?\n11.6 RESIST11.6 RESIST11.6 RESIST11.6 RESIST11.6 RESIST ANCE OF A SYSTEM OF RESISTORSANCE OF A SYSTEM OF RESISTORSANCE OF A SYSTEM OF RESISTORSANCE OF A SYSTEM OF RESISTORSANCE OF A SYSTEM OF RESISTORS\nIn preceding sections, we learnt about some simple electric circuits. We\nhave noticed how the current through a conductor depends upon its\nresistance and the potential difference across its ends. In various electrical\ngadgets, we often use resistors in various combinations. We now therefore\nintend to see how Ohm’s law can be applied to combinations of resistors.\nThere are two methods of joining the resistors together. Figure 11.6\nshows an electric circuit in which three resistors having resistances R1,\nR2 and R3, respectively, are joined end to end. Here the resistors are said\nto be connected in series.\nFigure 11.6Figure 11.6Figure 11.6Figure 11.6Figure 11.6  Resistors in series\n2024-25\n\n--- Page 12 ---\nScience182\nFigure 11.7Figure 11.7Figure 11.7Figure 11.7Figure 11.7  Resistors in parallel\nYou will observe that the value of the current in the ammeter is the\nsame, independent of its position in the electric circuit. It means that in\na series combination of resistors the current is the same in every part of\nthe circuit or the same current through each resistor.\nActivity 11.4Activity 11.4Activity 11.4Activity 11.4Activity 11.4\n/square6Join three resistors of different values in series. Connect them\nwith a battery, an ammeter and a plug key, as shown in Fig. 11.6.\nYou may use the r esistors of values like 1 Ω , 2 Ω , 3 Ω  etc., and a\nbattery of 6 V for performing this Activity.\n/square6Plug the key. Note the ammeter reading.\n/square6Change the position of ammeter to anywhere in between the\nresistors. Note the ammeter reading each time.\n/square6Do you find any change in the value of current through the\nammeter?\n11.6.1 Resistors in Series\nWhat happens to the value of current when a number of resistors are\nconnected in series in a circuit? What would be their equivalent\nresistance? Let us try to understand these with the help of the following\nactivities.\nFigure 11.7 shows a combination of resistors in which three resistors\nare connected together between points X and Y. Here, the resistors are\nsaid to be connected in parallel.\n2024-25\n\n--- Page 13 ---\nElectricity 183\nActivity 11.5Activity 11.5Activity 11.5Activity 11.5Activity 11.5\n/square6In Activity 11.4, insert a voltmeter across the ends X and Y of the\nseries combination of three resistors, as shown in Fig. 11.6.\n/square6Plug the key in the circuit and note the voltmeter reading. It\ngives the potential difference across the series combination of\nresistors. Let it be V. Now measure the potential difference across\nthe two terminals of the battery. Compare the two values.\n/square6Take out the plug key and disconnect the voltmeter . Now insert\nthe voltmeter acr oss the ends X and P of the first r esistor, as\nshown in Fig. 11.8.\nFigure 11.8Figure 11.8Figure 11.8Figure 11.8Figure 11.8\n/square6Plug the key and measure the potential difference across the first\nresistor. Let it be V1.\n/square6Similarly, measure the potential difference across the other two\nresistors, separately. Let these values be V2 and V 3, respectively.\n/square6Deduce a relationship between V, V1, V2 and V3.\nYou will observe that the potential difference V is equal to the sum of\npotential differences V1, V2, and V3. That is the total potential difference\nacross a combination of resistors in series is equal to the sum of potential\ndifference across the individual resistors. That is,\nV = V1 + V2  + V3 (11.11)\nIn the electric circuit shown in Fig. 11.8, let I be the current through\nthe circuit. The current through each resistor is also I. It is possible to\nreplace the three resistors joined in series by an equivalent single resistor\nof resistance \nR, such that the potential difference V across it, and the\ncurrent I through the circuit remains the same. Applying the Ohm’s law\nto the entire circuit, we have\nV = I R (11.12)\n2024-25\n\n--- Page 14 ---\nScience184\nOn applying Ohm’s law to the three resistors separately, we further\nhave\nV1 = I R1 [11.13(a)]\nV2 = I R2 [11.13(b)]\nand V3 = I R3 [11.13(c)]\nFrom Eq. (11.11),\nI R = I R1 + I R2 + I R3\nor\nRs = R1 +R2 + R3 (11.14)\nWe can conclude that when several resistors are joined in series, the\nresistance of the combination R s equals the sum of their individual\nresistances, R1, R2, R3, and is thus greater than any individual resistance.\nExample 11.7\nAn electric lamp, whose resistance is 20 Ω , and a conductor of 4 Ω\nresistance are connected to a 6 V battery (Fig. 11.9). Calculate (a) the\ntotal resistance of the circuit, (b) the current through the circuit, and (c)\nthe potential difference across the electric lamp and conductor.\nSolution\nThe resistance of electric lamp, R1 = 20 Ω ,\nThe resistance of the conductor connected in series, R2 = 4 Ω .\nThen the total resistance in the circuit\nR = R1 + R2\nRs = 20 Ω\n + 4 Ω = 24 Ω .\nThe total potential difference across the two terminals of the battery\nV = 6 V.\nNow by Ohm’s law, the current through the circuit is given by\nI = V/Rs\n= 6 V/24 Ω\n= 0.25 A.\nFigure 11.9Figure 11.9Figure 11.9Figure 11.9Figure 11.9  An electric lamp connected in series with\na resistor of 4 Ω  to a 6 V battery\n2024-25\n\n--- Page 15 ---\nElectricity 185\nApplying Ohm’s law to the electric lamp and conductor separately,\nwe get potential difference across the electric lamp,\nV1 = 20 Ω ×  0.25 A\n= 5 V;\nand,\nthat across the conductor, V2  =  4 Ω  ×  0.25 A\n         =  1 V.\nSuppose that we like to replace the series combination of electric\nlamp and conductor by a single and equivalent resistor. Its resistance\nmust be such that a potential difference of 6 V across the battery\nterminals will cause a current of 0.25 A in the circuit. The resistance\nR of this equivalent resistor would be\nR = V/I\n= 6 V/ 0.25 A\n= 24 Ω .\nThis is the total resistance of the series circuit; it is equal to the sum\nof the two resistances.\nQUESTIONS\n?"
    },
    {
      "id": "7f33ac60-4331-4fe2-b778-2ed166cb3b28",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 12,
      "title": "1. Draw a schematic diagram of a circuit consisting of a battery of three",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "cells of 2 V each, a 5 Ω  resistor, an 8 Ω  resistor, and a 12 Ω  resistor, and\na plug key, all connected in series."
    },
    {
      "id": "339d6778-59e8-42b8-8114-503884d86201",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 13,
      "title": "2. Redraw the circuit of Question 1, putting in an ammeter to measure",
      "topics": [],
      "start_page": 12,
      "end_page": 15,
      "content": "the current through the resistors and a voltmeter to measure the\npotential difference across the 12 Ω  resistor. What would be the readings\nin the ammeter and the voltmeter?\n11.6.2 Resistors in Parallel\nNow, let us consider the arrangement of three resistors joined in parallel\nwith a combination of cells (or a battery), as shown in Fig.11.7.\nActivity 11.6Activity 11.6Activity 11.6Activity 11.6Activity 11.6\n/square6Make a parallel combination, XY, of three\nresistors having resistances R1, R 2, and R 3,\nrespectively. Connect it with a battery, a\nplug key and an ammeter , as shown in\nFig. 11.10. Also connect a voltmeter in\nparallel with the combination of resistors.\n/square6Plug the key and note the ammeter reading.\nLet the current be I. Also take the voltmeter\nreading. It gives the potential difference V,\nacross the combination. The potential\ndifference across each resistor is also V. This\ncan be checked by connecting the voltmeter\nacross each individual resistor (see\nFig. 11.11).\nFigure 11.10Figure 11.10Figure 11.10Figure 11.10Figure 11.10\n2024-25\n\n--- Page 16 ---\nScience186\n/square6Take out the plug from the key. Remove the ammeter and voltmeter from the circuit.\nInsert the ammeter in series with the resistor R1, as shown in Fig. 11.11. Note the ammeter\nreading, I1.\nFigure 11.11Figure 11.11Figure 11.11Figure 11.11Figure 11.11\n/square6Similarly, measure the currents through R2 and R3. Let these be I2 and I3, respectively.\nWhat is the relationship between I, I1, I2 and I3?\nIt is observed that the total current I , is equal to the sum of the\nseparate currents through each branch of the combination.\nI = I1 + I2 + I3 (11.15)\nLet Rp be the equivalent resistance of the parallel combination of\nresistors. By applying Ohm’s law to the parallel combination of resistors,\nwe have\nI = V/Rp (11.16)\nOn applying Ohm’s law to each resistor, we have\nI1 = V /R1;    I2 = V /R2; and I3 = V /R3 (11.17)\nFrom Eqs. (11.15) to (11.17), we have\n  V/Rp = V/R1 + V/R2 + V/R3\nor\n  1/Rp = 1/R1 + 1/R2 + 1/R3 (11.18)\nThus, we may conclude that the reciprocal of the equivalent resistance\nof a group of resistances joined in parallel is equal to the sum of the\nreciprocals of the individual resistances.\nExample 11.8\nIn the circuit diagram given in Fig. 11.10, suppose the resistors R1,\nR2 and R3 have the values 5 Ω , 10 Ω , 30 Ω , respectively, which have\nbeen connected to a battery of 12 V. Calculate (a) the current through\neach resistor, (b) the total current in the circuit, and (c) the total circuit\nresistance.\nSolution\nR1 = 5 Ω , R2 = 10 Ω , and R3 = 30 Ω .\nPotential difference across the battery, V = 12 V.\nThis is also the potential difference across each of the individual\nresistor; therefore, to calculate the current in the resistors, we use\nOhm’s law.\nThe current  I1, through \nR1 = V/ R1\nI1 = 12 V/5 Ω  = 2.4 A.\n2024-25\n\n--- Page 17 ---\nElectricity 187\nThe current  I2, through R2 = V/ R2\nI2 = 12 V/10 Ω = 1.2 A.\nThe current  I3, through R3 = V/R3\nI3 = 12 V/30 Ω = 0.4 A.\nThe total current in the circuit,\nI =  I1 + I2 + I3\n= (2.4 + 1.2 + 0.4) A\n= 4 A\nThe total resistance Rp, is given by [Eq. (11.18)]\n1 1 1 1 1\n5 10 30 3pR = + + =\nThus, Rp = 3 Ω .\nExample 11.9\nIf in Fig. 11.12, R1 = 10 Ω , R2 = 40 Ω , R3 = 30 Ω , R4 = 20 Ω , R5 = 60 Ω ,\nand a 12 V battery is connected to the arrangement. Calculate\n(a) the total resistance in the circuit, and (b) the total current flowing\nin the circuit.\nSolution\nSuppose we replace the parallel resistors R1 and R2 by an\nequivalent resistor of resistance, R\n′. Similarly we replace\nthe parallel resistors R3, R4 and R5 by an equivalent single\nresistor of resistance R″ . Then using Eq. (11.18), we have\n1/ R′ = 1/10 + 1/40 = 5/40; that is R′  = 8 Ω .\nSimilarly, 1/ R″ = 1/30 + 1/20 + 1/60 = 6/60;\nthat is, R″   = 10 Ω .\nThus, the total resistance, R = R′ + R″  = 18 Ω.\nTo calculate the current, we use Ohm’s law, and get\n I = V/R = 12 V/18 Ω = 0.67 A.\nWe have seen that in a series cir cuit the curr ent is constant\nthroughout the electric circuit. Thus it is obviously impracticable to\nconnect an electric bulb and an electric heater in series, because they\nneed currents of widely different values to operate properly (see Example\n11.3). Another major disadvantage of a series circuit is that when one\ncomponent fails the circuit is broken and none of the components works.\nIf you have used ‘fairy lights’ to decorate buildings on festivals, on\nmarriage celebrations etc., you might have seen the electrician spending\nlot of time in trouble-locating and replacing the ‘dead’ bulb – each has\nto be tested to find which has fused or gone. On the other hand, a parallel\ncircuit divides the current through the electrical gadgets. The total\nresistance in a parallel circuit is decreased as per Eq. (11.18). This is\nhelpful particularly when each gadget has different resistance and\nrequires different current to operate properly.\nFigure 11.12Figure 11.12Figure 11.12Figure 11.12Figure 11.12\nAn electric circuit showing\nthe combination of series\nand parallel resistors\n2024-25\n\n--- Page 18 ---\nScience188\n11.7 HEA 11.7 HEA11.7 HEA11.7 HEA11.7 HEA TING EFFECT OF ELECTRIC CURRENTTING EFFECT OF ELECTRIC CURRENTTING EFFECT OF ELECTRIC CURRENTTING EFFECT OF ELECTRIC CURRENTTING EFFECT OF ELECTRIC CURRENT\nWe know that a battery or a cell is a sour ce of electrical energy. The\nchemical reaction within the cell generates the potential difference between\nits two terminals that sets the electrons in motion to flow the current\nthrough a resistor or a system of resistors connected to the battery. We\nhave also seen, in Section 11.2, that to maintain the current, the source\nhas to keep expending its energy. Where does this energy go? A part of\nthe source energy in maintaining the current may be consumed into\nuseful work (like in rotating the blades of an electric fan). Rest of the\nsource energy may be expended in heat to raise the temperature of\ngadget. We often observe this in our everyday life. For example, an electric\nfan becomes warm if used continuously for longer time etc. On the other\nhand, if the electric circuit is purely resistive, that is, a configuration of\nresistors only connected to a battery; the source energy continually gets\ndissipated entirely in the form of heat. This is known as the heating\neffect of electric current. This effect is utilised in devices such as electric\nheater, electric iron etc.\nConsider a current \nI flowing through a resistor of resistance R. Let\nthe potential difference across it be V (Fig. 11.13). Let t be the time during\nwhich a charge Q flows across. The work done in moving the charge Q\nthrough a potential difference V is VQ. Therefore, the source must supply\nenergy equal to VQ in time t. Hence the power input to the circuit by the\nsource is\nP V VI =Q\nt = (11.19)\nOr the energy supplied to the circuit by the source in time t is P ×\n t,\nthat is, VIt. What happens to this energy expended by the source? This\nenergy gets dissipated in the resistor as heat. Thus for a steady\ncurrent I, the amount of heat H produced in time t is\nH = VIt (11.20)\nQUESTIONS\n?"
    },
    {
      "id": "83088e44-4ca8-41fc-9ca9-d2d0e598780a",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 14,
      "title": "1. Judge the equivalent resistance when the following are connected in",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "parallel – (a) 1 Ω  and 10 6 Ω,  (b) 1 Ω  and 10 3 Ω , and 10 6 Ω ."
    },
    {
      "id": "27d5e9ec-0a17-4967-a14b-c3738401919f",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 15,
      "title": "2. An electric lamp of 100 Ω , a toaster of resistance 50 Ω , and a water",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "filter of resistance 500 Ω  are connected in parallel to a 220 V source.\nWhat is the resistance of an electric iron connected to the same source\nthat takes as much current as all three appliances, and what is the\ncurrent through it?"
    },
    {
      "id": "98f8fe37-63e1-4f8b-a496-f9ff82ec52d5",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 16,
      "title": "3. What are the advantages of connecting electrical devices in parallel",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "with the battery instead of connecting them in series?"
    },
    {
      "id": "631bc485-34ed-4cac-b84b-2a6bd7c6e4fb",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 17,
      "title": "4. How can three resistors of resistances 2 Ω , 3 Ω , and 6 Ω  be connected",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "to give a total resistance of (a) 4 Ω , (b) 1 Ω ?"
    },
    {
      "id": "ff460b62-b221-4799-99b8-bb606b26c1d8",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 18,
      "title": "5. What is (a) the highest, (b) the lowest total resistance that can be secured",
      "topics": [],
      "start_page": 15,
      "end_page": 17,
      "content": "by combinations of four coils of resistance 4 Ω , 8 Ω , 12 Ω , 24 Ω ?\n2024-25\n\n--- Page 19 ---\nElectricity 189\nApplying Ohm’s law [Eq. (11.5)], we get\nH = I2 Rt (11.21)\nThis is known as Joule’s law of heating. The\nlaw implies that heat produced in a resistor is\n(i) directly proportional to the square of current\nfor a given resistance, (ii) directly proportional to\nresistance for a given current, and (iii) directly\nproportional to the time for which the current flows\nthrough the resistor. In practical situations, when\nan electric appliance is connected to a known\nvoltage source, Eq. (11.21) is used after\ncalculating the current through it, using the\nrelation I = V/R.\nExample 11.10\nAn electric iron consumes energy at a rate of 840 W when heating is\nat the maximum rate and 360 W when the heating is at the minimum.\nThe voltage is 220 V. What are the current and the resistance in each\ncase?\nSolution\nFrom Eq. (11.19), we know that the power input is\nP = V I\nThus the current I = P/V\n(a) When heating is at the maximum rate,\nI = 840 W/220 V = 3.82 A;\nand the resistance of the electric iron is\nR = V/I = 220 V/3.82 A = 57.60 Ω.\n(b) When heating is at the minimum rate,\nI = 360 W/220 V = 1.64 A;\nand the resistance of the electric iron is\nR = V/I = 220 V/1.64 A = 134.15 Ω.\nExample 11.11\n100 J of heat is produced each second in a 4 Ω resistance. Find the\npotential difference across the resistor.\nSolution\nH = 100 J, R = 4 Ω , t = 1 s, V = ?\nFrom Eq. (11.21) we have the current through the resistor as\nI = √ (H/Rt)\n= √\n[100 J/(4 Ω  × 1 s)]\n= 5 A\nThus the potential difference across the resistor, V [from Eq. (11.5)] is\nV = IR\n= 5 A × 4 Ω\n= 20 V.\nFigure 11.13Figure 11.13Figure 11.13Figure 11.13Figure 11.13\nA steady current in a purely resistive electric circuit\n2024-25\n\n--- Page 20 ---\nScience190\n11.7.1 Practical Applications of Heating Effect of\nElectric Current\nThe generation of heat in a conductor is an inevitable consequence of\nelectric current. In many cases, it is undesirable as it converts useful\nelectrical energy into heat. In electric circuits, the unavoidable heating\ncan increase the temperature of the components and alter their properties.\nHowever, heating effect of electric current has many useful applications.\nThe electric laundry iron, electric toaster, electric oven, electric kettle\nand electric heater are some of the familiar devices based on Joule’s\nheating.\nThe electric heating is also used to produce light, as in an electric\nbulb. Here, the filament must retain as much of the heat generated as is\npossible, so that it gets very hot and emits light. It must not melt at such\nhigh temperature. A strong metal with high melting point such as\ntungsten (melting point 3380°C) is used for making bulb filaments. The\nfilament should be thermally isolated as much as possible, using\ninsulating support, etc. The bulbs are usually filled with chemically\ninactive nitrogen and argon gases to prolong the life of filament. Most of\nthe power consumed by the filament appears as heat, but a small part\nof it is in the form of light radiated.\nAnother common application of Joule’s heating is the fuse used in\nelectric circuits. It protects circuits and appliances by stopping the flow\nof any unduly high electric current. The fuse is placed in series with\nthe device. It consists of a piece of wire made of a metal or an alloy of\nappropriate melting point, for example aluminium, copper, iron, lead\netc. If a current larger than the specified value flows through the circuit,\nthe temperature of the fuse wire increases. This melts the fuse wire and\nbreaks the circuit. The fuse wire is usually encased in a cartridge of\nporcelain or similar material with metal ends. The fuses used for domestic\npurposes are rated as 1 A, 2 A, 3 A, 5 A, 10 A, etc. For an electric iron\nwhich consumes 1 kW electric power when operated at 220 V, a current\nof (1000/220) A, that is, 4.54 A will flow in the circuit. In this case, a 5 A\nfuse must be used.\nQUESTIONS\n?"
    },
    {
      "id": "e56b7537-b0d7-440c-b3e4-e38c776964c4",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 19,
      "title": "1. Why does the cord of an electric heater not glow while the heating element",
      "topics": [],
      "start_page": 17,
      "end_page": 17,
      "content": "does?"
    },
    {
      "id": "221494b7-ac48-4a1e-9678-79af3f9963af",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 20,
      "title": "2. Compute the heat generated while transferring 96000 coulomb of charge",
      "topics": [],
      "start_page": 17,
      "end_page": 17,
      "content": "in one hour thr ough a potential dif ference of 50 V ."
    },
    {
      "id": "f846cc54-075a-4909-a10e-3b5a942a5bbc",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 21,
      "title": "3. An electric iron of resistance 20 Ω  takes a current of 5 A. Calculate the",
      "topics": [],
      "start_page": 17,
      "end_page": 18,
      "content": "heat developed in 30 s.\n2024-25\n\n--- Page 21 ---\nElectricity 191\n11.8 ELECTRIC POWER11.8 ELECTRIC POWER11.8 ELECTRIC POWER11.8 ELECTRIC POWER11.8 ELECTRIC POWER\nYou have studied in your earlier Class that the rate of doing work is\npower. This is also the rate of consumption of energy.\nEquation (11.21) gives the rate at which electric energy is dissipated\nor consumed in an electric circuit. This is also termed as electric power.\nThe power P is given by\nP  =  VI\nOr P  =  I2R = V2/R (11.22)\nThe SI unit of electric power is watt (W). It is the power consumed by\na device that carries 1 A of current when operated at a potential difference\nof 1 V. Thus,\n       1 W  =  1 volt ×  1 ampere = 1 V A (11.23)\nThe unit ‘watt’ is very small. Therefore, in actual practice we use a\nmuch larger unit called ‘kilowatt’. It is equal to 1000 watts. Since electrical\nenergy is the product of power and time, the unit of electric energy is,\ntherefore, watt hour (W h). One watt hour is the energy consumed when\n1 watt of power is used for 1 hour. The commercial unit of electric energy\nis kilowatt hour (kW h), commonly known as ‘unit’.\n1 kW h = 1000 watt × 3600 second\n= 3.6 × 106 watt second\n= 3.6 × 106 joule (J)\nMore to Know!\nMany people think that electrons are consumed in an electric circuit. This is wrong!\nWe pay the electricity board or electric company to provide energy to move electrons\nthrough the electric gadgets like electric bulb, fan and engines. We pay for the energy\nthat we use.\nExample 11.12\nAn electric bulb is connected to a 220 V generator. The current is\n0.50 A. What is the power of the bulb?\nSolution\nP = VI\n= 220 V ×  0.50 A\n= 110 J/s\n= 110 W.\nExample 11.13\nAn electric refrigerator rated 400 W operates 8 hour/day. What is\nthe cost of the energy to operate it for 30 days at Rs 3.00 per kW h?\n2024-25\n\n--- Page 22 ---\nScience192\nQUESTIONS\n?"
    },
    {
      "id": "b0189e78-4708-4dc1-b115-d1efba6a669e",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 23,
      "title": "2. An electric motor takes 5 A from a 220 V line. Determine the power of",
      "topics": [],
      "start_page": 18,
      "end_page": 19,
      "content": "the motor and the energy consumed in 2 h.\nWhat you have learnt\n/square6A stream of electrons moving through a conductor constitutes an electric current.\nConventionally, the direction of current is taken opposite to the direction of flow of\nelectrons.\n/square6The SI unit of electric current is ampere.\n/square6To set the electrons in motion in an electric circuit, we use a cell or a battery. A cell\ngenerates a potential difference across its terminals. It is measured in volts (V).\n/square6Resistance is a property that resists the flow of electrons in a conductor. It controls\nthe magnitude of the current. The SI unit of resistance is ohm (Ω).\n/square6Ohm’s law: The potential difference across the ends of a resistor is directly\nproportional to the current through it, provided its temperature remains the same.\n/square6The resistance of a conductor depends directly on its length, inversely on its area of\ncross-section, and also on the material of the conductor.\n/square6The equivalent resistance of several resistors in series is equal to the sum of\ntheir individual resistances.\n/square6A set of resistors connected in parallel has an equivalent resistance \nRp given by\n1 2 3\n1 1 1 1 ...\npR R R R= + + +\n/square6The electrical energy dissipated in a resistor is given by\nW = V × I ×  t\n/square6The unit of power is watt (W). One watt of power is consumed when 1 A of current\nflows at a potential difference of 1 V.\n/square6The commercial unit of electrical energy is kilowatt hour (kWh).\n1 kW h = 3,600,000 J = 3.6 ×\n 106 J.\nSolution\nThe total energy consumed by the refrigerator in 30 days would be\n400 W × 8.0 hour/day × 30 days = 96000 W h\n= 96 kW h\nThus the cost of energy to operate the refrigerator for 30 days is\n96 kW h ×  Rs 3.00 per kW h = Rs 288.00\n2024-25\n\n--- Page 23 ---\nElectricity 193\nEXERCISES"
    },
    {
      "id": "3053ee26-41ea-4e31-8642-db8a98bc9e53",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 24,
      "title": "1. A piece of wire of resistance R  is cut into five equal parts. These parts are then",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "connected in parallel. If the equivalent resistance of this combination is R′, then the\nratio R/R′ is  –\n(a) 1/25 (b) 1/5 (c) 5 (d) 25"
    },
    {
      "id": "a4292258-6dca-4f03-bafc-c426dd3599e6",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 25,
      "title": "2. Which of the following terms does not represent electrical power in a circuit?",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "(a) I2R (b) IR2 (c) VI (d) V2/R"
    },
    {
      "id": "9a2cc0bd-5e34-4f9d-a628-2676f32eb4bf",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 26,
      "title": "3. An electric bulb is rated 220 V and 100 W . When it is operated on 110 V , the",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "power consumed will be –\n(a) 100 W (b) 75 W (c) 50 W (d) 25 W"
    },
    {
      "id": "6a228894-939b-4403-8dfe-89b34536a561",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 27,
      "title": "4. Two conducting wires of the same material and of equal lengths and equal diameters",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "are first connected in series and then parallel in a circuit across the same potential\ndifference. The ratio of heat produced in series and parallel combinations would be –\n(a) 1:2 (b) 2:1 (c) 1:4 (d) 4:1"
    },
    {
      "id": "4599b3ab-1540-49eb-86ae-3fd4f63c69b5",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 28,
      "title": "5. How is a voltmeter connected in the circuit to measure the potential difference between",
      "topics": [],
      "start_page": 19,
      "end_page": 19,
      "content": "two points?"
    },
    {
      "id": "1f932633-cbf8-49c2-8430-8148bea66c55",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 29,
      "title": "6. A copper wire has diameter 0.5 mm and resistivity of 1.6 × 10–8  Ω  m. What will be",
      "topics": [],
      "start_page": 19,
      "end_page": 20,
      "content": "the length of this wire to make its resistance 10 Ω ? How much does the resistance\nchange if the diameter is doubled?"
    },
    {
      "id": "5db6a5cf-72e8-46a2-8ec0-c7e76ee29b10",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 30,
      "title": "7. The values of current I flowing in a given resistor for the corresponding values of",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "potential difference V across the resistor are given below –\nI (amperes) 0.5 1.0 2.0 3.0 4.0\nV (volts) 1.6 3.4 6.7 10.2 13.2\nPlot a graph between V and I and calculate the resistance of that resistor."
    },
    {
      "id": "1ffa6e38-53c6-42a7-bb64-d4bfc8713258",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 31,
      "title": "8. When a 12 V battery is connected across an unknown resistor, there is a current",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "of 2.5 mA in the circuit. Find the value of the resistance of the resistor."
    },
    {
      "id": "0511621b-49e1-4b69-9e9e-bdd4e4a6e3e2",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 32,
      "title": "9. A battery of 9 V is connected in series with resistors of 0.2 Ω , 0.3 Ω , 0.4 Ω  , 0.5 Ω",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "and 12 Ω , respectively. How much current would flow through the 12 Ω resistor?"
    },
    {
      "id": "f48e9bbe-3021-419d-8a99-8488ada0ad92",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 34,
      "title": "11. Show how you would connect three resistors, each of resistance 6 Ω , so that the",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "combination has a resistance of (i) 9 Ω , (ii) 4 Ω ."
    },
    {
      "id": "62194e7a-3184-455f-9640-eb92a1a0db1a",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 35,
      "title": "12. Several electric bulbs designed to be used on a 220 V electric supply line, are",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "rated 10 W. How many lamps can be connected in parallel with each other across\nthe two wires of 220 V line if the maximum allowable current is 5 A?"
    },
    {
      "id": "3b7da2c9-dedd-4b44-a6cc-fe45faea0157",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 36,
      "title": "13. A hot plate of an electric oven connected to a 220 V line has two resistance coils",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "A and B, each of 24 Ω  resistance, which may be used separately, in series, or in\nparallel. What are the currents in the three cases?"
    },
    {
      "id": "6df4e426-d24b-4aa6-9f1e-5d0bfc51c4c3",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 37,
      "title": "14. Compare the power used in the 2 Ω  resistor in each of the following circuits:",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "(i) a 6 V battery in series with 1 Ω  and 2 Ω  resistors, and (ii) a 4 V battery in parallel\nwith 12 Ω  and 2 Ω  resistors.\n2024-25\n\n--- Page 24 ---\nScience194 194194 194194"
    },
    {
      "id": "347662eb-39ac-49f5-bbe5-27864feba54b",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 38,
      "title": "15. Two lamps, one rated 100 W at 220 V, and the other 60 W at 220 V, are connected",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "in parallel to electric mains supply. What current is drawn from the line if the supply\nvoltage is 220 V?"
    },
    {
      "id": "a5e4d303-e9b2-47c5-901c-9acaa0060405",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 40,
      "title": "17. An electric heater of resistance 44 Ω draws 5 A from the service mains for 2 hours.",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "Calculate the rate at which heat is developed in the heater."
    },
    {
      "id": "c1d8b38d-ba9a-4c18-a342-4e238f68f060",
      "textbook_id": "2a89f091-06fd-4eb2-a937-880b8079a1d1",
      "chapter_number": 41,
      "title": "18. Explain the following.",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "(a) Why is the tungsten used almost exclusively for filament of electric lamps?\n(b) Why are the conductors of electric heating devices, such as bread-toasters\nand electric irons, made of an alloy rather than a pure metal?\n(c) Why is the series arrangement not used for domestic circuits?\n(d) How does the resistance of a wire vary with its area of cross-section?\n(e) Why are copper and aluminium wires usually employed for electricity\ntransmission?\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "d567f137-257e-4cf7-966e-bf103bf857c3",
      "chapter_id": "05d65d08-9593-4820-8c38-33381ca1c96c",
      "chunk_index": 0,
      "content": "2024-25\n\n--- Page 3 ---\nElectricity 173\n11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE11.2 ELECTRIC POTENTIAL AND POTENTIAL DIFFERENCE\nWhat makes the electric charge to flow? Let us consider the analogy of\nflow of water. Charges do not flow in a copper wire by themselves, just as\nwater in a perfectly horizontal tube does not flow. If one end of the tube\nis connected to a tank of water kept at a higher level, such that there is a\npressure difference between the two ends of the tube, water flows out of\nthe other end of the tube. For flow of charges in a conducting metallic\nwire, the gravity, of course, has no role to play; the electrons move only\nif there is a difference of electric pressure – called the potential difference –\nalong the conductor. This difference of potential may be produced by a\nbattery, consisting of one or more electric cells. The chemical action within\na cell generates the potential difference across the terminals of the cell,\neven when no current is drawn from it. When the cell is connected to a\nconducting circuit element, the potential difference sets the charges in\nmotion in the conductor and produces an electric current. In order to\nmaintain the current in a given electric circuit, the cell has to expend its\nchemical energy stored in it.\nWe define the electric potential difference between two points in an\nelectric circuit carrying some current as the work done to move a unit\ncharge from one point to the other –\nPotential differ\nence (V) between two points = Work done (W)/Charge (Q)\nV = W/Q (11.2)\nThe SI unit of electric potential difference is volt (V), named after\nAlessandro Volta (1745– 1827), an Italian physicist. One volt is the\npotential difference between two points in a current carrying conductor\nwhen 1 joule of work is done to move a charge of 1 coulomb from one\npoint to the other.\nTherefore, 1 volt = \n1 joule\n1 coulomb\n(11.3)\n1 V  = 1 J C–1\nThe potential difference is measured by means of an instrument called\nthe voltmeter. The voltmeter is always connected in parallel across the\npoints between which the potential difference is to be measured.\nExample 11.2\nHow much work is done in moving a charge of 2 C across two points\nhaving a potential difference 12 V?\nSolution\nThe amount of charge Q, that flows between two points at potential\ndifference V (= 12 V) is 2 C. Thus, the amount of work W, done in\nmoving the charge [from Eq. (11.2)] is\n2024-25",
      "content_type": "example",
      "token_count": 640,
      "page_number": 2
    },
    {
      "id": "f49d9bca-b4f6-44be-ade0-28d94c0ba283",
      "chapter_id": "05d65d08-9593-4820-8c38-33381ca1c96c",
      "chunk_index": 1,
      "content": "--- Page 4 ---\nScience174\nW = VQ\n= 12 V × 2 C\n= 24 J.\nQUESTIONS\n?\n11.3 CIRCUIT DIAGRAM11.3 CIRCUIT DIAGRAM11.3 CIRCUIT DIAGRAM11.3 CIRCUIT DIAGRAM11.3 CIRCUIT DIAGRAM\nWe know that an electric circuit, as shown in Fig. 11.1, comprises a cell\n(or a battery), a plug key, electrical component(s), and connecting wires.\nIt is often convenient to draw a schematic diagram, in which different\ncomponents of the circuit are represented by the symbols conveniently\nused. Conventional symbols  used to represent some of the most\ncommonly used electrical components are given in Table 11.1.\nTable 11.1 Symbols of some commonly used components in circuit diagrams\nSl. Components Symbols\nNo.\n1 An electric cell\n2 A battery or a combination of cells\n3 Plug key or switch (open)\n4 Plug key or switch (closed)\n5 A wire joint\n6 Wires crossing without joining",
      "content_type": "exercise",
      "token_count": 210,
      "page_number": 3
    },
    {
      "id": "49d428d5-dd59-4b60-8e3a-833eea85fc21",
      "chapter_id": "75eb43c9-193d-484d-9c36-bf6a4595cd8c",
      "chunk_index": 0,
      "content": "conductor .",
      "content_type": "text",
      "token_count": 2,
      "page_number": 4
    },
    {
      "id": "82ae8eff-13af-4379-baec-b1d3f7af0357",
      "chapter_id": "48d85b7f-cf72-4d73-ab30-9f5f9e2c284f",
      "chunk_index": 0,
      "content": "is 1 V?",
      "content_type": "text",
      "token_count": 1,
      "page_number": 4
    },
    {
      "id": "59220228-7f31-41c8-b12b-30e6905331b4",
      "chapter_id": "90f40c5a-67a5-452f-8708-3589cca9021a",
      "chunk_index": 0,
      "content": "6 V battery?\n2024-25\n\n--- Page 5 ---\nElectricity 175\n11.4 OHM’S LA11.4 OHM’S LA11.4 OHM’S LA11.4 OHM’S LA11.4 OHM’S LA W WW WW\nIs there a relationship between the potential difference across a conductor\nand the current through it? Let us explore with an Activity.\nActivity 11.1Activity 11.1Activity 11.1Activity 11.1Activity 11.1\n/square6Set up a circuit as shown in Fig. 11.2,\nconsisting of a nichrome wire XY of length,\nsay 0.5 m, an ammeter , a voltmeter and\nfour cells of 1.5 V each. (Nichrome is an\nalloy of nickel, chromium, manganese, and\niron metals.)\n/square6First use only one cell as the source in the\ncircuit. Note the reading in the ammeter I,\nfor the current and reading of the voltmeter\nV for the potential difference across the\nnichrome wire XY in the circuit. Tabulate\nthem in the Table given.\n/square6Next connect two cells in the circuit and\nnote the respective readings of the ammeter and voltmeter for the values of current through\nthe nichrome wire and potential difference across the nichrome wire.\n/square6Repeat the above steps using three cells and then four cells in the circuit separately.\n/square6Calculate the ratio of V to I for each pair of potential difference V and current I.\nS. Number of cells Current through Potential difference V/I\nNo. used in the the nichrome across the (volt/ampere)\ncircuit wire, I nichrome\n(ampere) wire, V (volt)\n1 1\n2 2\n3 3\n4 4\n/square6Plot a graph between V and I, and observe the nature of the graph.\n7 Electric bulb  or    \n8 A resistor of resistance R\n9 Variable r esistance or r heostat  or \n10 Ammeter\n11 Voltmeter\nFigure 11.2Figure 11.2Figure 11.2Figure 11.2Figure 11.2  Electric circuit for studying Ohm’s law\n2024-25",
      "content_type": "text",
      "token_count": 421,
      "page_number": 4
    },
    {
      "id": "ef0e6785-693e-4a76-bc9a-8f5392b47851",
      "chapter_id": "90f40c5a-67a5-452f-8708-3589cca9021a",
      "chunk_index": 1,
      "content": "--- Page 6 ---\nScience176\nFigure 11.3Figure 11.3Figure 11.3Figure 11.3Figure 11.3\nV–I graph for a nichrome wire. A\nstraight line plot shows that as the\ncurrent through a wire increases, the\npotential difference across the wire\nincreases linearly – this is Ohm’s law.\nActivity 11.2Activity 11.2Activity 11.2Activity 11.2Activity 11.2\n/square6Take a nichrome wire, a torch bulb, a 10 W bulb and an ammeter (0 – 5 A range), a plug\nkey and some connecting wires.\n/square6Set up the circuit by connecting four dry cells of 1.5 V each in series with the ammeter\nleaving a gap XY in the circuit, as shown in Fig. 11.4.\nIn this Activity, you will find that approximately the\nsame value for V/I is obtained in each case. Thus the V–I\ngraph is a straight line that passes through the origin of\nthe graph, as shown in Fig. 11.3. Thus, \nV/I is a constant\nratio.\nIn 1827, a German physicist Georg Simon Ohm\n(1787–1854) found out the relationship between the current\nI, flowing in a metallic wire and the potential difference\nacross its terminals. The potential difference, V, across the\nends of a given metallic wire in an electric circuit is directly\nproportional to the current flowing through it,  provided its\ntemperature remains the same. This is called Ohm’s law. In\nother words –\nV ∝  I (11.4)\nor V/I = constant\n= R\nor V = IR (11.5)\nIn Eq. (11.4), R is a constant for the given metallic wire\nat a given temperature and is called its resistance. It is the\nproperty of a conductor to resist the flow of charges  through it. Its SI\nunit is ohm, represented by the Greek letter Ω . According to Ohm’s law,\nR = V/I (11.6)\nIf the potential difference across the two ends of a conductor is 1 V\nand the current through it is 1 A, then the resistance R, of the conductor\nis 1 Ω . That is, 1 ohm = \n1 volt\n1 ampere\nAlso from Eq. (11.5) we get\nI = V/R (11.7)\nIt is obvious from Eq. (11.7) that the current through a resistor is\ninversely proportional to its resistance. If the resistance is doubled the\ncurrent gets halved. In many practical cases it is necessary to increase\nor decrease the current in an electric circuit. A component used to\nregulate current without changing the voltage source is called variable\nresistance. In an electric circuit, a device called rheostat is often used to\nchange the resistance in the circuit. We will now study about electrical\nresistance of a conductor with the help of following Activity.\n2024-25",
      "content_type": "text",
      "token_count": 605,
      "page_number": 4
    },
    {
      "id": "642ff225-f3a6-4a7e-8e51-48047d0932da",
      "chapter_id": "90f40c5a-67a5-452f-8708-3589cca9021a",
      "chunk_index": 2,
      "content": "--- Page 7 ---\nElectricity 177\nIn this Activity we observe that the current is different for different\ncomponents. Why do they differ? Certain components offer an easy path\nfor the flow of electric current while the others resist the flow. We know\nthat motion of electrons in an electric circuit constitutes an electric\ncurrent. The electrons, however, are not completely free to move within a\nconductor. They are restrained by the attraction of the atoms among\nwhich they move. Thus, motion of electrons through a conductor is\nretarded by its resistance. A component of a given size that offers a low\nresistance is a good conductor. A conductor having some appreciable\nresistance is called a resistor. A component of identical size that offers a\nhigher resistance is a poor conductor. An insulator of the same size offers\neven higher resistance.\n11.5 FA11.5 FA11.5 FA\n11.5 FA11.5 FA CTORS ON WHICH THE RESISTCTORS ON WHICH THE RESISTCTORS ON WHICH THE RESISTCTORS ON WHICH THE RESISTCTORS ON WHICH THE RESIST ANCE OF AANCE OF AANCE OF AANCE OF AANCE OF A\nCONDUCTOR DEPENDSCONDUCTOR DEPENDSCONDUCTOR DEPENDSCONDUCTOR DEPENDSCONDUCTOR DEPENDS\nFigure 11.4Figure 11.4Figure 11.4Figure 11.4Figure 11.4\n/square6Complete the cir cuit by connecting the nichr ome wir e in the gap XY . Plug the key. Note\ndown the ammeter reading. Take out the key from the plug. [Note:  Always take out the key\nfrom the plug after measuring the current through the circuit. ]\n/square6Replace the nichrome wire with the torch bulb in the circuit and find the current through\nit by measuring the r eading of the ammeter .\n/square6Now repeat the above step with the 10 W bulb in the gap XY .\n/square6Are the ammeter readings different for different components connected in the gap XY?\nWhat do the above observations indicate?\n/square6You may r epeat this Activity by keeping any material component in the gap. Observe the\nammeter readings in each case. Analyse the observations.\nActivity 11.3Activity 11.3Activity 11.3Activity 11.3Activity 11.3\n/square6Complete an electric cir cuit consisting of a cell, an ammeter , a nichrome wir e of length l\n[say, marked (1)]  \nand a plug key, as shown in Fig. 11.5.\n2024-25",
      "content_type": "text",
      "token_count": 546,
      "page_number": 4
    },
    {
      "id": "2e04102d-c2eb-457e-a120-10879fb05a69",
      "chapter_id": "90f40c5a-67a5-452f-8708-3589cca9021a",
      "chunk_index": 3,
      "content": "--- Page 8 ---\nScience178\nIt is observed that the ammeter reading decreases to one-half when\nthe length of the wire is doubled. The ammeter reading is increased when\na thicker wire of the same material and of the same length is used in the\ncircuit. A change in ammeter reading is observed when a wire of different\nmaterial of the same length and the same area of cross-section is used.\nOn applying Ohm’s law [Eqs. (11.5) – (11.7)], we observe that the\nresistance of the conductor depends (i) on its length, (ii) on its area of\ncross-section, and (iii) on the nature of its material. Precise measurements\nhave shown that resistance of a uniform metallic conductor is directly\nproportional to its length (l ) and inversely proportional to the area of\ncross-section (A). That is,\nR ∝  l (11.8)\nand R ∝  1/A (11.9)\nCombining Eqs. (11.8) and (11.9) we get\nR ∝  l\nA\nor, R = ρ l\nA (11.10)\nwhere ρ (rho) is a constant of proportionality and is called the electrical\nresistivity of the material of the conductor. The SI unit of resistivity is\nΩ  m. It is a characteristic property of the material. The metals and alloys\nFigure 11.5 Figure 11.5 Figure 11.5 Figure 11.5 Figure 11.5 Electric circuit to study the factors on which the  resistance of conducting wires depends\n/square6Now, plug the key. Note the curr ent in the ammeter .\n/square6Replace the nichrome wire by another nichrome wire of same thickness but twice the\nlength, that is 2 l [marked (2) in the Fig. 11.5].\n/square6Note the ammeter reading.\n/square6Now replace the wire by a thicker nichrome wire, of the same length l [marked (3)]. A\nthicker wire has a larger cross-sectional area. Again note down the current through the\ncircuit.\n/square6Instead of taking a nichrome wire, connect a copper wire [marked (4) in Fig. 11.5] in the\ncircuit. Let the wire be of the same length and same area of cross-section as that of the\nfirst nichrome wire [marked (1)]. Note the value of the current.\n/square6Notice the difference in the current in all cases.\n/square6Does the current depend on the length of the conductor?\n/square6Does the current depend on the area of cross-section of the wire used?\n2024-25",
      "content_type": "text",
      "token_count": 538,
      "page_number": 4
    },
    {
      "id": "cbdd1074-d267-4f47-8006-08a610996ab8",
      "chapter_id": "90f40c5a-67a5-452f-8708-3589cca9021a",
      "chunk_index": 4,
      "content": "--- Page 9 ---\nElectricity 179\nhave very low resistivity in the  range of 10–8  Ω  m to  10–6  Ω  m. They are\ngood conductors of electricity. Insulators like rubber and glass have\nresistivity of the order of 10 12 to 10 17 Ω  m. Both the resistance and\nresistivity of a material vary with temperature.\nTable 11.2 reveals that the resistivity of an alloy is generally higher\nthan that of its constituent metals. Alloys do not oxidise (burn) readily\nat high temperatures. For this reason, they are commonly used in\nelectrical heating devices, like electric iron, toasters etc. Tungsten is used\nalmost exclusively for filaments of electric bulbs, whereas copper and\naluminium are generally used for electrical transmission lines.\nTable 11.2 Electrical resistivity* of some substances at 20°C\nMaterial Resistivity ( ΩΩΩ\nΩΩ  m)\nConductors Silver 1.60 × 10–8\nCopper 1.62 × 10–8\nAluminium 2.63 × 10–8\nTungsten 5.20 × 10–8\nNickel 6.84 × 10–8\nIron 10.0 × 10–8\nChromium 12.9 × 10–8\nMercury 94.0 × 10–8\nManganese 1.84 × 10–6\nAlloys Constantan 49 × 10–6\n(alloy of Cu and Ni)\nManganin 44 × 10–6\n(alloy of Cu, Mn and Ni)\nNichrome 100 × 10–6\n(alloy of Ni, Cr, Mn and Fe)\nInsulators Glass 1010 – 1014\nHard rubber 1013 – 1016\nEbonite 1015 – 1017\nDiamond 1012 - 1013\nPaper (dry) 1012\n* You need not memorise these values. Y ou can use these values for solving numerical\nproblems.\nExample 11.3\n(a) How much current will an electric bulb draw from a 220 V source,\nif the resistance of the bulb filament is 1200 Ω ? (b) How much\ncurrent will an electric heater coil draw from a 220 V source, if\nthe resistance of the heater coil is 100 Ω ?\nSolution\n(a) We are given V = 220 V; R = 1200 Ω .\nFrom Eq. (12.6), we have the current I = 220 V/1200 Ω  = 0.18 A.\n(b) We are given, V = 220 V, R = 100 Ω .\nFrom Eq. (11.6), we have the current I = 220 V/100 Ω  = 2.2 A.\nNote the difference of current drawn by an electric bulb and electric\nheater from the same 220 V source!\n2024-25",
      "content_type": "example",
      "token_count": 487,
      "page_number": 4
    },
    {
      "id": "6c00974e-a7b4-4a31-a46f-d9abaf21062b",
      "chapter_id": "90f40c5a-67a5-452f-8708-3589cca9021a",
      "chunk_index": 5,
      "content": "--- Page 10 ---\nScience180\nExample 11.4\nThe potential difference between the terminals of an electric heater\nis 60 V when it draws a current of 4 A from the source. What current\nwill the heater draw if the potential difference is increased to 120 V?\nSolution\nWe are given, potential difference V =  60 V, current I = 4 A.\nAccording to Ohm’s law, \n60 V= = 154 A\nVR I= Ω .\nWhen the potential difference is increased to 120 V the current is\ngiven by\ncurrent = \n120 V= = 8 A15 \nV\nR Ω .\nThe current through the heater becomes 8 A.\nExample 11.5\nResistance of a metal wire of length 1 m is 26 Ω  at 20°C. If the\ndiameter of the wire is 0.3 mm, what will be the resistivity of the\nmetal at that temperature? Using Table 11.2, predict the material\nof the wire.\nSolution\nWe are given the resistance R of the wir\ne = 26 Ω , the diameter\nd = 0.3 mm = 3 × 10 -4 m, and the length l of the wire = 1 m.\nTherefore, from Eq. (11.10), the resistivity of the given metallic wire is\nρ =  (RA/l)  =  (Rπ d2/4l )\nSubstitution of values in this gives\nρ =  1.84 × 10–6  Ω  m\nThe resistivity of the metal at 20°C is 1.84 × 10 –6  Ω  m. From\nTable 11.2, we see that this is the resistivity of manganese.\nExample 11.6\nA wire of given material having length l and area of cross-section A\nhas a resistance of 4 Ω.  What would be the resistance of another wire\nof the same material having length l/2 and area of cross-section 2A?\nSolution\nFor first wire\n R1\nρ= l\nA = 4Ω\nNow for second wire\nR2 ρ /2= 2\nl\nA  ρ= 1\n4\nl\nA\nR2\n1= 4 R1\nR2= 1Ω\nThe resistance of the new wire is 1Ω .\n2024-25\n\n--- Page 11 ---\nElectricity 181\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 399,
      "page_number": 9
    },
    {
      "id": "65986895-d24a-40ba-93a1-f7931a218aa8",
      "chapter_id": "1c3b45e5-beae-466a-ac2c-fe7a31592981",
      "chunk_index": 0,
      "content": "conductor depend?",
      "content_type": "text",
      "token_count": 4,
      "page_number": 9
    },
    {
      "id": "e53bae6b-9f88-47d8-9849-c974ea3d21dd",
      "chapter_id": "0452858a-7e0d-4090-977a-ef14917589ca",
      "chunk_index": 0,
      "content": "wire or a thin wire of the same material, when\nconnected to the same source? Why?",
      "content_type": "text",
      "token_count": 20,
      "page_number": 9
    },
    {
      "id": "6b5b9386-e31a-4925-95ac-110d7cca1c62",
      "chapter_id": "fb1d7fe8-76a2-4ada-8794-7efca864221e",
      "chunk_index": 0,
      "content": "remains constant while the potential difference\nacross the two ends of the component\ndecreases to half of its former value. What\nchange will occur in the current through it?",
      "content_type": "text",
      "token_count": 43,
      "page_number": 9
    },
    {
      "id": "5a1c3329-308d-44f2-bab0-26e0457a2286",
      "chapter_id": "3f716b53-cafe-454f-b9c2-e35301aeb5a4",
      "chunk_index": 0,
      "content": "irons made of an alloy rather than a pure\nmetal?",
      "content_type": "text",
      "token_count": 12,
      "page_number": 9
    },
    {
      "id": "3b05e1e1-2398-48f2-811c-428dd3218cc0",
      "chapter_id": "f6067550-2d45-401c-8ad4-550e4acdb2d5",
      "chunk_index": 0,
      "content": "following –\n(a) Which among iron and mercury is a better\nconductor?\n(b) Which material is the best conductor?\n11.6 RESIST11.6 RESIST11.6 RESIST11.6 RESIST11.6 RESIST ANCE OF A SYSTEM OF RESISTORSANCE OF A SYSTEM OF RESISTORSANCE OF A SYSTEM OF RESISTORSANCE OF A SYSTEM OF RESISTORSANCE OF A SYSTEM OF RESISTORS\nIn preceding sections, we learnt about some simple electric circuits. We\nhave noticed how the current through a conductor depends upon its\nresistance and the potential difference across its ends. In various electrical\ngadgets, we often use resistors in various combinations. We now therefore\nintend to see how Ohm’s law can be applied to combinations of resistors.\nThere are two methods of joining the resistors together. Figure 11.6\nshows an electric circuit in which three resistors having resistances R1,\nR2 and R3, respectively, are joined end to end. Here the resistors are said\nto be connected in series.\nFigure 11.6Figure 11.6Figure 11.6Figure 11.6Figure 11.6  Resistors in series\n2024-25\n\n--- Page 12 ---\nScience182\nFigure 11.7Figure 11.7Figure 11.7Figure 11.7Figure 11.7  Resistors in parallel\nYou will observe that the value of the current in the ammeter is the\nsame, independent of its position in the electric circuit. It means that in\na series combination of resistors the current is the same in every part of\nthe circuit or the same current through each resistor.\nActivity 11.4Activity 11.4Activity 11.4Activity 11.4Activity 11.4\n/square6Join three resistors of different values in series. Connect them\nwith a battery, an ammeter and a plug key, as shown in Fig. 11.6.\nYou may use the r esistors of values like 1 Ω , 2 Ω , 3 Ω  etc., and a\nbattery of 6 V for performing this Activity.\n/square6Plug the key. Note the ammeter reading.\n/square6Change the position of ammeter to anywhere in between the\nresistors. Note the ammeter reading each time.\n/square6Do you find any change in the value of current through the\nammeter?\n11.6.1 Resistors in Series\nWhat happens to the value of current when a number of resistors are\nconnected in series in a circuit? What would be their equivalent\nresistance? Let us try to understand these with the help of the following\nactivities.\nFigure 11.7 shows a combination of resistors in which three resistors\nare connected together between points X and Y. Here, the resistors are\nsaid to be connected in parallel.\n2024-25",
      "content_type": "text",
      "token_count": 594,
      "page_number": 9
    },
    {
      "id": "afbb4403-6fa1-45f0-b1ac-6ce551a14d38",
      "chapter_id": "f6067550-2d45-401c-8ad4-550e4acdb2d5",
      "chunk_index": 1,
      "content": "--- Page 13 ---\nElectricity 183\nActivity 11.5Activity 11.5Activity 11.5Activity 11.5Activity 11.5\n/square6In Activity 11.4, insert a voltmeter across the ends X and Y of the\nseries combination of three resistors, as shown in Fig. 11.6.\n/square6Plug the key in the circuit and note the voltmeter reading. It\ngives the potential difference across the series combination of\nresistors. Let it be V. Now measure the potential difference across\nthe two terminals of the battery. Compare the two values.\n/square6Take out the plug key and disconnect the voltmeter . Now insert\nthe voltmeter acr oss the ends X and P of the first r esistor, as\nshown in Fig. 11.8.\nFigure 11.8Figure 11.8Figure 11.8Figure 11.8Figure 11.8\n/square6Plug the key and measure the potential difference across the first\nresistor. Let it be V1.\n/square6Similarly, measure the potential difference across the other two\nresistors, separately. Let these values be V2 and V 3, respectively.\n/square6Deduce a relationship between V, V1, V2 and V3.\nYou will observe that the potential difference V is equal to the sum of\npotential differences V1, V2, and V3. That is the total potential difference\nacross a combination of resistors in series is equal to the sum of potential\ndifference across the individual resistors. That is,\nV = V1 + V2  + V3 (11.11)\nIn the electric circuit shown in Fig. 11.8, let I be the current through\nthe circuit. The current through each resistor is also I. It is possible to\nreplace the three resistors joined in series by an equivalent single resistor\nof resistance \nR, such that the potential difference V across it, and the\ncurrent I through the circuit remains the same. Applying the Ohm’s law\nto the entire circuit, we have\nV = I R (11.12)\n2024-25",
      "content_type": "text",
      "token_count": 434,
      "page_number": 9
    },
    {
      "id": "d26fb53b-5377-436d-a239-ccceb99b8641",
      "chapter_id": "f6067550-2d45-401c-8ad4-550e4acdb2d5",
      "chunk_index": 2,
      "content": "--- Page 14 ---\nScience184\nOn applying Ohm’s law to the three resistors separately, we further\nhave\nV1 = I R1 [11.13(a)]\nV2 = I R2 [11.13(b)]\nand V3 = I R3 [11.13(c)]\nFrom Eq. (11.11),\nI R = I R1 + I R2 + I R3\nor\nRs = R1 +R2 + R3 (11.14)\nWe can conclude that when several resistors are joined in series, the\nresistance of the combination R s equals the sum of their individual\nresistances, R1, R2, R3, and is thus greater than any individual resistance.\nExample 11.7\nAn electric lamp, whose resistance is 20 Ω , and a conductor of 4 Ω\nresistance are connected to a 6 V battery (Fig. 11.9). Calculate (a) the\ntotal resistance of the circuit, (b) the current through the circuit, and (c)\nthe potential difference across the electric lamp and conductor.\nSolution\nThe resistance of electric lamp, R1 = 20 Ω ,\nThe resistance of the conductor connected in series, R2 = 4 Ω .\nThen the total resistance in the circuit\nR = R1 + R2\nRs = 20 Ω\n + 4 Ω = 24 Ω .\nThe total potential difference across the two terminals of the battery\nV = 6 V.\nNow by Ohm’s law, the current through the circuit is given by\nI = V/Rs\n= 6 V/24 Ω\n= 0.25 A.\nFigure 11.9Figure 11.9Figure 11.9Figure 11.9Figure 11.9  An electric lamp connected in series with\na resistor of 4 Ω  to a 6 V battery\n2024-25\n\n--- Page 15 ---\nElectricity 185\nApplying Ohm’s law to the electric lamp and conductor separately,\nwe get potential difference across the electric lamp,\nV1 = 20 Ω ×  0.25 A\n= 5 V;\nand,\nthat across the conductor, V2  =  4 Ω  ×  0.25 A\n         =  1 V.\nSuppose that we like to replace the series combination of electric\nlamp and conductor by a single and equivalent resistor. Its resistance\nmust be such that a potential difference of 6 V across the battery\nterminals will cause a current of 0.25 A in the circuit. The resistance\nR of this equivalent resistor would be\nR = V/I\n= 6 V/ 0.25 A\n= 24 Ω .\nThis is the total resistance of the series circuit; it is equal to the sum\nof the two resistances.\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 492,
      "page_number": 12
    },
    {
      "id": "a6bd7cc6-4b5f-4668-af3b-c9704395f8c5",
      "chapter_id": "7f33ac60-4331-4fe2-b778-2ed166cb3b28",
      "chunk_index": 0,
      "content": "cells of 2 V each, a 5 Ω  resistor, an 8 Ω  resistor, and a 12 Ω  resistor, and\na plug key, all connected in series.",
      "content_type": "text",
      "token_count": 29,
      "page_number": 12
    },
    {
      "id": "abdf4e34-dc52-4db8-b7af-41d14e2f41b6",
      "chapter_id": "339d6778-59e8-42b8-8114-503884d86201",
      "chunk_index": 0,
      "content": "the current through the resistors and a voltmeter to measure the\npotential difference across the 12 Ω  resistor. What would be the readings\nin the ammeter and the voltmeter?\n11.6.2 Resistors in Parallel\nNow, let us consider the arrangement of three resistors joined in parallel\nwith a combination of cells (or a battery), as shown in Fig.11.7.\nActivity 11.6Activity 11.6Activity 11.6Activity 11.6Activity 11.6\n/square6Make a parallel combination, XY, of three\nresistors having resistances R1, R 2, and R 3,\nrespectively. Connect it with a battery, a\nplug key and an ammeter , as shown in\nFig. 11.10. Also connect a voltmeter in\nparallel with the combination of resistors.\n/square6Plug the key and note the ammeter reading.\nLet the current be I. Also take the voltmeter\nreading. It gives the potential difference V,\nacross the combination. The potential\ndifference across each resistor is also V. This\ncan be checked by connecting the voltmeter\nacross each individual resistor (see\nFig. 11.11).\nFigure 11.10Figure 11.10Figure 11.10Figure 11.10Figure 11.10\n2024-25\n\n--- Page 16 ---\nScience186\n/square6Take out the plug from the key. Remove the ammeter and voltmeter from the circuit.\nInsert the ammeter in series with the resistor R1, as shown in Fig. 11.11. Note the ammeter\nreading, I1.\nFigure 11.11Figure 11.11Figure 11.11Figure 11.11Figure 11.11\n/square6Similarly, measure the currents through R2 and R3. Let these be I2 and I3, respectively.\nWhat is the relationship between I, I1, I2 and I3?\nIt is observed that the total current I , is equal to the sum of the\nseparate currents through each branch of the combination.\nI = I1 + I2 + I3 (11.15)\nLet Rp be the equivalent resistance of the parallel combination of\nresistors. By applying Ohm’s law to the parallel combination of resistors,\nwe have\nI = V/Rp (11.16)\nOn applying Ohm’s law to each resistor, we have\nI1 = V /R1;    I2 = V /R2; and I3 = V /R3 (11.17)\nFrom Eqs. (11.15) to (11.17), we have\n  V/Rp = V/R1 + V/R2 + V/R3\nor\n  1/Rp = 1/R1 + 1/R2 + 1/R3 (11.18)\nThus, we may conclude that the reciprocal of the equivalent resistance\nof a group of resistances joined in parallel is equal to the sum of the\nreciprocals of the individual resistances.\nExample 11.8\nIn the circuit diagram given in Fig. 11.10, suppose the resistors R1,\nR2 and R3 have the values 5 Ω , 10 Ω , 30 Ω , respectively, which have\nbeen connected to a battery of 12 V. Calculate (a) the current through\neach resistor, (b) the total current in the circuit, and (c) the total circuit\nresistance.\nSolution\nR1 = 5 Ω , R2 = 10 Ω , and R3 = 30 Ω .\nPotential difference across the battery, V = 12 V.\nThis is also the potential difference across each of the individual\nresistor; therefore, to calculate the current in the resistors, we use\nOhm’s law.\nThe current  I1, through \nR1 = V/ R1\nI1 = 12 V/5 Ω  = 2.4 A.\n2024-25",
      "content_type": "example",
      "token_count": 709,
      "page_number": 12
    },
    {
      "id": "8e16f76e-f392-4009-b342-06ea362dfb3f",
      "chapter_id": "339d6778-59e8-42b8-8114-503884d86201",
      "chunk_index": 1,
      "content": "--- Page 17 ---\nElectricity 187\nThe current  I2, through R2 = V/ R2\nI2 = 12 V/10 Ω = 1.2 A.\nThe current  I3, through R3 = V/R3\nI3 = 12 V/30 Ω = 0.4 A.\nThe total current in the circuit,\nI =  I1 + I2 + I3\n= (2.4 + 1.2 + 0.4) A\n= 4 A\nThe total resistance Rp, is given by [Eq. (11.18)]\n1 1 1 1 1\n5 10 30 3pR = + + =\nThus, Rp = 3 Ω .\nExample 11.9\nIf in Fig. 11.12, R1 = 10 Ω , R2 = 40 Ω , R3 = 30 Ω , R4 = 20 Ω , R5 = 60 Ω ,\nand a 12 V battery is connected to the arrangement. Calculate\n(a) the total resistance in the circuit, and (b) the total current flowing\nin the circuit.\nSolution\nSuppose we replace the parallel resistors R1 and R2 by an\nequivalent resistor of resistance, R\n′. Similarly we replace\nthe parallel resistors R3, R4 and R5 by an equivalent single\nresistor of resistance R″ . Then using Eq. (11.18), we have\n1/ R′ = 1/10 + 1/40 = 5/40; that is R′  = 8 Ω .\nSimilarly, 1/ R″ = 1/30 + 1/20 + 1/60 = 6/60;\nthat is, R″   = 10 Ω .\nThus, the total resistance, R = R′ + R″  = 18 Ω.\nTo calculate the current, we use Ohm’s law, and get\n I = V/R = 12 V/18 Ω = 0.67 A.\nWe have seen that in a series cir cuit the curr ent is constant\nthroughout the electric circuit. Thus it is obviously impracticable to\nconnect an electric bulb and an electric heater in series, because they\nneed currents of widely different values to operate properly (see Example\n11.3). Another major disadvantage of a series circuit is that when one\ncomponent fails the circuit is broken and none of the components works.\nIf you have used ‘fairy lights’ to decorate buildings on festivals, on\nmarriage celebrations etc., you might have seen the electrician spending\nlot of time in trouble-locating and replacing the ‘dead’ bulb – each has\nto be tested to find which has fused or gone. On the other hand, a parallel\ncircuit divides the current through the electrical gadgets. The total\nresistance in a parallel circuit is decreased as per Eq. (11.18). This is\nhelpful particularly when each gadget has different resistance and\nrequires different current to operate properly.\nFigure 11.12Figure 11.12Figure 11.12Figure 11.12Figure 11.12\nAn electric circuit showing\nthe combination of series\nand parallel resistors\n2024-25",
      "content_type": "example",
      "token_count": 548,
      "page_number": 12
    },
    {
      "id": "1006522b-ec79-46e0-bdea-9c6f49648cf0",
      "chapter_id": "339d6778-59e8-42b8-8114-503884d86201",
      "chunk_index": 2,
      "content": "--- Page 18 ---\nScience188\n11.7 HEA 11.7 HEA11.7 HEA11.7 HEA11.7 HEA TING EFFECT OF ELECTRIC CURRENTTING EFFECT OF ELECTRIC CURRENTTING EFFECT OF ELECTRIC CURRENTTING EFFECT OF ELECTRIC CURRENTTING EFFECT OF ELECTRIC CURRENT\nWe know that a battery or a cell is a sour ce of electrical energy. The\nchemical reaction within the cell generates the potential difference between\nits two terminals that sets the electrons in motion to flow the current\nthrough a resistor or a system of resistors connected to the battery. We\nhave also seen, in Section 11.2, that to maintain the current, the source\nhas to keep expending its energy. Where does this energy go? A part of\nthe source energy in maintaining the current may be consumed into\nuseful work (like in rotating the blades of an electric fan). Rest of the\nsource energy may be expended in heat to raise the temperature of\ngadget. We often observe this in our everyday life. For example, an electric\nfan becomes warm if used continuously for longer time etc. On the other\nhand, if the electric circuit is purely resistive, that is, a configuration of\nresistors only connected to a battery; the source energy continually gets\ndissipated entirely in the form of heat. This is known as the heating\neffect of electric current. This effect is utilised in devices such as electric\nheater, electric iron etc.\nConsider a current \nI flowing through a resistor of resistance R. Let\nthe potential difference across it be V (Fig. 11.13). Let t be the time during\nwhich a charge Q flows across. The work done in moving the charge Q\nthrough a potential difference V is VQ. Therefore, the source must supply\nenergy equal to VQ in time t. Hence the power input to the circuit by the\nsource is\nP V VI =Q\nt = (11.19)\nOr the energy supplied to the circuit by the source in time t is P ×\n t,\nthat is, VIt. What happens to this energy expended by the source? This\nenergy gets dissipated in the resistor as heat. Thus for a steady\ncurrent I, the amount of heat H produced in time t is\nH = VIt (11.20)\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 509,
      "page_number": 15
    },
    {
      "id": "b596f60c-68fa-42a0-ad1a-0e366331776e",
      "chapter_id": "83088e44-4ca8-41fc-9ca9-d2d0e598780a",
      "chunk_index": 0,
      "content": "parallel – (a) 1 Ω  and 10 6 Ω,  (b) 1 Ω  and 10 3 Ω , and 10 6 Ω .",
      "content_type": "text",
      "token_count": 16,
      "page_number": 15
    },
    {
      "id": "4a956f03-2e96-4756-8d80-9ab957ae6cd0",
      "chapter_id": "27d5e9ec-0a17-4967-a14b-c3738401919f",
      "chunk_index": 0,
      "content": "filter of resistance 500 Ω  are connected in parallel to a 220 V source.\nWhat is the resistance of an electric iron connected to the same source\nthat takes as much current as all three appliances, and what is the\ncurrent through it?",
      "content_type": "text",
      "token_count": 58,
      "page_number": 15
    },
    {
      "id": "291a386a-43c1-4837-a654-b8bc258bc6d3",
      "chapter_id": "98f8fe37-63e1-4f8b-a496-f9ff82ec52d5",
      "chunk_index": 0,
      "content": "with the battery instead of connecting them in series?",
      "content_type": "text",
      "token_count": 13,
      "page_number": 15
    },
    {
      "id": "c612128a-1c32-4566-8868-865ae09a55b6",
      "chapter_id": "631bc485-34ed-4cac-b84b-2a6bd7c6e4fb",
      "chunk_index": 0,
      "content": "to give a total resistance of (a) 4 Ω , (b) 1 Ω ?",
      "content_type": "text",
      "token_count": 12,
      "page_number": 15
    },
    {
      "id": "806b5188-f1d3-4449-a10b-e15f558ef96a",
      "chapter_id": "ff460b62-b221-4799-99b8-bb606b26c1d8",
      "chunk_index": 0,
      "content": "by combinations of four coils of resistance 4 Ω , 8 Ω , 12 Ω , 24 Ω ?\n2024-25\n\n--- Page 19 ---\nElectricity 189\nApplying Ohm’s law [Eq. (11.5)], we get\nH = I2 Rt (11.21)\nThis is known as Joule’s law of heating. The\nlaw implies that heat produced in a resistor is\n(i) directly proportional to the square of current\nfor a given resistance, (ii) directly proportional to\nresistance for a given current, and (iii) directly\nproportional to the time for which the current flows\nthrough the resistor. In practical situations, when\nan electric appliance is connected to a known\nvoltage source, Eq. (11.21) is used after\ncalculating the current through it, using the\nrelation I = V/R.\nExample 11.10\nAn electric iron consumes energy at a rate of 840 W when heating is\nat the maximum rate and 360 W when the heating is at the minimum.\nThe voltage is 220 V. What are the current and the resistance in each\ncase?\nSolution\nFrom Eq. (11.19), we know that the power input is\nP = V I\nThus the current I = P/V\n(a) When heating is at the maximum rate,\nI = 840 W/220 V = 3.82 A;\nand the resistance of the electric iron is\nR = V/I = 220 V/3.82 A = 57.60 Ω.\n(b) When heating is at the minimum rate,\nI = 360 W/220 V = 1.64 A;\nand the resistance of the electric iron is\nR = V/I = 220 V/1.64 A = 134.15 Ω.\nExample 11.11\n100 J of heat is produced each second in a 4 Ω resistance. Find the\npotential difference across the resistor.\nSolution\nH = 100 J, R = 4 Ω , t = 1 s, V = ?\nFrom Eq. (11.21) we have the current through the resistor as\nI = √ (H/Rt)\n= √\n[100 J/(4 Ω  × 1 s)]\n= 5 A\nThus the potential difference across the resistor, V [from Eq. (11.5)] is\nV = IR\n= 5 A × 4 Ω\n= 20 V.\nFigure 11.13Figure 11.13Figure 11.13Figure 11.13Figure 11.13\nA steady current in a purely resistive electric circuit\n2024-25",
      "content_type": "example",
      "token_count": 444,
      "page_number": 15
    },
    {
      "id": "c36c9001-4492-43ef-bb71-d50b325bf8d8",
      "chapter_id": "ff460b62-b221-4799-99b8-bb606b26c1d8",
      "chunk_index": 1,
      "content": "--- Page 20 ---\nScience190\n11.7.1 Practical Applications of Heating Effect of\nElectric Current\nThe generation of heat in a conductor is an inevitable consequence of\nelectric current. In many cases, it is undesirable as it converts useful\nelectrical energy into heat. In electric circuits, the unavoidable heating\ncan increase the temperature of the components and alter their properties.\nHowever, heating effect of electric current has many useful applications.\nThe electric laundry iron, electric toaster, electric oven, electric kettle\nand electric heater are some of the familiar devices based on Joule’s\nheating.\nThe electric heating is also used to produce light, as in an electric\nbulb. Here, the filament must retain as much of the heat generated as is\npossible, so that it gets very hot and emits light. It must not melt at such\nhigh temperature. A strong metal with high melting point such as\ntungsten (melting point 3380°C) is used for making bulb filaments. The\nfilament should be thermally isolated as much as possible, using\ninsulating support, etc. The bulbs are usually filled with chemically\ninactive nitrogen and argon gases to prolong the life of filament. Most of\nthe power consumed by the filament appears as heat, but a small part\nof it is in the form of light radiated.\nAnother common application of Joule’s heating is the fuse used in\nelectric circuits. It protects circuits and appliances by stopping the flow\nof any unduly high electric current. The fuse is placed in series with\nthe device. It consists of a piece of wire made of a metal or an alloy of\nappropriate melting point, for example aluminium, copper, iron, lead\netc. If a current larger than the specified value flows through the circuit,\nthe temperature of the fuse wire increases. This melts the fuse wire and\nbreaks the circuit. The fuse wire is usually encased in a cartridge of\nporcelain or similar material with metal ends. The fuses used for domestic\npurposes are rated as 1 A, 2 A, 3 A, 5 A, 10 A, etc. For an electric iron\nwhich consumes 1 kW electric power when operated at 220 V, a current\nof (1000/220) A, that is, 4.54 A will flow in the circuit. In this case, a 5 A\nfuse must be used.\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 549,
      "page_number": 17
    },
    {
      "id": "23db4960-a21c-4dfd-b16d-d52621ef518f",
      "chapter_id": "e56b7537-b0d7-440c-b3e4-e38c776964c4",
      "chunk_index": 0,
      "content": "does?",
      "content_type": "text",
      "token_count": 1,
      "page_number": 17
    },
    {
      "id": "946e4812-b178-48af-b669-9c3066160f98",
      "chapter_id": "221494b7-ac48-4a1e-9678-79af3f9963af",
      "chunk_index": 0,
      "content": "in one hour thr ough a potential dif ference of 50 V .",
      "content_type": "text",
      "token_count": 13,
      "page_number": 17
    },
    {
      "id": "d4353748-7bda-441c-a4c9-8cb75c41536a",
      "chapter_id": "f846cc54-075a-4909-a10e-3b5a942a5bbc",
      "chunk_index": 0,
      "content": "heat developed in 30 s.\n2024-25\n\n--- Page 21 ---\nElectricity 191\n11.8 ELECTRIC POWER11.8 ELECTRIC POWER11.8 ELECTRIC POWER11.8 ELECTRIC POWER11.8 ELECTRIC POWER\nYou have studied in your earlier Class that the rate of doing work is\npower. This is also the rate of consumption of energy.\nEquation (11.21) gives the rate at which electric energy is dissipated\nor consumed in an electric circuit. This is also termed as electric power.\nThe power P is given by\nP  =  VI\nOr P  =  I2R = V2/R (11.22)\nThe SI unit of electric power is watt (W). It is the power consumed by\na device that carries 1 A of current when operated at a potential difference\nof 1 V. Thus,\n       1 W  =  1 volt ×  1 ampere = 1 V A (11.23)\nThe unit ‘watt’ is very small. Therefore, in actual practice we use a\nmuch larger unit called ‘kilowatt’. It is equal to 1000 watts. Since electrical\nenergy is the product of power and time, the unit of electric energy is,\ntherefore, watt hour (W h). One watt hour is the energy consumed when\n1 watt of power is used for 1 hour. The commercial unit of electric energy\nis kilowatt hour (kW h), commonly known as ‘unit’.\n1 kW h = 1000 watt × 3600 second\n= 3.6 × 106 watt second\n= 3.6 × 106 joule (J)\nMore to Know!\nMany people think that electrons are consumed in an electric circuit. This is wrong!\nWe pay the electricity board or electric company to provide energy to move electrons\nthrough the electric gadgets like electric bulb, fan and engines. We pay for the energy\nthat we use.\nExample 11.12\nAn electric bulb is connected to a 220 V generator. The current is\n0.50 A. What is the power of the bulb?\nSolution\nP = VI\n= 220 V ×  0.50 A\n= 110 J/s\n= 110 W.\nExample 11.13\nAn electric refrigerator rated 400 W operates 8 hour/day. What is\nthe cost of the energy to operate it for 30 days at Rs 3.00 per kW h?\n2024-25\n\n--- Page 22 ---\nScience192\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 464,
      "page_number": 18
    },
    {
      "id": "e89b267f-20ce-420d-88cd-dd6a8be05c87",
      "chapter_id": "b0189e78-4708-4dc1-b115-d1efba6a669e",
      "chunk_index": 0,
      "content": "the motor and the energy consumed in 2 h.\nWhat you have learnt\n/square6A stream of electrons moving through a conductor constitutes an electric current.\nConventionally, the direction of current is taken opposite to the direction of flow of\nelectrons.\n/square6The SI unit of electric current is ampere.\n/square6To set the electrons in motion in an electric circuit, we use a cell or a battery. A cell\ngenerates a potential difference across its terminals. It is measured in volts (V).\n/square6Resistance is a property that resists the flow of electrons in a conductor. It controls\nthe magnitude of the current. The SI unit of resistance is ohm (Ω).\n/square6Ohm’s law: The potential difference across the ends of a resistor is directly\nproportional to the current through it, provided its temperature remains the same.\n/square6The resistance of a conductor depends directly on its length, inversely on its area of\ncross-section, and also on the material of the conductor.\n/square6The equivalent resistance of several resistors in series is equal to the sum of\ntheir individual resistances.\n/square6A set of resistors connected in parallel has an equivalent resistance \nRp given by\n1 2 3\n1 1 1 1 ...\npR R R R= + + +\n/square6The electrical energy dissipated in a resistor is given by\nW = V × I ×  t\n/square6The unit of power is watt (W). One watt of power is consumed when 1 A of current\nflows at a potential difference of 1 V.\n/square6The commercial unit of electrical energy is kilowatt hour (kWh).\n1 kW h = 3,600,000 J = 3.6 ×\n 106 J.\nSolution\nThe total energy consumed by the refrigerator in 30 days would be\n400 W × 8.0 hour/day × 30 days = 96000 W h\n= 96 kW h\nThus the cost of energy to operate the refrigerator for 30 days is\n96 kW h ×  Rs 3.00 per kW h = Rs 288.00\n2024-25\n\n--- Page 23 ---\nElectricity 193\nEXERCISES",
      "content_type": "exercise",
      "token_count": 454,
      "page_number": 19
    },
    {
      "id": "ee5b4506-9e70-4d9c-bb40-d1c62080c0f9",
      "chapter_id": "3053ee26-41ea-4e31-8642-db8a98bc9e53",
      "chunk_index": 0,
      "content": "connected in parallel. If the equivalent resistance of this combination is R′, then the\nratio R/R′ is  –\n(a) 1/25 (b) 1/5 (c) 5 (d) 25",
      "content_type": "text",
      "token_count": 33,
      "page_number": 19
    },
    {
      "id": "e39307a6-c00c-4b05-a4a2-fe5476aefbfe",
      "chapter_id": "a4292258-6dca-4f03-bafc-c426dd3599e6",
      "chunk_index": 0,
      "content": "(a) I2R (b) IR2 (c) VI (d) V2/R",
      "content_type": "text",
      "token_count": 7,
      "page_number": 19
    },
    {
      "id": "a15da955-fc13-482f-bb5b-2ea8447e51ea",
      "chapter_id": "9a2cc0bd-5e34-4f9d-a628-2676f32eb4bf",
      "chunk_index": 0,
      "content": "power consumed will be –\n(a) 100 W (b) 75 W (c) 50 W (d) 25 W",
      "content_type": "text",
      "token_count": 15,
      "page_number": 19
    },
    {
      "id": "9dccf6c9-7a15-4ab8-a0cb-559f0fb9b0f2",
      "chapter_id": "6a228894-939b-4403-8dfe-89b34536a561",
      "chunk_index": 0,
      "content": "are first connected in series and then parallel in a circuit across the same potential\ndifference. The ratio of heat produced in series and parallel combinations would be –\n(a) 1:2 (b) 2:1 (c) 1:4 (d) 4:1",
      "content_type": "text",
      "token_count": 51,
      "page_number": 19
    },
    {
      "id": "4913983e-3740-41d4-a97a-ac5a06ad2727",
      "chapter_id": "4599b3ab-1540-49eb-86ae-3fd4f63c69b5",
      "chunk_index": 0,
      "content": "two points?",
      "content_type": "text",
      "token_count": 2,
      "page_number": 19
    },
    {
      "id": "42b5d223-94c7-40a3-b242-37c4d5ae323d",
      "chapter_id": "1f932633-cbf8-49c2-8430-8148bea66c55",
      "chunk_index": 0,
      "content": "the length of this wire to make its resistance 10 Ω ? How much does the resistance\nchange if the diameter is doubled?",
      "content_type": "text",
      "token_count": 29,
      "page_number": 20
    },
    {
      "id": "94f10b9b-0bc0-4e9c-b90a-b706db8a6c5c",
      "chapter_id": "5db6a5cf-72e8-46a2-8ec0-c7e76ee29b10",
      "chunk_index": 0,
      "content": "potential difference V across the resistor are given below –\nI (amperes) 0.5 1.0 2.0 3.0 4.0\nV (volts) 1.6 3.4 6.7 10.2 13.2\nPlot a graph between V and I and calculate the resistance of that resistor.",
      "content_type": "text",
      "token_count": 50,
      "page_number": 20
    },
    {
      "id": "2323b0eb-360f-4931-ada1-c54d670497f3",
      "chapter_id": "1ffa6e38-53c6-42a7-bb64-d4bfc8713258",
      "chunk_index": 0,
      "content": "of 2.5 mA in the circuit. Find the value of the resistance of the resistor.",
      "content_type": "text",
      "token_count": 18,
      "page_number": 20
    },
    {
      "id": "6134f8c1-ee69-4360-8bf9-214c6d1115de",
      "chapter_id": "0511621b-49e1-4b69-9e9e-bdd4e4a6e3e2",
      "chunk_index": 0,
      "content": "and 12 Ω , respectively. How much current would flow through the 12 Ω resistor?",
      "content_type": "text",
      "token_count": 19,
      "page_number": 20
    },
    {
      "id": "79b5b3ed-f995-4a60-900f-31da3328cd3c",
      "chapter_id": "f48e9bbe-3021-419d-8a99-8488ada0ad92",
      "chunk_index": 0,
      "content": "combination has a resistance of (i) 9 Ω , (ii) 4 Ω .",
      "content_type": "text",
      "token_count": 13,
      "page_number": 20
    },
    {
      "id": "f80eb498-18df-42a3-963e-5058f39fb89a",
      "chapter_id": "62194e7a-3184-455f-9640-eb92a1a0db1a",
      "chunk_index": 0,
      "content": "rated 10 W. How many lamps can be connected in parallel with each other across\nthe two wires of 220 V line if the maximum allowable current is 5 A?",
      "content_type": "text",
      "token_count": 36,
      "page_number": 20
    },
    {
      "id": "196663b7-5992-4bf9-b9a1-598abc79da94",
      "chapter_id": "3b7da2c9-dedd-4b44-a6cc-fe45faea0157",
      "chunk_index": 0,
      "content": "A and B, each of 24 Ω  resistance, which may be used separately, in series, or in\nparallel. What are the currents in the three cases?",
      "content_type": "text",
      "token_count": 33,
      "page_number": 20
    },
    {
      "id": "388d1fc4-21f2-4a8d-b825-dce0f3b7efea",
      "chapter_id": "6df4e426-d24b-4aa6-9f1e-5d0bfc51c4c3",
      "chunk_index": 0,
      "content": "(i) a 6 V battery in series with 1 Ω  and 2 Ω  resistors, and (ii) a 4 V battery in parallel\nwith 12 Ω  and 2 Ω  resistors.\n2024-25\n\n--- Page 24 ---\nScience194 194194 194194",
      "content_type": "text",
      "token_count": 43,
      "page_number": 20
    },
    {
      "id": "f2a5125f-c67e-48b7-b9b8-4713068a3723",
      "chapter_id": "347662eb-39ac-49f5-bbe5-27864feba54b",
      "chunk_index": 0,
      "content": "in parallel to electric mains supply. What current is drawn from the line if the supply\nvoltage is 220 V?",
      "content_type": "text",
      "token_count": 26,
      "page_number": 20
    },
    {
      "id": "3acec1d4-6d6b-420c-8286-e88d5321b77a",
      "chapter_id": "a5e4d303-e9b2-47c5-901c-9acaa0060405",
      "chunk_index": 0,
      "content": "Calculate the rate at which heat is developed in the heater.",
      "content_type": "text",
      "token_count": 15,
      "page_number": 20
    },
    {
      "id": "f76719e6-227f-4615-96d8-11d2bd1d0b70",
      "chapter_id": "c1d8b38d-ba9a-4c18-a342-4e238f68f060",
      "chunk_index": 0,
      "content": "(a) Why is the tungsten used almost exclusively for filament of electric lamps?\n(b) Why are the conductors of electric heating devices, such as bread-toasters\nand electric irons, made of an alloy rather than a pure metal?\n(c) Why is the series arrangement not used for domestic circuits?\n(d) How does the resistance of a wire vary with its area of cross-section?\n(e) Why are copper and aluminium wires usually employed for electricity\ntransmission?\n2024-25",
      "content_type": "text",
      "token_count": 114,
      "page_number": 20
    }
  ]
}