{
  "textbook": {
    "id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
    "file_name": "Class X Health and PE - Ch 00 - Table Tennis, Tennis, Swimming and Combative Sports such.pdf",
    "title": "Table Tennis, Tennis, Swimming and Combative Sports such",
    "grade": 10,
    "subject": "Class X Health and PE",
    "total_pages": 25,
    "file_size_mb": 8.575688362121582,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:31.687362",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Health and PE/Class X Health and PE - Ch 00 - Table Tennis, Tennis, Swimming and Combative Sports such.pdf"
  },
  "chapters": [
    {
      "id": "be7ffbc5-ec7a-4ff3-b835-7fa009d9f167",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 1,
      "title": "1. Grip: Holding grip of a badminton racket is the",
      "topics": [],
      "start_page": 4,
      "end_page": 5,
      "content": "foundation of playing this game. Holding the racket \nwrongly will reduce the power and accuracy of the \nstroke. The shots will be limited. A player needs to \nlearn how to change grip quickly during games. Below \nare the two basic types of badminton grips. \nForehand grip\n • This grip is used to hit shots on the forehand side of the \nbody and around the head shots. \n • In this a player holds the racket head in the non-playing \nhand, keeping the handle points towards the body. The \nface of the racket perpendicular to the floor. \n • The player places the playing hand on the handle \njust like shaking hands with it, it is like a V shape in \nbetween thumb and index finger. \n • For flexibility, the racket handle rest loosely in the fingers. \n • In order to increase control and accuracy while serving \nand hitting from the forecourt and mid court, the grip \nis shortened and placed nearer to the shaft.\nAngle 1\nAngle 2 Angle 3\nFig. 5.2: Forehand grip\nChap-5.indd   55 8/24/2020   11:38:29 AM\n2024-25\n\n--- Page 5 ---\nHealtH and PHysical education - class X\n56\nBackhand grip\n • While playing backhand grip, shots is hit from  \nbackhand (left) side of player’s body. \n • The player holds the racket in the same way as it was \nheld in forehand grip. \n • The player turns the racket anti-clockwise so that the \nV shape moves leftwards. \n • The player places the thumb against the back of the \nhandle for greater leverage and power. \n • The other techniques are the same as in forehand grip.\nAngle 1 Angle 3\nAngle 2\nFig. 5.3: Backhand grip"
    },
    {
      "id": "2be4c0c4-94a0-4fdf-a6e4-aaa02af5be0e",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 2,
      "title": "2. Service: There are basically three types of serves —",
      "topics": [],
      "start_page": 5,
      "end_page": 5,
      "content": "high, low and flat. High service is the most basic of \nall strokes. One needs to learn this first when one \nstarts playing the game. You need to concentrate on \nthe following three broad points while delivering the \nhigh service.\n • Stance: To deliver the high service, the player has \nto take a position about two feet from the short \nservice line and about six inches from the centre \nline.\n  The player has to make sure not to touch the \ncentre line as it will be called a touch fault. The \nplayer has to stand comfortably with both feet \nspread apart and parallel to each other and take \nthe initial serving position. At this stage, the full \nweight of the body is on the back foot. \n • Point of Contact: As one starts the forward \nmovement of the racket, slowly start shifting the \nweight from the back foot to the front foot. The \nplayer then drops the shuttle and hit it high and \nChap-5.indd   56 8/24/2020   11:38:34 AM\n2024-25\n\n--- Page 6 ---\nIndIvIdual Games and sports II\n57\nback to the baseline. The player must make sure \nthat the point of contact is always below the waist.\n • Follow-through: Once the service is delivered, the \nplayer continues to swing the racket right across \nthe left shoulder (or right shoulder if the player is \nleft-handed). This is called the follow through. "
    },
    {
      "id": "c4f79d82-c651-4c70-89ef-6c26a74b336a",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 3,
      "title": "3. Return of Service: This stroke plays a crucial part in",
      "topics": [],
      "start_page": 5,
      "end_page": 6,
      "content": "a rally because good return of serve allows a player to \ndictate terms and control a rally till the point is won. \nHowever weak return of serve will allow the opponent \nto go on the offensive. While receiving the serve to hit \nthe shuttle, normally players stand in the centre of the \ncourt with the left foot forward and place the weight \nof the body more on the front foot. It will help the \nplayer to receive all types of serves i.e. high, low and \nflick. In fact, players are advised to take the stance \ncloser to the short service because in high serve the \nshuttle remains in the air for a longer duration. On \na high serve, a player has the choice of playing an \nattacking clear, drop shot, smash or a half smash. \nSimilarly, on a low serve, a player can flick, push or \nlift the shuttle to the baseline. It is important to try \nto meet the shuttle as close to the net as possible so \nthat the receiver has more options available to choose  \nthe shots. \nGymnastics\nGymnastics is a sport that involves physical movements \nin a sequence. It requires physical strength, balance, \ncoordination, endurance, flexibility and body control. It \noften involves dance moves, flips, twists, jumps and other \nmoves. It helps children to develop physical coordination and \nmotor skills, proper use of balance develop a good sense of \nprecision and timing. It can be performed as a way to stay fit \nor specifically to compete in events locally, nationally as well \nas internationally. \nHistory\nGymnastics was developed for fitness and beauty practices \nby the ancient Greeks. It included skills for mounting \nand dismounting a horse, and circus performance skills.  \nThe Greeks used gymnastics as military training. However, \nin the late eighteenth and early nineteenth century, the \nGerman physical educators created exercises for boys \nand young men on apparatus. Their design is considered \nas modern gymnastics. The Federation of International \nGymnastics was founded in 1881. By the end of the \nChap-5.indd   57 8/24/2020   11:38:34 AM\n2024-25\n\n--- Page 7 ---\nHealtH and PHysical education - class X\n58\nnineteenth century, men’s gymnastics competition was \npopular enough to be included in the first “Modern” Olympic \nGames in 1896 and women gymnasts were included in \nOlympic Games in 1986. The first world cup in gymnastics \nwas organised in 1975.\nForms of gymnastics\nThe major forms of gymnastics are: Artistic gymnastics, \nRhythmic gymnastics, Trampolining, Tumbling and Acrobatic \nGymnastics.\nArtistic gymnastics\nArtistic gymnastics is usually divided into Men’s and Women’s \nGymnastics. Men compete in six events. These are floor \nexercise, pommel horse, still rings/roman rings, vaulting \ntable, parallel bars, and horizontal bar. Women compete on \nfour events. These are floor exercise, vaulting table, uneven \nbars, and balancing beam. "
    },
    {
      "id": "bc049e7f-e5f7-4475-acc5-2e246bd72545",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 4,
      "title": "1. Events for men",
      "topics": [],
      "start_page": 7,
      "end_page": 8,
      "content": " (i) Floor Exercise: For this event a 12×12 square \nspring floor is required. A series of tumbling \npasses are performed to demonstrate flexibility, \nstrength, and balance. The gymnast must also \nshow strength skills, including circles, scales, and \npress handstands. Men’s floor routines usually \nhave four passes that will total between 50–70 \nseconds and are performed without music. As per \nrules, male gymnasts touch each corner of the \nfloor at least once during their routine.\n (ii) Pommel Horse: A typical pommel horse exercise \ninvolves both single leg and double leg skills. \nSingle leg skills are generally found in the form of \nscissors, often done on the pommels. Double leg \nskill, however, is the main staple of this event. \nThe gymnast swings both legs in a circular motion \n(clockwise or counterclockwise depending on \npreference) and performs such skills on all parts \nof the apparatus. Gymnasts will often include \nvariations on a typical circling skill by turning or \nby straddling their legs.  This makes the exercises \nof gymnast more challenging. A gymnast performs \na dismount, either by swinging his body over the \nhorse or landing after a handstand.\n (iii) Still Rings: The rings are attached to a wire cable \nfrom a point to 5.75 meters from the floor, and \nadjusted in height so, that the gymnast has room \nto hang freely and swing. The gymnast performs a \nFig. 5.4: Pommel horse\nFig. 5.5: Vault\nChap-5.indd   58 8/24/2020   11:38:35 AM\n2024-25\n\n--- Page 8 ---\nIndIvIdual Games and sports II\n59\nnineteenth century, men’s gymnastics competition was \npopular enough to be included in the first “Modern” Olympic \nGames in 1896 and women gymnasts were included in \nOlympic Games in 1986. The first world cup in gymnastics \nwas organised in 1975.\nForms of gymnastics\nThe major forms of gymnastics are: Artistic gymnastics, \nRhythmic gymnastics, Trampolining, Tumbling and Acrobatic \nGymnastics.\nArtistic gymnastics\nArtistic gymnastics is usually divided into Men’s and Women’s \nGymnastics. Men compete in six events. These are floor \nexercise, pommel horse, still rings/roman rings, vaulting \ntable, parallel bars, and horizontal bar. Women compete on \nfour events. These are floor exercise, vaulting table, uneven \nbars, and balancing beam. "
    },
    {
      "id": "e1bea868-e4ad-4517-b3df-35284c112e6f",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 5,
      "title": "1. Events for men",
      "topics": [],
      "start_page": 8,
      "end_page": 9,
      "content": " (i) Floor Exercise: For this event a 12×12 square \nspring floor is required. A series of tumbling \npasses are performed to demonstrate flexibility, \nstrength, and balance. The gymnast must also \nshow strength skills, including circles, scales, and \npress handstands. Men’s floor routines usually \nhave four passes that will total between 50–70 \nseconds and are performed without music. As per \nrules, male gymnasts touch each corner of the \nfloor at least once during their routine.\n (ii) Pommel Horse: A typical pommel horse exercise \ninvolves both single leg and double leg skills. \nSingle leg skills are generally found in the form of \nscissors, often done on the pommels. Double leg \nskill, however, is the main staple of this event. \nThe gymnast swings both legs in a circular motion \n(clockwise or counterclockwise depending on \npreference) and performs such skills on all parts \nof the apparatus. Gymnasts will often include \nvariations on a typical circling skill by turning or \nby straddling their legs.  This makes the exercises \nof gymnast more challenging. A gymnast performs \na dismount, either by swinging his body over the \nhorse or landing after a handstand.\n (iii) Still Rings: The rings are attached to a wire cable \nfrom a point to 5.75 meters from the floor, and \nadjusted in height so, that the gymnast has room \nto hang freely and swing. The gymnast performs a \nFig. 5.4: Pommel horse\nFig. 5.5: Vault\nroutine demonstrating balance, strength, power, \nand dynamic motion while preventing the rings \nthemselves from swinging. At least one static \nstrength move is required, but some gymnast \nincludes two or three strenghts. A routine should \nhave a dismount at the end of routine.\n (iv) Vault: In this, the gymnasts sprint down a runway, \nwhich is a maximum of 25 meters in length, before \nhurdling onto a spring board. The body position is \nmaintained while “punching” (blocking using only a \nshoulder movement) the vaulting board. The \ngymnast then rotates to a standing position. Multiple \ntwists and somersaults are added before landing in \ncase of advance gymnastics. Vaults depend on the \nspeed of the run, the length of the hurdle, the power \nthe gymnast generated from the legs and shoulder \ngirdle and the kinesthetic awareness in the air. In \ncase of more difficult and complex vaults the speed \nof rotation is more important.\n (v) Parallel Bars: Men perform \non two bars. These are \nkept slightly further than \na shoulder’s width apart \nand usually 1.75 m high. \nFor executing a series \nof swings, balances, \nand releases require \ngreat strength and co-\nordination.\n (vi) Horizontal Bar: A 2.8 cm thick steel or fiberglass \nbar raised 2.5m above the landing area is all the \ngymnasts have to hold onto as they perform giants \n(revolutions around the bar), release skills, twists, \nand changes of direction. By using all of the \nmomentum from giants and then releasing at the \nproper point, enough height can be achieved for \nspectacular dismounts. Leather grips are usually \nused to help maintain a grip on the bar."
    },
    {
      "id": "5b79b0b2-8fad-4db2-af50-5d54022f234a",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 6,
      "title": "2. Events for women",
      "topics": [],
      "start_page": 9,
      "end_page": 10,
      "content": " (i) Floor Exercise: The floor event occurs on a carpeted \n12m × 12m square, usually consisting of hard foam \nover a layer of plywood, which is supported by \nsprings or foam blocks generally called a “spring” \nfloor. Female gymnasts perform a choreographed \nroutine of 50 to 70 seconds in this event. The \nroutine should consist of tumbling lines, series of \njumps, dance elements, acrobatic skills, and turns.\nFig. 5.6: Parallel bars\nChap-5.indd   59 8/24/2020   11:38:36 AM\n2024-25\n\n--- Page 9 ---\nHealtH and PHysical education - class X\n60\n (ii) Vault: In the vaulting events gymnasts sprint \ndown a 25 meters (82 ft) runway, jump onto or \nperform a round off entry onto a beat board or \nspring board, land momentarily, inverted on the \nhands on the vaulting horse or vaulting table. \nThen they spring off this platform to a two footed \nlanding. Every gymnast starts at a different point \non the vault runway depending on her height and \nstrength. The post flight segment may include one \nor more multiple somersaults, and/or twisting \nmovements. In vaults with round-off entries, \ngymnasts “round-off” so that hands are on the \nrunway while the feet land on the springboard. \nFrom the round-off position the gymnast travels \nbackwards as in a back handspring so that the \nhands land on the vaulting platform (horse).  \nShe then blocks off the vaulting platform into \nvarious twisting and somersaulting combinations.\n (iii) Uneven Bars: On the uneven bars (also known as \nasymmetric bars), the gymnast performs a routine \non two horizontal bars set at different heights. The \nheight is generally fixed, but the width may be \nadjusted. Gymnasts perform swinging, circling, \ntransitional, and release moves, as well as moves \nthat pass through the handstand. Usually in higher \nlevels of gymnastics, leather grips are worn to ensure \nthat the gymnast maintains a grip on the bar, and \nto protect the hands from blisters and tears. \n (iv) Balance Beam: The gymnast performs a \nchoreographed routine from 70 to 90 seconds \nin length consisting of leaps, acrobatic skills, \nturns and dance elements on a padded spring \nbeam. Apparatus norms set by the International \nGymnastics Federation specify that the beam \nmust be 125 cm (4’) high, 500 cm (16’) long, and \n10 cm (4.5”) wide. The event requires in particular, \nbalance, flexibility and strength. "
    },
    {
      "id": "3a63ffc5-0004-4000-8344-3f642fe46c0d",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 7,
      "title": "3. Rhythmic gymnastics",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "  Only women compete in rhythmic gymnastics, \nalthough there is a new version of this discipline \nfor men being pioneered in Japan. This combines \nelements of ballet, gymnastics, dance and apparatus \nmanipulation. The sport involves the performance of \nfive separate routines with the use of five apparatus \n– Ball, Ribbon, Hoop, Clubs, Rope on a floor area, \nwith a much greater emphasis on the aesthetic rather \nthan the acrobatic. \nFig. 5.7: Uneven bars\nFig. 5.8: Balance beam\nChap-5.indd   60 8/24/2020   11:38:37 AM\n2024-25\n\n--- Page 10 ---\nIndIvIdual Games and sports II\n61"
    },
    {
      "id": "8d5913f5-2150-4c23-97e6-cb71aef50f16",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 8,
      "title": "4. Acrobatic gymnastics",
      "topics": [],
      "start_page": 10,
      "end_page": 11,
      "content": "  Acrobatic gymnastics is one of the oldest \nforms of organised physical activities,  \nand today it is being reorganised, revitalised by \nchanges and renewed interest. The International \nFederation of Sports Acrobatics (IFSA) was founded \nin Moscow in 1973. United States Sports Acrobatics \n(USSA) was founded in 1975.  It was merged with \nInternational Gymnastics federation (FIG) in 1999. \nSports Acrobatics was demonstration sports at the \n2000 Olympics in Sydney. Now, it is an accepted \ncompetitive sport. It is  very effective for the \ndevelopment of physical fitness and graceful posture.\n  Acrobatic gymnastics is a group gymnastic discipline \nfor both men and women. Acrobats in groups of two, \nthree and four perform routines with the heads, \nhands and feet of their partners. They may, subject to \nregulations (e.g. instrumental), pick their own music."
    },
    {
      "id": "aa4ef9b2-ef8a-4617-af04-25bb1aaab35d",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 9,
      "title": "5. Tumbling and trampolining",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "  Tumbling, also known as power tumbling, is a \ngymnastics sporting discipline which combines skills \nof artistic gymnastics with those of trampolining. It \nis sometimes practiced on a 25-meter-long spring \ntrack, competitors both male and female, perform two \npasses, each containing eight skills, along the track.\ntaBle tennis\nTable Tennis is also known as Ping-Pong, in which two or \nfour players participate using table-tennis rackets on a plain \nhard surface called Table, which is divided by a net.\nHistory\nThe game of Table Tennis probably descended from the \ngame of ‘Royal Tennis’, which was played in the medieval \nera (12th century A.D.) Table Tennis was probably played \nwith improvised equipment in England during the last \nquarter of 19th century. Evidence show that David Foster \nin England patented an action game of Tennis on Table in "
    },
    {
      "id": "ec352623-c3f1-4c6e-8fff-132f76d78774",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 10,
      "title": "1890. One year later John Jaques came out with a game",
      "topics": [],
      "start_page": 11,
      "end_page": 12,
      "content": "called Gossima. In 1900, a celluloid ball was introduced by \nJaques and the name was given as ‘Ping-Pong’. Table Tennis \nis controlled by ITTF (International Table Tennis Federation) \nwhich was founded in 1926 with headquarters in Berlin. It \nwas introduced in Olympics in 1988 in Seoul, South Korea. \nFirst World Championship of Table-Tennis was held in \nLondon in 1926. TTFI (Table-Tennis Federation of India) was \nformed in 1926 in Calcutta, now known as Kolkata.\nChap-5.indd   61 8/24/2020   11:38:37 AM\n2024-25\n\n--- Page 11 ---\nHealtH and PHysical education - class X\n62\n9 ft\n6 Inch Net Height\n5 ft2.5 ft\nFig. 5.9: Table tennis\nRules\n • Table Tennis table is 9 ft. (2.74 meter) long, 5 ft. \n(1.525 meter) wide and 2.5 ft.(76 centimeter) high.\n • Net is 6 inches (15 centimeter) high from the table. \n • A game of Table Tennis is played up to 11 points.\n • A player or the pair who first scores 11 points wins \nunless both players or pairs score 10 points then the \ngame is won by the player or pairs who gains 2 point \nlead.\n • If a player causes the table to move while the ball is in \nplay, player loses a point.\n • A player shall score a point if the opponent’s free hand \ntouches the playing surface or the net assembly.\nFundamental techniques"
    },
    {
      "id": "97915939-69e1-4dbb-a01c-76ea707c63ce",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 11,
      "title": "1. Grip: Players grip their rackets in a variety of ways.",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "The manner in which players grip their rackets can \nbe classified into two major categories i.e. Pen hold \ngrip (mainly used by Chinese and Korean) and shake \nhand or Orthodox grip (commonly used). \n • Pen hold grip: In this, one grips the racket in such \na way as one holds a pen. It involves index finger \nand think joining each other across the handle \nand curling the middle, ring and fourth finger on \nthe back of the blade. The three fingers however, \nwill always remain touching one another.\nChap-5.indd   62 8/24/2020   11:38:37 AM\n2024-25\n\n--- Page 12 ---\nIndIvIdual Games and sports II\n63\nFig. 5.10: Pen hold grip\n • Shake hand grip:  In this grip, the racket is held \nin such a way as one shakes hand with someone. \nThe shake hand grip is used due to increasingly \nfast nature of the game, making the backhand \nstroke more effective."
    },
    {
      "id": "12ffbedb-6cc8-4db3-964b-e4d84a2b72e1",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 12,
      "title": "2. Services: There are different kind, of services, such as,",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "long service, short service, spin service, flat service, \nhigh toss service and back-hand or forehand service. "
    },
    {
      "id": "bf7cc839-a638-44d8-a812-a1784880fbcf",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 13,
      "title": "3. Types of strokes: The two types of strokes are offensive",
      "topics": [],
      "start_page": 12,
      "end_page": 16,
      "content": "and defensive including backhand and forehand.\n (i) Offensive strokes (drive, loop drive, loop, loop kill, \nhook, counter drive, flip and smash)\n a) Drive: The racket is primarily perpendicular \nto the direction of the stroke, and most of the \nenergy applied to the ball results in speed \nrather than spin, creating a shot that does \nnot arc much, but it is fast enough to make it \ndifficult to return.\n b) Loop drive: The racket is much more parallel \nto the direction of the stroke (closed) and the \nracket thus grazes the ball, resulting in a large \namount of topspin. Variations in spin and \nspeed add to the effectiveness of this shot. \n c) Loop: The loop produces a more pronounced \nloopy arc, with a higher trajectory and extreme \ntopspin, but is typically slower.\n d) Loop kill: The loop kill produces a flatter arc, \nwith higher speed that resembles a speed \ndrive but with stronger topspin.\n e) Hook: It is similar  to a regular Loop, but carries \na tilted topspin (or is referred as the “top-side” \nspin), it bounces sideways and downward \nupon hitting the table. \n f) Counter drive: It is a counter attack against \ndrives (normally high loop drives). One has \nChap-5.indd   63 8/24/2020   11:38:38 AM\n2024-25\n\n--- Page 13 ---\nHealtH and PHysical education - class X\n64\nto bring close to the racket and stay close to \nthe ball (try to predict its path). The racket is \nheld closed and near to the ball, which is hit \nwith a short movement off the bounce (before \nreaching the highest point) so that the ball \ntravels faster to the other side.\n g) Flip: When a player tries to attack a ball that \nhas not bounced beyond the edge of the table, \nhowever the ball may still be attacked, and the \nresulting shot is called flip because the back \nswing is compressed into a quick wrist action. \n h) Smash: Smash is executed when his or her \nopponent has returned a ball that bounces too \nhigh and/ or too close to the net. Smashing \nis a large back swing and rapid acceleration \nimparting as much speed on the ball as possible. \n (ii) Defensive strokes\n a) Push or Slice: The push is usually used for \nkeeping the point alive and creating offensive \nopportunities. A push resembles a tennis slice, \nthe racket cuts underneath the ball, imparting \nbackspin and causing the ball to float slowly \nto the other side of the table. Offensive players \nshould only push for variation and not for \ngeneral rallies. \n b) Chop: A chop or cut is the defensive, backspin \ncounterpart to the offensive loop drive. A chop \nis essentially a bigger, heavier slice, taken well \nback from the table. Sometimes a defensive \nplayer can impart no spin on the ball during \na chop, or frequently add right- or left-hand \nspin to the ball. This may further confuse his/\nher opponent. \n c) Block: A block is executed by simply putting \nthe racket in front of the ball, the ball rebounds \nback toward the opponent with nearly as \nmuch energy as it came in with. This is not \nas easy as it sounds, because the ball’s spin, \nspeed, and location, all influence the correct \nangle of a block. \n d) Side spin drive: The premise of this move is to \nput a spin on the ball either to the right or the \nleft of the racket. The execution of this move \nis similar to a slice, but to the right or left, \ninstead of down. This spin will result in the ball \ncurving to the side but bouncing in the opposite \ndirection when the opponent returns it. \nChap-5.indd   64 8/24/2020   11:38:38 AM\n2024-25\n\n--- Page 14 ---\nIndIvIdual Games and sports II\n65\n e) Lob: The defensive High Ball or Lob is \ndeceptive in its simplicity. To execute a High \nBall, a defensive player first backs off the table \n8-10 meters; then, the stroke itself consists of \nsimply lifting the ball to an enormous height \nbefore it falls back to the opponent’s side of \nthe table. A High Ball is inherently a creative \nshot, and can have nearly any kind of spin.\n f) Drop shot: The drop shot is a high level stroke, \nused as another variation for close-to-table \nstrokes. The player has position the racket close \nto the ball and just let the ball touch it (without \nany hand movement) in a way that the ball stays \nclose to the net with almost no speed and spin, \nand touches the other side of the table more \nthan twice if the opponent doesn’t reach it. \nSkills\nForehand drive\n • Keep arm close to the torso.\n • Forearm makes 90° with the upper arm.\n • Draw the forearm back to another 45°.\n • Let the waist turn naturally along with the arm and \nshift your weight towards the right foot.\n • Swing forward with a slight upward motion while \nshifting your weight back to left foot.\n • Elbow should be used as a pivot point and should only \nmove a little forward in the follow through.\nFig. 5.11: Forehand drive\nBackhand drive\n • Form ready position.\n • Turn waist towards left with Racket towards 9 O’clock \nposition.\n • Contact with the ball is made in front of the body \nslightly after the top of the bounce.\nChap-5.indd   65 8/24/2020   11:38:42 AM\n2024-25\n\n--- Page 15 ---\nHealtH and PHysical education - class X\n66\n • Elbow acts as pivot point.\n • Snap the forearm forward in slightly upward direction.\n • Power comes with the flick of the wrist.\n • Follow through until the racket points after the ball.\nFig. 5.12: Backhand drive\nBlocking \nIt is a backup shot, when there isn’t enough time for a full \ndrive or loop. This stroke allows the players to use opponent \nforce against them.\n • Adjust the racket angle according to the severity of top \nspin. More the spin, more one should close the racket.\n • Involve a little backspin and follow through.\n • Execute immediately after the bounce to keep control \nand speed.\n • Hit the ball as it is rising off the surface of the table on \nyour side using 50 per cent of the stroke action before \nhitting the ball and 50 per cent after hitting the ball.\nFig. 5.13: Blocking\ntennis\nTennis is one of the most popular individual sports in the \nworld. In tennis, the player uses a racquet to hit a ball over a \nnet into the opponent’s court. The ball must be kept in play \nand can only bounce one time on the court surface and the \nChap-5.indd   66 8/24/2020   11:38:49 AM\n2024-25\n\n--- Page 16 ---\nIndIvIdual Games and sports II\n67\nopponent must strike the ball back over the net. It is a sport \nusually played between two players (singles) or between two \nteams of two players each (doubles).\nCenter\n9m 80cmAntenna\nMinimum CeilingHeight 7m\n18m\n2.43m Men 2.24m Women\n5cm Center Line\n3m\n9m\nServing Area 3m\nAttack Line\nEnd Line\nFig. 5.14: Tennis court\nHistory\nAn early version of Tennis started in the 16th century in \nFrance where players would yell “tenez” when starting a \ngame giving the game the name, Tennis. Later the game was \nrefined in England in the 19th century as lawn tennis which \nresembled the sport played today. The world’s oldest tennis \ntournament, the Wimbledon Championships were first played \nin London in 1877. The comprehensive rules promulgated \nin 1924 by the International Lawn Tennis Federation, now \nknown as the International Tennis Federation, have remained \nlargely stable, one of the major changes being the addition of \nthe tie-back system. The Davis Cup, an annual competition \nbetween men’s national teams, dates to 1900. The analogous \ncompetition for women’s national teams, the Fed Cup, was \nfounded as the Federation Cup in 1963. There are four top \ntournaments called the Grand Slam Tournaments, these \nare Wimbledon, the US Open, the Australian Open, and the \nFrench Open. \nChap-5.indd   67 8/24/2020   11:38:49 AM\n2024-25\n\n--- Page 17 ---\nHealtH and PHysical education - class X\n68\nRules\nThe following are the rules regarding equipment, balls, court, \nlines and scoring:"
    },
    {
      "id": "fa4f0290-da51-4fee-8ae1-8e7402ea118b",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 14,
      "title": "1. Equipment",
      "topics": [],
      "start_page": 16,
      "end_page": 19,
      "content": " (i) Racquets: Tennis racquet must adhere to the \nfollowing guidelines — \n • The hitting area, composed of the strings, \nmust be flat and generally uniform.\n • The frame of the hitting area may not be more \nthan 29 inches in length and 12.5 inches in \nwidth.\n • The entire racquet must be of a fixed shape, \nsize, weight, and weight distribution. There \nmay not be any energy source built into the \nracquet.\n • The racquet must not provide any kind of \ncommunication, instruction or advice to the \nplayer during the match.\n (ii) Balls: Tennis balls are of hollow rubber with a \nfelt coating. Traditionally white, the predominant \ncolour was gradually changed to optic yellow in \nthe latter part of the 20th century to ensure better \nvisibility.\n (iii) Court\n • Tennis is played on a rectangular, flat surface, \nusually grass or clay, a hard court of concrete \nand/or asphalt and occasionally carpet \n(indoor). The court is 78 feet (23.77 m) long, \nand 27 feet (8.23 m) wide for singles matches \nand 36 ft (10.97 m) for doubles’ matches. \n • Additional clear space around the court is \nrequired for players so as to reach over run \nballs. \n • A net is stretched across the full width of the \ncourt, parallel with the baselines, dividing it \ninto two equal ends. The net is 3 feet 6 inches \n(1.07 m) high at the posts and 3 feet (91.4 cm) \nhigh in the center. \n (iv) Lines\n • The lines that delineate the width of the court \nare called the baseline (farthest back) and the \nservice line (middle of the court). \n • The short mark in the center of each baseline \nis referred to as either the hash mark or the \ncenter mark. \nChap-5.indd   68 8/24/2020   11:38:49 AM\n2024-25\n\n--- Page 18 ---\nIndIvIdual Games and sports II\n69\n • The outermost lines that make up the length \nare called the doubles’ sidelines. These are \nthe boundaries used when doubles is being \nplayed. \n • The lines to the inside of the doubles’ \nsidelines are the singles’ sidelines and used as \nboundaries in singles’ play. The area between \na doubles’ sideline and the nearest singles’ \nsideline is called the doubles’ alley, which is \nconsidered playable in doubles’ play. \n • The line that runs across the center of a \nplayer’s side of the court is called the service \nline because the serve must be delivered into \nthe area between the service line and the net \non the receiving side. \n • All the lines are required to be 2 inches  \n(51 mm) in width. The baseline can be up to 4 \ninches (100 mm) wide if so desired. \n (v) Scoring\n • The players (or teams) start on opposite sides \nof the net. One player is designated as the \nserver, and the opposing player is the receiver. \n • A tennis match is determined through the \nbest of 3 or 5 sets. Women play 3 set matches, \nwhile men play 5 set matches. For men, the \nfirst player to win three sets wins the match, \nand for women, the first player to win two sets \nwins the match.\n • A set consists of games, and a game, in turn, \nconsists of a sequence of points played with \nthe same player serving. \n • A game is won by the first player to have won \nat least four points in total and at least two \npoints more than the opponent. \n • The running score of each game is described \nin a manner peculiar to tennis: scores from \nzero to three points are described as “love”, \n“15”, “30”, and “40” respectively \n • If at least three points have been scored by \neach player, making the player’s score equal \nat 40 a piece, the score is not called out as \n“40-40”, but rather as “deuce”. \n • If at least three points have been scored by \neach side and a player has one more point \nthan the opponent, the score of the game is \n“advantage” for the player in the lead. \nChap-5.indd   69 8/24/2020   11:38:49 AM\n2024-25\n\n--- Page 19 ---\nHealtH and PHysical education - class X\n70\n • A game point occurs in tennis whenever \nthe player who is in the lead in the game \nneeds only one more point to win the game. \nThe terminology is extended to sets (set \npoint), matches (match point), and even \nchampionships (championship point). \n • A break point occurs if the receiver, not the \nsever, has a chance to win the game with \nthe next point. Break points are of particular \nimportance because serving is generally \nconsidered advantageous, with the server being \nexpected to win games in which they are serving. \n • A receiver who has one (score of 30–40), two \n(score of 15–40) or three (score of love-40) \nconsecutive chances to win the game has \nbreak point, double break point or triple break \npoint, respectively.\n • If the leading player wins that game, the player \nwins the set 7–5. If the trailing player wins \nthe game, a tie-break is played. A tie-break, \nplayed under a separate set of rules, allows \none player to win one more game and thus the \nset, to give a final set score of 7–6. \n • In tournament play, the chair umpire \nannounces the winner of the set and the \noverall score."
    },
    {
      "id": "2bd882b3-cd95-49ce-88fa-a5f4f6b34a86",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 15,
      "title": "2. Grip",
      "topics": [],
      "start_page": 19,
      "end_page": 22,
      "content": "  A grip is a way of holding the racquet in order to hit \nshots during a match. There are three types of grip. \n i.  Forehand: the tennis forehand is a stroke in \nwhich the inner side of the palm of the dominant \nhand that is holding the racket faces forward. The \nforehand stroke is made by swinging the racket \nacross one’s body in the direction of where one \nwants to land the ball.\n ii. Backhand: The backhand is a tennis stroke in \nwhich one swings the racquet around one’s body \nwith the back of the hand preceding the palm.\n iii. The Serve (Service): A serve in tennis is a shot to \nstart a pint. A player will hit the ball with racquet \nso it will fall into the diagonally opposite service \nbox without being stopped by the net. There are \nthree types of serve —\n a) Flat Serve \n b) Slice Serve\n c) Kick Serve\nChap-5.indd   70 8/24/2020   11:38:49 AM\n2024-25\n\n--- Page 20 ---\nIndIvIdual Games and sports II\n71\nswimmin G\nSwimming is a water based sport where a person propels the \nbody through the water by arms, known as strokes and legs \nthat are called kicks and move progressively through water. \nIt is a sport for all round development of the child. Swimming \nimproves cardiovascular system and places minimum stress \non joints. It employs major muscle groups of the body leading \nto a well-developed flexible muscular system. Swimming is \nalso important for physical rehabilitation for people suffering \nfrom disabilities or those recovering from injuries.\nFig. 5.15: Swimming\nHistory\nSwimming is a sport that was included in the first modern \nOlympic Games at Athens in 1896, diving events were \nadded in 1904 and women’s competitions were recognised \nin 1912. FINA (Federation International de Notation) was \nformed at London Olympic in 1908 AD. National Swimming \nAssociation of India was founded in 1949. Swimming \nwas one of the six sports at the First Asian Games held \nat Delhi in 1951. The aquatic sport of swimming involves \ncompetition amongst participants to be the fastest over a \ngiven distance. Different di stances are covered in different \nlevels of competition.\nRules\n • A swimmer must finish the race in the same lane. \nSwimming across another lane or interfering with the \nother shall disqualify the offender.\n • During a turn the swimmer shall touch the end of  \nthe pool.\n • A swimmer should not walk. \n • Any swimmer not participating in a race, who enters the \nwater in which an event is being conducted before all \nswimmers shall be disqualified from the next scheduled \nrace in the meet.\nDo You Know?\nThe current Olympic \ngames contain freestyle \nevents of 50m, 100m, \n200m, 400m, 800m, \nand 1500m; 100m and \n200m events in each of \nbackstroke, breaststroke \nand butterfly; 200m \nIndividual Medley \n(that is, 50m butterfly, \n50m backstroke, 50m \nbreaststroke, and \n50m freestyle); 400m \nIndividual Medley \n(100m butterfly, 100m \nbackstroke, 100m \nbreaststroke, and 100m \nfreestyle); and the \nMarathon 10km.\nChap-5.indd   71 8/24/2020   11:38:50 AM\n2024-25\n\n--- Page 21 ---\nHealtH and PHysical education - class X\n72\n • There shall be four swimmers in each relay team. In \nrelay events, the team of swimmers whose feet lose \ntouch with the starting platform before the preceding \nteammate touches the wall shall be disqualified. Any \nrelay team shall be disqualified from a race if a team \nmember, other than the swimmer designated to swim \nthat length, enters the water when the race is being \nconducted, before swimmers of all teams have finished \nthe race. The member of a relay team and their order \nof competing must be nominated before the race. Any \nrelay team member may compete in a race only once. \n • The composition of a relay team may be changed \nbetween the heats and finals of the event, provided that \nit is made up from the list of swimmers properly entered \nby a member for that event. Failure to swim in the \norder listed will result in disqualification. Substitutions \nmay be made only in the case of a documented  \nmedical emergency.\n • Any swimmer having finished the race, or the stipulated \ndistance in a relay event, must leave the pool as soon \nas possible without obstructing any other swimmer \nwho has not yet finished the race. Otherwise the \nswimmer committing the fault or the relay team shall \nbe disqualified.\n • Should a foul endanger the chances of success of a \nswimmer, the referees shall have the power to allow the \nswimmer to compete in the next heat or, should the \nfoul occur in a final event or in the last heat, they may \norder it to be re-swim.\nFundamental techniques\nTechniques in swimming are strokes, starts and turns.\nStrokes\nIn swimming there are four competitive strokes (Front \nCrawl, Back Crawl, Breast stroke and Butterfly stroke) being \nfollowed all over the world. All the above mentioned strokes \nhave been learnt in the previous class.\nStarts\nAll four competitive strokes are to be started in the competition \nby using the technique known as start. The swimmers \nemphasis on the quickest technique, which allows him a \nstronger push off from the starting position. The starting \ntechniques, popular today, are: (i) Grab start (ii) Circular \nstart (iii) Racings start (iv) Conventional start (v) Tuck start. \nThe following sequence is followed; (i) Position on the block \n(ii) Take off (iii) Flight (position in air) (iv) Entry into the water \nChap-5.indd   72 8/24/2020   11:38:50 AM\n2024-25\n\n--- Page 22 ---\nIndIvIdual Games and sports II\n73\n(v) Glide (vi) First stroke. However, backstroke uses almost \na uniform technique, which does not have any special name \nand is known as backstroke start.\nTurns\nDuring the race, the swimmer must take a turn from the end \nof the wall to complete the full distance. The swimmers try \nto use a technique that is quicker and gives a strong push \noff from the wall within the permissible rules of the stroke. \nThe various turns used by swimmers are: (i) Simple turn  \n(ii) Throw away turn (iii) Summer Sault turn (iv) Flip turn (v) \nRoll over turn (vi) Breast stroke turn (vii) Butterfly turn. \nThe following sequence is followed in the turn: (i) Approach \nto the wall (ii) Turn or touch (iii) Push off (iv) Glide (v) First \nstroke.\nTactics\nSwimming is an individual and cyclic sport. It is highly \ncompetitive with the application of science. It is getting \ntransformed from an art to science. Now, the importance is \ngiven to strategy and tactics for completing and pacing the \nrace. In order to achieve the best performance, a swimmer \nmust learn to distribute the distance economically and \nthoughtfully throughout the race. Tactics in swimming \nduring different races can be categorised in three different \nphase —  (i) Sprint races (ii) Middle distance races (iii) Long \ndistance races\nSprint races\nThe 50 m race or the sprint race depends on the start, \nmaintaining the speed and a good finish.\nMiddle and Long distance races\nIn these races, the key word is to build endurance and speed. \nIn middle and long distance races, the swimmer tries to \nprevent building up high oxygen debt. Swimming at a very \nfast pace will accumulate a high level of oxygen debt early \nin the race and will experience an immediate drop in speed. \nSwimmer may sometimes prefer to begin faster than an ideal \npace and attempt to get out in front avoiding the choppy \nwaters. Some swimmers like to swim the strategy races in \nrelation to the opponent.\nChap-5.indd   73 8/24/2020   11:38:50 AM\n2024-25\n\n--- Page 23 ---\nHealtH and PHysical education - class X\n74\nassessment\nBadminton\n I. Answer the following Questions"
    },
    {
      "id": "c6757450-1d95-4418-9c7f-dd5ef23beed1",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 17,
      "title": "2. Which motor skill do you enjoy the most and why during a game",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "of badminton?"
    },
    {
      "id": "9f1a28e3-f14d-440c-8eeb-074fb70efe72",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 18,
      "title": "3. Explain the badminton technique you like most. Why?",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": " II. Fill in the Blanks"
    },
    {
      "id": "1570543d-35d6-47cc-aa40-cb2bdcc61a43",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 22,
      "title": "4. Number of feathers in a shuttle cock are _____________.",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": " III. State whether True or False"
    },
    {
      "id": "bb63a681-c4c6-4d1e-b200-4a13aaa88dc3",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 26,
      "title": "4. Breadth of badminton net is 2’6”.",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": "Gymnastics\n I. Answer the following Questions"
    },
    {
      "id": "d7fc259e-97e2-4e14-bb3d-fa464da7c830",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 27,
      "title": "1. What is the difference between gymnastics events for men and",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": "women?\n II. Fill in the Blanks"
    },
    {
      "id": "560ba497-9b50-4208-b49c-cd4f35ed3b17",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 28,
      "title": "1. Rhythmic Gymnastics was included in Olympic games in",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": "_____________ at _____________."
    },
    {
      "id": "30682307-851f-469e-b626-163b4038a11a",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 32,
      "title": "5. A official can wait for  _____________ minutes, if a player has not",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": "arrived in time.\n III. State whether True or False"
    },
    {
      "id": "b67410d3-7d0d-4c4c-851e-c9aecdff409c",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 34,
      "title": "2. Balancing beam is a women’s event.",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": "Chap-5.indd   74 8/24/2020   11:38:50 AM\n2024-25\n\n--- Page 24 ---\nIndIvIdual Games and sports II\n75"
    },
    {
      "id": "9b776f2a-70e5-4425-8a21-be73a8f52d82",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 37,
      "title": "5. International Gymnastic Federation was founded in the",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": "year 1881.\ntaBle tennis\n I. Answer the following Questions"
    },
    {
      "id": "27c2665e-b631-4716-9b98-0d22c0dc8357",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 38,
      "title": "1. Which motor skill did you enjoy the most in table tennis game",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": "and why? "
    },
    {
      "id": "327f9134-adc8-445d-b4ef-d2e59106d2bc",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 42,
      "title": "5. List the equipments required in table tennis.",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": " II. Fill in the Blanks"
    },
    {
      "id": "d220be4f-6cf5-4fc2-b2b6-c79444a51810",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 43,
      "title": "1. The table used in table tennis is  _____________ feet long",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": "_____________ feet wide and  _____________ feet high."
    },
    {
      "id": "3afebb01-417f-4de5-9a72-9ef3e7b4cba0",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 46,
      "title": "4. A player or the pair who first scores 11 points wins unless both",
      "topics": [],
      "start_page": 23,
      "end_page": 23,
      "content": "players and pairs score  _____________ points. Then the game is \nwon by the player or pairs who game a 2 point lead."
    },
    {
      "id": "a4c25587-7b1f-4361-a9cc-31f36595d9cd",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 47,
      "title": "5. If a player causes the table to move whilst the ball is in play,",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": "player  _____________ a point."
    },
    {
      "id": "a14dcd93-69a3-4aff-afb7-d969dbd73e58",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 48,
      "title": "6. A player shall score  _____________ if his opponent’s free hand",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": "touches the playing surface or the net assembly.\ntennis\n I. Answer the following Questions"
    },
    {
      "id": "58bc3625-471a-416b-9085-4d7e6702b48d",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 51,
      "title": "3. How is the scoring done in a tennis match?",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": " II. Fill in the Blanks"
    },
    {
      "id": "f668cd70-01d2-4e8d-93ad-315ec72d2155",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 52,
      "title": "1. The frame of the hitting area may not be more than  _____________",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": "inches in length."
    },
    {
      "id": "2ab19733-e881-455f-86c2-bb507089b22c",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 53,
      "title": "2. Tennis balls are of hollow rubber with a felt coating. Traditionally",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": "white, the predominant color was gradually changed to  \n_____________."
    },
    {
      "id": "40a96df6-0170-48b9-830d-0027ed5eb46f",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 54,
      "title": "3. The tennis court is  _____________ feet long and  _____________ feet",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": "wide for singles matches.\nChap-5.indd   75 8/24/2020   11:38:50 AM\n2024-25\n\n--- Page 25 ---\nHealtH and PHysical education - class X\n76"
    },
    {
      "id": "df4e4cb2-2690-4734-aa3a-d1a0c16d2d96",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 55,
      "title": "4. The lines that delineate the width of the court are called the",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": "_____________."
    },
    {
      "id": "6cca5dfd-a592-41f9-8971-52f8a7ffec71",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 56,
      "title": "5. A tennis match is determined through the best of 3 or 5 sets.",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": "Women play  _____________ set matches, while men play  \n_____________ set matches.\nswimminG\n I. Answer the following Questions"
    },
    {
      "id": "6944b1bf-3a93-45ca-9a03-6d7ea16bbe41",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 59,
      "title": "3. Explain the technique of any stroke of your choice?",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": " I. Fill in the Blanks"
    },
    {
      "id": "a89630ba-301a-4671-8bf7-edd34b24a822",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 60,
      "title": "1. Standard swimming pool should be of  _____________ mts. length",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": "and  _____________ mts. width."
    },
    {
      "id": "d6e62a9c-0973-4000-ad17-57996f3e7abc",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 63,
      "title": "4. Height of starting platform is  _____________.",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": " II. State whether True or False"
    },
    {
      "id": "a3e81514-56a1-4e59-94ce-9234fbad9b84",
      "textbook_id": "73f772be-5a95-4e66-a78c-02cea6bb9d45",
      "chapter_number": 66,
      "title": "3. Roll over turn is permitted in backstroke.",
      "topics": [],
      "start_page": 24,
      "end_page": 24,
      "content": "Chap-5.indd   76 8/24/2020   11:38:51 AM\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "db619291-2c89-4482-a1da-7adec5b803cb",
      "chapter_id": "be7ffbc5-ec7a-4ff3-b835-7fa009d9f167",
      "chunk_index": 0,
      "content": "foundation of playing this game. Holding the racket \nwrongly will reduce the power and accuracy of the \nstroke. The shots will be limited. A player needs to \nlearn how to change grip quickly during games. Below \nare the two basic types of badminton grips. \nForehand grip\n • This grip is used to hit shots on the forehand side of the \nbody and around the head shots. \n • In this a player holds the racket head in the non-playing \nhand, keeping the handle points towards the body. The \nface of the racket perpendicular to the floor. \n • The player places the playing hand on the handle \njust like shaking hands with it, it is like a V shape in \nbetween thumb and index finger. \n • For flexibility, the racket handle rest loosely in the fingers. \n • In order to increase control and accuracy while serving \nand hitting from the forecourt and mid court, the grip \nis shortened and placed nearer to the shaft.\nAngle 1\nAngle 2 Angle 3\nFig. 5.2: Forehand grip\nChap-5.indd   55 8/24/2020   11:38:29 AM\n2024-25\n\n--- Page 5 ---\nHealtH and PHysical education - class X\n56\nBackhand grip\n • While playing backhand grip, shots is hit from  \nbackhand (left) side of player’s body. \n • The player holds the racket in the same way as it was \nheld in forehand grip. \n • The player turns the racket anti-clockwise so that the \nV shape moves leftwards. \n • The player places the thumb against the back of the \nhandle for greater leverage and power. \n • The other techniques are the same as in forehand grip.\nAngle 1 Angle 3\nAngle 2\nFig. 5.3: Backhand grip",
      "content_type": "text",
      "token_count": 383,
      "page_number": 5
    },
    {
      "id": "c342bcb1-c2f9-4fda-b0f3-d93284d57611",
      "chapter_id": "2be4c0c4-94a0-4fdf-a6e4-aaa02af5be0e",
      "chunk_index": 0,
      "content": "high, low and flat. High service is the most basic of \nall strokes. One needs to learn this first when one \nstarts playing the game. You need to concentrate on \nthe following three broad points while delivering the \nhigh service.\n • Stance: To deliver the high service, the player has \nto take a position about two feet from the short \nservice line and about six inches from the centre \nline.\n  The player has to make sure not to touch the \ncentre line as it will be called a touch fault. The \nplayer has to stand comfortably with both feet \nspread apart and parallel to each other and take \nthe initial serving position. At this stage, the full \nweight of the body is on the back foot. \n • Point of Contact: As one starts the forward \nmovement of the racket, slowly start shifting the \nweight from the back foot to the front foot. The \nplayer then drops the shuttle and hit it high and \nChap-5.indd   56 8/24/2020   11:38:34 AM\n2024-25\n\n--- Page 6 ---\nIndIvIdual Games and sports II\n57\nback to the baseline. The player must make sure \nthat the point of contact is always below the waist.\n • Follow-through: Once the service is delivered, the \nplayer continues to swing the racket right across \nthe left shoulder (or right shoulder if the player is \nleft-handed). This is called the follow through.",
      "content_type": "text",
      "token_count": 324,
      "page_number": 5
    },
    {
      "id": "4d482ccd-af27-42eb-ae28-41feb46ef55b",
      "chapter_id": "c4f79d82-c651-4c70-89ef-6c26a74b336a",
      "chunk_index": 0,
      "content": "a rally because good return of serve allows a player to \ndictate terms and control a rally till the point is won. \nHowever weak return of serve will allow the opponent \nto go on the offensive. While receiving the serve to hit \nthe shuttle, normally players stand in the centre of the \ncourt with the left foot forward and place the weight \nof the body more on the front foot. It will help the \nplayer to receive all types of serves i.e. high, low and \nflick. In fact, players are advised to take the stance \ncloser to the short service because in high serve the \nshuttle remains in the air for a longer duration. On \na high serve, a player has the choice of playing an \nattacking clear, drop shot, smash or a half smash. \nSimilarly, on a low serve, a player can flick, push or \nlift the shuttle to the baseline. It is important to try \nto meet the shuttle as close to the net as possible so \nthat the receiver has more options available to choose  \nthe shots. \nGymnastics\nGymnastics is a sport that involves physical movements \nin a sequence. It requires physical strength, balance, \ncoordination, endurance, flexibility and body control. It \noften involves dance moves, flips, twists, jumps and other \nmoves. It helps children to develop physical coordination and \nmotor skills, proper use of balance develop a good sense of \nprecision and timing. It can be performed as a way to stay fit \nor specifically to compete in events locally, nationally as well \nas internationally. \nHistory\nGymnastics was developed for fitness and beauty practices \nby the ancient Greeks. It included skills for mounting \nand dismounting a horse, and circus performance skills.  \nThe Greeks used gymnastics as military training. However, \nin the late eighteenth and early nineteenth century, the \nGerman physical educators created exercises for boys \nand young men on apparatus. Their design is considered \nas modern gymnastics. The Federation of International \nGymnastics was founded in 1881. By the end of the \nChap-5.indd   57 8/24/2020   11:38:34 AM\n2024-25\n\n--- Page 7 ---\nHealtH and PHysical education - class X\n58\nnineteenth century, men’s gymnastics competition was \npopular enough to be included in the first “Modern” Olympic \nGames in 1896 and women gymnasts were included in \nOlympic Games in 1986. The first world cup in gymnastics \nwas organised in 1975.\nForms of gymnastics\nThe major forms of gymnastics are: Artistic gymnastics, \nRhythmic gymnastics, Trampolining, Tumbling and Acrobatic \nGymnastics.\nArtistic gymnastics\nArtistic gymnastics is usually divided into Men’s and Women’s \nGymnastics. Men compete in six events. These are floor \nexercise, pommel horse, still rings/roman rings, vaulting \ntable, parallel bars, and horizontal bar. Women compete on \nfour events. These are floor exercise, vaulting table, uneven \nbars, and balancing beam.",
      "content_type": "exercise",
      "token_count": 710,
      "page_number": 6
    },
    {
      "id": "1cae0f93-ce39-430c-9a3b-e916477c4a91",
      "chapter_id": "bc049e7f-e5f7-4475-acc5-2e246bd72545",
      "chunk_index": 0,
      "content": "(i) Floor Exercise: For this event a 12×12 square \nspring floor is required. A series of tumbling \npasses are performed to demonstrate flexibility, \nstrength, and balance. The gymnast must also \nshow strength skills, including circles, scales, and \npress handstands. Men’s floor routines usually \nhave four passes that will total between 50–70 \nseconds and are performed without music. As per \nrules, male gymnasts touch each corner of the \nfloor at least once during their routine.\n (ii) Pommel Horse: A typical pommel horse exercise \ninvolves both single leg and double leg skills. \nSingle leg skills are generally found in the form of \nscissors, often done on the pommels. Double leg \nskill, however, is the main staple of this event. \nThe gymnast swings both legs in a circular motion \n(clockwise or counterclockwise depending on \npreference) and performs such skills on all parts \nof the apparatus. Gymnasts will often include \nvariations on a typical circling skill by turning or \nby straddling their legs.  This makes the exercises \nof gymnast more challenging. A gymnast performs \na dismount, either by swinging his body over the \nhorse or landing after a handstand.\n (iii) Still Rings: The rings are attached to a wire cable \nfrom a point to 5.75 meters from the floor, and \nadjusted in height so, that the gymnast has room \nto hang freely and swing. The gymnast performs a \nFig. 5.4: Pommel horse\nFig. 5.5: Vault\nChap-5.indd   58 8/24/2020   11:38:35 AM\n2024-25\n\n--- Page 8 ---\nIndIvIdual Games and sports II\n59\nnineteenth century, men’s gymnastics competition was \npopular enough to be included in the first “Modern” Olympic \nGames in 1896 and women gymnasts were included in \nOlympic Games in 1986. The first world cup in gymnastics \nwas organised in 1975.\nForms of gymnastics\nThe major forms of gymnastics are: Artistic gymnastics, \nRhythmic gymnastics, Trampolining, Tumbling and Acrobatic \nGymnastics.\nArtistic gymnastics\nArtistic gymnastics is usually divided into Men’s and Women’s \nGymnastics. Men compete in six events. These are floor \nexercise, pommel horse, still rings/roman rings, vaulting \ntable, parallel bars, and horizontal bar. Women compete on \nfour events. These are floor exercise, vaulting table, uneven \nbars, and balancing beam.",
      "content_type": "exercise",
      "token_count": 565,
      "page_number": 8
    },
    {
      "id": "1bed18e8-890f-45b0-99ec-042b4d112828",
      "chapter_id": "e1bea868-e4ad-4517-b3df-35284c112e6f",
      "chunk_index": 0,
      "content": "(i) Floor Exercise: For this event a 12×12 square \nspring floor is required. A series of tumbling \npasses are performed to demonstrate flexibility, \nstrength, and balance. The gymnast must also \nshow strength skills, including circles, scales, and \npress handstands. Men’s floor routines usually \nhave four passes that will total between 50–70 \nseconds and are performed without music. As per \nrules, male gymnasts touch each corner of the \nfloor at least once during their routine.\n (ii) Pommel Horse: A typical pommel horse exercise \ninvolves both single leg and double leg skills. \nSingle leg skills are generally found in the form of \nscissors, often done on the pommels. Double leg \nskill, however, is the main staple of this event. \nThe gymnast swings both legs in a circular motion \n(clockwise or counterclockwise depending on \npreference) and performs such skills on all parts \nof the apparatus. Gymnasts will often include \nvariations on a typical circling skill by turning or \nby straddling their legs.  This makes the exercises \nof gymnast more challenging. A gymnast performs \na dismount, either by swinging his body over the \nhorse or landing after a handstand.\n (iii) Still Rings: The rings are attached to a wire cable \nfrom a point to 5.75 meters from the floor, and \nadjusted in height so, that the gymnast has room \nto hang freely and swing. The gymnast performs a \nFig. 5.4: Pommel horse\nFig. 5.5: Vault\nroutine demonstrating balance, strength, power, \nand dynamic motion while preventing the rings \nthemselves from swinging. At least one static \nstrength move is required, but some gymnast \nincludes two or three strenghts. A routine should \nhave a dismount at the end of routine.\n (iv) Vault: In this, the gymnasts sprint down a runway, \nwhich is a maximum of 25 meters in length, before \nhurdling onto a spring board. The body position is \nmaintained while “punching” (blocking using only a \nshoulder movement) the vaulting board. The \ngymnast then rotates to a standing position. Multiple \ntwists and somersaults are added before landing in \ncase of advance gymnastics. Vaults depend on the \nspeed of the run, the length of the hurdle, the power \nthe gymnast generated from the legs and shoulder \ngirdle and the kinesthetic awareness in the air. In \ncase of more difficult and complex vaults the speed \nof rotation is more important.\n (v) Parallel Bars: Men perform \non two bars. These are \nkept slightly further than \na shoulder’s width apart \nand usually 1.75 m high. \nFor executing a series \nof swings, balances, \nand releases require \ngreat strength and co-\nordination.\n (vi) Horizontal Bar: A 2.8 cm thick steel or fiberglass \nbar raised 2.5m above the landing area is all the \ngymnasts have to hold onto as they perform giants \n(revolutions around the bar), release skills, twists, \nand changes of direction. By using all of the \nmomentum from giants and then releasing at the \nproper point, enough height can be achieved for \nspectacular dismounts. Leather grips are usually \nused to help maintain a grip on the bar.",
      "content_type": "exercise",
      "token_count": 761,
      "page_number": 9
    },
    {
      "id": "656a5cd4-52ea-4f5d-b369-7cda7eb0e116",
      "chapter_id": "5b79b0b2-8fad-4db2-af50-5d54022f234a",
      "chunk_index": 0,
      "content": "(i) Floor Exercise: The floor event occurs on a carpeted \n12m × 12m square, usually consisting of hard foam \nover a layer of plywood, which is supported by \nsprings or foam blocks generally called a “spring” \nfloor. Female gymnasts perform a choreographed \nroutine of 50 to 70 seconds in this event. The \nroutine should consist of tumbling lines, series of \njumps, dance elements, acrobatic skills, and turns.\nFig. 5.6: Parallel bars\nChap-5.indd   59 8/24/2020   11:38:36 AM\n2024-25\n\n--- Page 9 ---\nHealtH and PHysical education - class X\n60\n (ii) Vault: In the vaulting events gymnasts sprint \ndown a 25 meters (82 ft) runway, jump onto or \nperform a round off entry onto a beat board or \nspring board, land momentarily, inverted on the \nhands on the vaulting horse or vaulting table. \nThen they spring off this platform to a two footed \nlanding. Every gymnast starts at a different point \non the vault runway depending on her height and \nstrength. The post flight segment may include one \nor more multiple somersaults, and/or twisting \nmovements. In vaults with round-off entries, \ngymnasts “round-off” so that hands are on the \nrunway while the feet land on the springboard. \nFrom the round-off position the gymnast travels \nbackwards as in a back handspring so that the \nhands land on the vaulting platform (horse).  \nShe then blocks off the vaulting platform into \nvarious twisting and somersaulting combinations.\n (iii) Uneven Bars: On the uneven bars (also known as \nasymmetric bars), the gymnast performs a routine \non two horizontal bars set at different heights. The \nheight is generally fixed, but the width may be \nadjusted. Gymnasts perform swinging, circling, \ntransitional, and release moves, as well as moves \nthat pass through the handstand. Usually in higher \nlevels of gymnastics, leather grips are worn to ensure \nthat the gymnast maintains a grip on the bar, and \nto protect the hands from blisters and tears. \n (iv) Balance Beam: The gymnast performs a \nchoreographed routine from 70 to 90 seconds \nin length consisting of leaps, acrobatic skills, \nturns and dance elements on a padded spring \nbeam. Apparatus norms set by the International \nGymnastics Federation specify that the beam \nmust be 125 cm (4’) high, 500 cm (16’) long, and \n10 cm (4.5”) wide. The event requires in particular, \nbalance, flexibility and strength.",
      "content_type": "exercise",
      "token_count": 586,
      "page_number": 10
    },
    {
      "id": "bbb9d7d8-a706-4f62-8fdf-190498abdfb4",
      "chapter_id": "3a63ffc5-0004-4000-8344-3f642fe46c0d",
      "chunk_index": 0,
      "content": "Only women compete in rhythmic gymnastics, \nalthough there is a new version of this discipline \nfor men being pioneered in Japan. This combines \nelements of ballet, gymnastics, dance and apparatus \nmanipulation. The sport involves the performance of \nfive separate routines with the use of five apparatus \n– Ball, Ribbon, Hoop, Clubs, Rope on a floor area, \nwith a much greater emphasis on the aesthetic rather \nthan the acrobatic. \nFig. 5.7: Uneven bars\nFig. 5.8: Balance beam\nChap-5.indd   60 8/24/2020   11:38:37 AM\n2024-25\n\n--- Page 10 ---\nIndIvIdual Games and sports II\n61",
      "content_type": "text",
      "token_count": 144,
      "page_number": 10
    },
    {
      "id": "1e765fa7-bb85-4d1f-a9a1-f35285c39897",
      "chapter_id": "8d5913f5-2150-4c23-97e6-cb71aef50f16",
      "chunk_index": 0,
      "content": "Acrobatic gymnastics is one of the oldest \nforms of organised physical activities,  \nand today it is being reorganised, revitalised by \nchanges and renewed interest. The International \nFederation of Sports Acrobatics (IFSA) was founded \nin Moscow in 1973. United States Sports Acrobatics \n(USSA) was founded in 1975.  It was merged with \nInternational Gymnastics federation (FIG) in 1999. \nSports Acrobatics was demonstration sports at the \n2000 Olympics in Sydney. Now, it is an accepted \ncompetitive sport. It is  very effective for the \ndevelopment of physical fitness and graceful posture.\n  Acrobatic gymnastics is a group gymnastic discipline \nfor both men and women. Acrobats in groups of two, \nthree and four perform routines with the heads, \nhands and feet of their partners. They may, subject to \nregulations (e.g. instrumental), pick their own music.",
      "content_type": "example",
      "token_count": 215,
      "page_number": 11
    },
    {
      "id": "7b291a2d-9a61-49fb-8b4d-8948c4d00d18",
      "chapter_id": "aa4ef9b2-ef8a-4617-af04-25bb1aaab35d",
      "chunk_index": 0,
      "content": "Tumbling, also known as power tumbling, is a \ngymnastics sporting discipline which combines skills \nof artistic gymnastics with those of trampolining. It \nis sometimes practiced on a 25-meter-long spring \ntrack, competitors both male and female, perform two \npasses, each containing eight skills, along the track.\ntaBle tennis\nTable Tennis is also known as Ping-Pong, in which two or \nfour players participate using table-tennis rackets on a plain \nhard surface called Table, which is divided by a net.\nHistory\nThe game of Table Tennis probably descended from the \ngame of ‘Royal Tennis’, which was played in the medieval \nera (12th century A.D.) Table Tennis was probably played \nwith improvised equipment in England during the last \nquarter of 19th century. Evidence show that David Foster \nin England patented an action game of Tennis on Table in",
      "content_type": "text",
      "token_count": 212,
      "page_number": 11
    },
    {
      "id": "7cdc94eb-65a0-4597-abc6-28a8705bf736",
      "chapter_id": "ec352623-c3f1-4c6e-8fff-132f76d78774",
      "chunk_index": 0,
      "content": "called Gossima. In 1900, a celluloid ball was introduced by \nJaques and the name was given as ‘Ping-Pong’. Table Tennis \nis controlled by ITTF (International Table Tennis Federation) \nwhich was founded in 1926 with headquarters in Berlin. It \nwas introduced in Olympics in 1988 in Seoul, South Korea. \nFirst World Championship of Table-Tennis was held in \nLondon in 1926. TTFI (Table-Tennis Federation of India) was \nformed in 1926 in Calcutta, now known as Kolkata.\nChap-5.indd   61 8/24/2020   11:38:37 AM\n2024-25\n\n--- Page 11 ---\nHealtH and PHysical education - class X\n62\n9 ft\n6 Inch Net Height\n5 ft2.5 ft\nFig. 5.9: Table tennis\nRules\n • Table Tennis table is 9 ft. (2.74 meter) long, 5 ft. \n(1.525 meter) wide and 2.5 ft.(76 centimeter) high.\n • Net is 6 inches (15 centimeter) high from the table. \n • A game of Table Tennis is played up to 11 points.\n • A player or the pair who first scores 11 points wins \nunless both players or pairs score 10 points then the \ngame is won by the player or pairs who gains 2 point \nlead.\n • If a player causes the table to move while the ball is in \nplay, player loses a point.\n • A player shall score a point if the opponent’s free hand \ntouches the playing surface or the net assembly.\nFundamental techniques",
      "content_type": "text",
      "token_count": 313,
      "page_number": 12
    },
    {
      "id": "3c691e93-4a8d-4364-a0b2-23413cd40f6a",
      "chapter_id": "97915939-69e1-4dbb-a01c-76ea707c63ce",
      "chunk_index": 0,
      "content": "The manner in which players grip their rackets can \nbe classified into two major categories i.e. Pen hold \ngrip (mainly used by Chinese and Korean) and shake \nhand or Orthodox grip (commonly used). \n • Pen hold grip: In this, one grips the racket in such \na way as one holds a pen. It involves index finger \nand think joining each other across the handle \nand curling the middle, ring and fourth finger on \nthe back of the blade. The three fingers however, \nwill always remain touching one another.\nChap-5.indd   62 8/24/2020   11:38:37 AM\n2024-25\n\n--- Page 12 ---\nIndIvIdual Games and sports II\n63\nFig. 5.10: Pen hold grip\n • Shake hand grip:  In this grip, the racket is held \nin such a way as one shakes hand with someone. \nThe shake hand grip is used due to increasingly \nfast nature of the game, making the backhand \nstroke more effective.",
      "content_type": "text",
      "token_count": 211,
      "page_number": 12
    },
    {
      "id": "23e376cc-9be8-4660-93d1-ebd693295451",
      "chapter_id": "12ffbedb-6cc8-4db3-964b-e4d84a2b72e1",
      "chunk_index": 0,
      "content": "long service, short service, spin service, flat service, \nhigh toss service and back-hand or forehand service.",
      "content_type": "text",
      "token_count": 27,
      "page_number": 12
    },
    {
      "id": "b2ac1bc6-f47c-459b-9b6e-d6ca068c661e",
      "chapter_id": "bf7cc839-a638-44d8-a812-a1784880fbcf",
      "chunk_index": 0,
      "content": "and defensive including backhand and forehand.\n (i) Offensive strokes (drive, loop drive, loop, loop kill, \nhook, counter drive, flip and smash)\n a) Drive: The racket is primarily perpendicular \nto the direction of the stroke, and most of the \nenergy applied to the ball results in speed \nrather than spin, creating a shot that does \nnot arc much, but it is fast enough to make it \ndifficult to return.\n b) Loop drive: The racket is much more parallel \nto the direction of the stroke (closed) and the \nracket thus grazes the ball, resulting in a large \namount of topspin. Variations in spin and \nspeed add to the effectiveness of this shot. \n c) Loop: The loop produces a more pronounced \nloopy arc, with a higher trajectory and extreme \ntopspin, but is typically slower.\n d) Loop kill: The loop kill produces a flatter arc, \nwith higher speed that resembles a speed \ndrive but with stronger topspin.\n e) Hook: It is similar  to a regular Loop, but carries \na tilted topspin (or is referred as the “top-side” \nspin), it bounces sideways and downward \nupon hitting the table. \n f) Counter drive: It is a counter attack against \ndrives (normally high loop drives). One has \nChap-5.indd   63 8/24/2020   11:38:38 AM\n2024-25",
      "content_type": "text",
      "token_count": 305,
      "page_number": 12
    },
    {
      "id": "3602838b-9e5c-4019-8605-fde112c3d808",
      "chapter_id": "bf7cc839-a638-44d8-a812-a1784880fbcf",
      "chunk_index": 1,
      "content": "--- Page 13 ---\nHealtH and PHysical education - class X\n64\nto bring close to the racket and stay close to \nthe ball (try to predict its path). The racket is \nheld closed and near to the ball, which is hit \nwith a short movement off the bounce (before \nreaching the highest point) so that the ball \ntravels faster to the other side.\n g) Flip: When a player tries to attack a ball that \nhas not bounced beyond the edge of the table, \nhowever the ball may still be attacked, and the \nresulting shot is called flip because the back \nswing is compressed into a quick wrist action. \n h) Smash: Smash is executed when his or her \nopponent has returned a ball that bounces too \nhigh and/ or too close to the net. Smashing \nis a large back swing and rapid acceleration \nimparting as much speed on the ball as possible. \n (ii) Defensive strokes\n a) Push or Slice: The push is usually used for \nkeeping the point alive and creating offensive \nopportunities. A push resembles a tennis slice, \nthe racket cuts underneath the ball, imparting \nbackspin and causing the ball to float slowly \nto the other side of the table. Offensive players \nshould only push for variation and not for \ngeneral rallies. \n b) Chop: A chop or cut is the defensive, backspin \ncounterpart to the offensive loop drive. A chop \nis essentially a bigger, heavier slice, taken well \nback from the table. Sometimes a defensive \nplayer can impart no spin on the ball during \na chop, or frequently add right- or left-hand \nspin to the ball. This may further confuse his/\nher opponent. \n c) Block: A block is executed by simply putting \nthe racket in front of the ball, the ball rebounds \nback toward the opponent with nearly as \nmuch energy as it came in with. This is not \nas easy as it sounds, because the ball’s spin, \nspeed, and location, all influence the correct \nangle of a block. \n d) Side spin drive: The premise of this move is to \nput a spin on the ball either to the right or the \nleft of the racket. The execution of this move \nis similar to a slice, but to the right or left, \ninstead of down. This spin will result in the ball \ncurving to the side but bouncing in the opposite \ndirection when the opponent returns it. \nChap-5.indd   64 8/24/2020   11:38:38 AM\n2024-25",
      "content_type": "text",
      "token_count": 559,
      "page_number": 12
    },
    {
      "id": "4f0f71e0-eafc-4471-8035-6ed4a2af2905",
      "chapter_id": "bf7cc839-a638-44d8-a812-a1784880fbcf",
      "chunk_index": 2,
      "content": "--- Page 14 ---\nIndIvIdual Games and sports II\n65\n e) Lob: The defensive High Ball or Lob is \ndeceptive in its simplicity. To execute a High \nBall, a defensive player first backs off the table \n8-10 meters; then, the stroke itself consists of \nsimply lifting the ball to an enormous height \nbefore it falls back to the opponent’s side of \nthe table. A High Ball is inherently a creative \nshot, and can have nearly any kind of spin.\n f) Drop shot: The drop shot is a high level stroke, \nused as another variation for close-to-table \nstrokes. The player has position the racket close \nto the ball and just let the ball touch it (without \nany hand movement) in a way that the ball stays \nclose to the net with almost no speed and spin, \nand touches the other side of the table more \nthan twice if the opponent doesn’t reach it. \nSkills\nForehand drive\n • Keep arm close to the torso.\n • Forearm makes 90° with the upper arm.\n • Draw the forearm back to another 45°.\n • Let the waist turn naturally along with the arm and \nshift your weight towards the right foot.\n • Swing forward with a slight upward motion while \nshifting your weight back to left foot.\n • Elbow should be used as a pivot point and should only \nmove a little forward in the follow through.\nFig. 5.11: Forehand drive\nBackhand drive\n • Form ready position.\n • Turn waist towards left with Racket towards 9 O’clock \nposition.\n • Contact with the ball is made in front of the body \nslightly after the top of the bounce.\nChap-5.indd   65 8/24/2020   11:38:42 AM\n2024-25\n\n--- Page 15 ---\nHealtH and PHysical education - class X\n66\n • Elbow acts as pivot point.\n • Snap the forearm forward in slightly upward direction.\n • Power comes with the flick of the wrist.\n • Follow through until the racket points after the ball.\nFig. 5.12: Backhand drive\nBlocking \nIt is a backup shot, when there isn’t enough time for a full \ndrive or loop. This stroke allows the players to use opponent \nforce against them.\n • Adjust the racket angle according to the severity of top \nspin. More the spin, more one should close the racket.\n • Involve a little backspin and follow through.\n • Execute immediately after the bounce to keep control \nand speed.\n • Hit the ball as it is rising off the surface of the table on \nyour side using 50 per cent of the stroke action before \nhitting the ball and 50 per cent after hitting the ball.\nFig. 5.13: Blocking\ntennis\nTennis is one of the most popular individual sports in the \nworld. In tennis, the player uses a racquet to hit a ball over a \nnet into the opponent’s court. The ball must be kept in play \nand can only bounce one time on the court surface and the \nChap-5.indd   66 8/24/2020   11:38:49 AM\n2024-25",
      "content_type": "text",
      "token_count": 673,
      "page_number": 12
    },
    {
      "id": "aa398a87-dee5-49f2-b341-e723b700097e",
      "chapter_id": "bf7cc839-a638-44d8-a812-a1784880fbcf",
      "chunk_index": 3,
      "content": "--- Page 16 ---\nIndIvIdual Games and sports II\n67\nopponent must strike the ball back over the net. It is a sport \nusually played between two players (singles) or between two \nteams of two players each (doubles).\nCenter\n9m 80cmAntenna\nMinimum CeilingHeight 7m\n18m\n2.43m Men 2.24m Women\n5cm Center Line\n3m\n9m\nServing Area 3m\nAttack Line\nEnd Line\nFig. 5.14: Tennis court\nHistory\nAn early version of Tennis started in the 16th century in \nFrance where players would yell “tenez” when starting a \ngame giving the game the name, Tennis. Later the game was \nrefined in England in the 19th century as lawn tennis which \nresembled the sport played today. The world’s oldest tennis \ntournament, the Wimbledon Championships were first played \nin London in 1877. The comprehensive rules promulgated \nin 1924 by the International Lawn Tennis Federation, now \nknown as the International Tennis Federation, have remained \nlargely stable, one of the major changes being the addition of \nthe tie-back system. The Davis Cup, an annual competition \nbetween men’s national teams, dates to 1900. The analogous \ncompetition for women’s national teams, the Fed Cup, was \nfounded as the Federation Cup in 1963. There are four top \ntournaments called the Grand Slam Tournaments, these \nare Wimbledon, the US Open, the Australian Open, and the \nFrench Open. \nChap-5.indd   67 8/24/2020   11:38:49 AM\n2024-25\n\n--- Page 17 ---\nHealtH and PHysical education - class X\n68\nRules\nThe following are the rules regarding equipment, balls, court, \nlines and scoring:",
      "content_type": "text",
      "token_count": 382,
      "page_number": 16
    },
    {
      "id": "31ced734-1319-42a6-b464-e0fc414c35ea",
      "chapter_id": "fa4f0290-da51-4fee-8ae1-8e7402ea118b",
      "chunk_index": 0,
      "content": "(i) Racquets: Tennis racquet must adhere to the \nfollowing guidelines — \n • The hitting area, composed of the strings, \nmust be flat and generally uniform.\n • The frame of the hitting area may not be more \nthan 29 inches in length and 12.5 inches in \nwidth.\n • The entire racquet must be of a fixed shape, \nsize, weight, and weight distribution. There \nmay not be any energy source built into the \nracquet.\n • The racquet must not provide any kind of \ncommunication, instruction or advice to the \nplayer during the match.\n (ii) Balls: Tennis balls are of hollow rubber with a \nfelt coating. Traditionally white, the predominant \ncolour was gradually changed to optic yellow in \nthe latter part of the 20th century to ensure better \nvisibility.\n (iii) Court\n • Tennis is played on a rectangular, flat surface, \nusually grass or clay, a hard court of concrete \nand/or asphalt and occasionally carpet \n(indoor). The court is 78 feet (23.77 m) long, \nand 27 feet (8.23 m) wide for singles matches \nand 36 ft (10.97 m) for doubles’ matches. \n • Additional clear space around the court is \nrequired for players so as to reach over run \nballs. \n • A net is stretched across the full width of the \ncourt, parallel with the baselines, dividing it \ninto two equal ends. The net is 3 feet 6 inches \n(1.07 m) high at the posts and 3 feet (91.4 cm) \nhigh in the center. \n (iv) Lines\n • The lines that delineate the width of the court \nare called the baseline (farthest back) and the \nservice line (middle of the court). \n • The short mark in the center of each baseline \nis referred to as either the hash mark or the \ncenter mark. \nChap-5.indd   68 8/24/2020   11:38:49 AM\n2024-25",
      "content_type": "text",
      "token_count": 416,
      "page_number": 16
    },
    {
      "id": "d485672b-a1c4-4372-ba4f-da8e6a3282f7",
      "chapter_id": "fa4f0290-da51-4fee-8ae1-8e7402ea118b",
      "chunk_index": 1,
      "content": "--- Page 18 ---\nIndIvIdual Games and sports II\n69\n • The outermost lines that make up the length \nare called the doubles’ sidelines. These are \nthe boundaries used when doubles is being \nplayed. \n • The lines to the inside of the doubles’ \nsidelines are the singles’ sidelines and used as \nboundaries in singles’ play. The area between \na doubles’ sideline and the nearest singles’ \nsideline is called the doubles’ alley, which is \nconsidered playable in doubles’ play. \n • The line that runs across the center of a \nplayer’s side of the court is called the service \nline because the serve must be delivered into \nthe area between the service line and the net \non the receiving side. \n • All the lines are required to be 2 inches  \n(51 mm) in width. The baseline can be up to 4 \ninches (100 mm) wide if so desired. \n (v) Scoring\n • The players (or teams) start on opposite sides \nof the net. One player is designated as the \nserver, and the opposing player is the receiver. \n • A tennis match is determined through the \nbest of 3 or 5 sets. Women play 3 set matches, \nwhile men play 5 set matches. For men, the \nfirst player to win three sets wins the match, \nand for women, the first player to win two sets \nwins the match.\n • A set consists of games, and a game, in turn, \nconsists of a sequence of points played with \nthe same player serving. \n • A game is won by the first player to have won \nat least four points in total and at least two \npoints more than the opponent. \n • The running score of each game is described \nin a manner peculiar to tennis: scores from \nzero to three points are described as “love”, \n“15”, “30”, and “40” respectively \n • If at least three points have been scored by \neach player, making the player’s score equal \nat 40 a piece, the score is not called out as \n“40-40”, but rather as “deuce”. \n • If at least three points have been scored by \neach side and a player has one more point \nthan the opponent, the score of the game is \n“advantage” for the player in the lead. \nChap-5.indd   69 8/24/2020   11:38:49 AM\n2024-25",
      "content_type": "text",
      "token_count": 513,
      "page_number": 16
    },
    {
      "id": "16efd6ba-6f2b-4c49-84d0-8339f1425193",
      "chapter_id": "fa4f0290-da51-4fee-8ae1-8e7402ea118b",
      "chunk_index": 2,
      "content": "--- Page 19 ---\nHealtH and PHysical education - class X\n70\n • A game point occurs in tennis whenever \nthe player who is in the lead in the game \nneeds only one more point to win the game. \nThe terminology is extended to sets (set \npoint), matches (match point), and even \nchampionships (championship point). \n • A break point occurs if the receiver, not the \nsever, has a chance to win the game with \nthe next point. Break points are of particular \nimportance because serving is generally \nconsidered advantageous, with the server being \nexpected to win games in which they are serving. \n • A receiver who has one (score of 30–40), two \n(score of 15–40) or three (score of love-40) \nconsecutive chances to win the game has \nbreak point, double break point or triple break \npoint, respectively.\n • If the leading player wins that game, the player \nwins the set 7–5. If the trailing player wins \nthe game, a tie-break is played. A tie-break, \nplayed under a separate set of rules, allows \none player to win one more game and thus the \nset, to give a final set score of 7–6. \n • In tournament play, the chair umpire \nannounces the winner of the set and the \noverall score.",
      "content_type": "text",
      "token_count": 292,
      "page_number": 19
    },
    {
      "id": "7254df5a-ce6a-4830-b0bc-90e822c101f3",
      "chapter_id": "2bd882b3-cd95-49ce-88fa-a5f4f6b34a86",
      "chunk_index": 0,
      "content": "A grip is a way of holding the racquet in order to hit \nshots during a match. There are three types of grip. \n i.  Forehand: the tennis forehand is a stroke in \nwhich the inner side of the palm of the dominant \nhand that is holding the racket faces forward. The \nforehand stroke is made by swinging the racket \nacross one’s body in the direction of where one \nwants to land the ball.\n ii. Backhand: The backhand is a tennis stroke in \nwhich one swings the racquet around one’s body \nwith the back of the hand preceding the palm.\n iii. The Serve (Service): A serve in tennis is a shot to \nstart a pint. A player will hit the ball with racquet \nso it will fall into the diagonally opposite service \nbox without being stopped by the net. There are \nthree types of serve —\n a) Flat Serve \n b) Slice Serve\n c) Kick Serve\nChap-5.indd   70 8/24/2020   11:38:49 AM\n2024-25\n\n--- Page 20 ---\nIndIvIdual Games and sports II\n71\nswimmin G\nSwimming is a water based sport where a person propels the \nbody through the water by arms, known as strokes and legs \nthat are called kicks and move progressively through water. \nIt is a sport for all round development of the child. Swimming \nimproves cardiovascular system and places minimum stress \non joints. It employs major muscle groups of the body leading \nto a well-developed flexible muscular system. Swimming is \nalso important for physical rehabilitation for people suffering \nfrom disabilities or those recovering from injuries.\nFig. 5.15: Swimming\nHistory\nSwimming is a sport that was included in the first modern \nOlympic Games at Athens in 1896, diving events were \nadded in 1904 and women’s competitions were recognised \nin 1912. FINA (Federation International de Notation) was \nformed at London Olympic in 1908 AD. National Swimming \nAssociation of India was founded in 1949. Swimming \nwas one of the six sports at the First Asian Games held \nat Delhi in 1951. The aquatic sport of swimming involves \ncompetition amongst participants to be the fastest over a \ngiven distance. Different di stances are covered in different \nlevels of competition.\nRules\n • A swimmer must finish the race in the same lane. \nSwimming across another lane or interfering with the \nother shall disqualify the offender.\n • During a turn the swimmer shall touch the end of  \nthe pool.\n • A swimmer should not walk. \n • Any swimmer not participating in a race, who enters the \nwater in which an event is being conducted before all \nswimmers shall be disqualified from the next scheduled \nrace in the meet.\nDo You Know?\nThe current Olympic \ngames contain freestyle \nevents of 50m, 100m, \n200m, 400m, 800m, \nand 1500m; 100m and \n200m events in each of \nbackstroke, breaststroke \nand butterfly; 200m \nIndividual Medley \n(that is, 50m butterfly, \n50m backstroke, 50m \nbreaststroke, and \n50m freestyle); 400m \nIndividual Medley \n(100m butterfly, 100m \nbackstroke, 100m \nbreaststroke, and 100m \nfreestyle); and the \nMarathon 10km.\nChap-5.indd   71 8/24/2020   11:38:50 AM\n2024-25",
      "content_type": "text",
      "token_count": 747,
      "page_number": 19
    },
    {
      "id": "74239b73-f426-44b7-b3e8-46d2242acf56",
      "chapter_id": "2bd882b3-cd95-49ce-88fa-a5f4f6b34a86",
      "chunk_index": 1,
      "content": "--- Page 21 ---\nHealtH and PHysical education - class X\n72\n • There shall be four swimmers in each relay team. In \nrelay events, the team of swimmers whose feet lose \ntouch with the starting platform before the preceding \nteammate touches the wall shall be disqualified. Any \nrelay team shall be disqualified from a race if a team \nmember, other than the swimmer designated to swim \nthat length, enters the water when the race is being \nconducted, before swimmers of all teams have finished \nthe race. The member of a relay team and their order \nof competing must be nominated before the race. Any \nrelay team member may compete in a race only once. \n • The composition of a relay team may be changed \nbetween the heats and finals of the event, provided that \nit is made up from the list of swimmers properly entered \nby a member for that event. Failure to swim in the \norder listed will result in disqualification. Substitutions \nmay be made only in the case of a documented  \nmedical emergency.\n • Any swimmer having finished the race, or the stipulated \ndistance in a relay event, must leave the pool as soon \nas possible without obstructing any other swimmer \nwho has not yet finished the race. Otherwise the \nswimmer committing the fault or the relay team shall \nbe disqualified.\n • Should a foul endanger the chances of success of a \nswimmer, the referees shall have the power to allow the \nswimmer to compete in the next heat or, should the \nfoul occur in a final event or in the last heat, they may \norder it to be re-swim.\nFundamental techniques\nTechniques in swimming are strokes, starts and turns.\nStrokes\nIn swimming there are four competitive strokes (Front \nCrawl, Back Crawl, Breast stroke and Butterfly stroke) being \nfollowed all over the world. All the above mentioned strokes \nhave been learnt in the previous class.\nStarts\nAll four competitive strokes are to be started in the competition \nby using the technique known as start. The swimmers \nemphasis on the quickest technique, which allows him a \nstronger push off from the starting position. The starting \ntechniques, popular today, are: (i) Grab start (ii) Circular \nstart (iii) Racings start (iv) Conventional start (v) Tuck start. \nThe following sequence is followed; (i) Position on the block \n(ii) Take off (iii) Flight (position in air) (iv) Entry into the water \nChap-5.indd   72 8/24/2020   11:38:50 AM\n2024-25",
      "content_type": "text",
      "token_count": 597,
      "page_number": 19
    },
    {
      "id": "4f04701a-683f-4b97-b7c8-7295626d97ca",
      "chapter_id": "2bd882b3-cd95-49ce-88fa-a5f4f6b34a86",
      "chunk_index": 2,
      "content": "--- Page 22 ---\nIndIvIdual Games and sports II\n73\n(v) Glide (vi) First stroke. However, backstroke uses almost \na uniform technique, which does not have any special name \nand is known as backstroke start.\nTurns\nDuring the race, the swimmer must take a turn from the end \nof the wall to complete the full distance. The swimmers try \nto use a technique that is quicker and gives a strong push \noff from the wall within the permissible rules of the stroke. \nThe various turns used by swimmers are: (i) Simple turn  \n(ii) Throw away turn (iii) Summer Sault turn (iv) Flip turn (v) \nRoll over turn (vi) Breast stroke turn (vii) Butterfly turn. \nThe following sequence is followed in the turn: (i) Approach \nto the wall (ii) Turn or touch (iii) Push off (iv) Glide (v) First \nstroke.\nTactics\nSwimming is an individual and cyclic sport. It is highly \ncompetitive with the application of science. It is getting \ntransformed from an art to science. Now, the importance is \ngiven to strategy and tactics for completing and pacing the \nrace. In order to achieve the best performance, a swimmer \nmust learn to distribute the distance economically and \nthoughtfully throughout the race. Tactics in swimming \nduring different races can be categorised in three different \nphase —  (i) Sprint races (ii) Middle distance races (iii) Long \ndistance races\nSprint races\nThe 50 m race or the sprint race depends on the start, \nmaintaining the speed and a good finish.\nMiddle and Long distance races\nIn these races, the key word is to build endurance and speed. \nIn middle and long distance races, the swimmer tries to \nprevent building up high oxygen debt. Swimming at a very \nfast pace will accumulate a high level of oxygen debt early \nin the race and will experience an immediate drop in speed. \nSwimmer may sometimes prefer to begin faster than an ideal \npace and attempt to get out in front avoiding the choppy \nwaters. Some swimmers like to swim the strategy races in \nrelation to the opponent.\nChap-5.indd   73 8/24/2020   11:38:50 AM\n2024-25\n\n--- Page 23 ---\nHealtH and PHysical education - class X\n74\nassessment\nBadminton\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 536,
      "page_number": 22
    },
    {
      "id": "d66c7266-4033-46a8-a7a1-aa8c11a6fe78",
      "chapter_id": "c6757450-1d95-4418-9c7f-dd5ef23beed1",
      "chunk_index": 0,
      "content": "of badminton?",
      "content_type": "text",
      "token_count": 3,
      "page_number": 22
    },
    {
      "id": "e98859d9-1aa3-4137-9438-dc01e755b2d1",
      "chapter_id": "9f1a28e3-f14d-440c-8eeb-074fb70efe72",
      "chunk_index": 0,
      "content": "II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 5,
      "page_number": 22
    },
    {
      "id": "2d558578-b360-4e16-a92b-e28980e56425",
      "chapter_id": "1570543d-35d6-47cc-aa40-cb2bdcc61a43",
      "chunk_index": 0,
      "content": "III. State whether True or False",
      "content_type": "text",
      "token_count": 8,
      "page_number": 23
    },
    {
      "id": "309f3640-feb3-4d03-88a4-6a9fbeaffa35",
      "chapter_id": "bb63a681-c4c6-4d1e-b200-4a13aaa88dc3",
      "chunk_index": 0,
      "content": "Gymnastics\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 11,
      "page_number": 23
    },
    {
      "id": "4bded8f1-0f7d-4c9e-958f-7a4d43691a2a",
      "chapter_id": "d7fc259e-97e2-4e14-bb3d-fa464da7c830",
      "chunk_index": 0,
      "content": "women?\n II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 7,
      "page_number": 23
    },
    {
      "id": "8f7fc756-3a82-4e56-9f78-003569c465bc",
      "chapter_id": "560ba497-9b50-4208-b49c-cd4f35ed3b17",
      "chunk_index": 0,
      "content": "_____________ at _____________.",
      "content_type": "text",
      "token_count": 7,
      "page_number": 23
    },
    {
      "id": "ed022640-d150-4131-90c4-773d96d68771",
      "chapter_id": "30682307-851f-469e-b626-163b4038a11a",
      "chunk_index": 0,
      "content": "arrived in time.\n III. State whether True or False",
      "content_type": "text",
      "token_count": 12,
      "page_number": 23
    },
    {
      "id": "d3a56a6c-4037-4a8c-afcf-ffd2ae156a42",
      "chapter_id": "b67410d3-7d0d-4c4c-851e-c9aecdff409c",
      "chunk_index": 0,
      "content": "Chap-5.indd   74 8/24/2020   11:38:50 AM\n2024-25\n\n--- Page 24 ---\nIndIvIdual Games and sports II\n75",
      "content_type": "text",
      "token_count": 24,
      "page_number": 23
    },
    {
      "id": "0821d4d6-8c89-4c7d-a505-8c43d76dbffa",
      "chapter_id": "9b776f2a-70e5-4425-8a21-be73a8f52d82",
      "chunk_index": 0,
      "content": "year 1881.\ntaBle tennis\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 14,
      "page_number": 23
    },
    {
      "id": "ed63492a-c432-42df-a6b5-fc478396936f",
      "chapter_id": "27c2665e-b631-4716-9b98-0d22c0dc8357",
      "chunk_index": 0,
      "content": "and why?",
      "content_type": "text",
      "token_count": 2,
      "page_number": 23
    },
    {
      "id": "ee40bc0d-ce72-47f9-bc22-f1fd627d69f4",
      "chapter_id": "327f9134-adc8-445d-b4ef-d2e59106d2bc",
      "chunk_index": 0,
      "content": "II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 5,
      "page_number": 23
    },
    {
      "id": "00de379d-c647-4769-b8aa-9664e1f2e0e2",
      "chapter_id": "d220be4f-6cf5-4fc2-b2b6-c79444a51810",
      "chunk_index": 0,
      "content": "_____________ feet wide and  _____________ feet high.",
      "content_type": "text",
      "token_count": 13,
      "page_number": 23
    },
    {
      "id": "7bcac1b8-c95b-436b-947b-2336ef413fb1",
      "chapter_id": "3afebb01-417f-4de5-9a72-9ef3e7b4cba0",
      "chunk_index": 0,
      "content": "players and pairs score  _____________ points. Then the game is \nwon by the player or pairs who game a 2 point lead.",
      "content_type": "text",
      "token_count": 29,
      "page_number": 23
    },
    {
      "id": "c211abc4-bce4-4fc0-b60c-ac0699f42d23",
      "chapter_id": "a4c25587-7b1f-4361-a9cc-31f36595d9cd",
      "chunk_index": 0,
      "content": "player  _____________ a point.",
      "content_type": "text",
      "token_count": 7,
      "page_number": 24
    },
    {
      "id": "e57c70ef-aeeb-412c-b89b-03be814c1cde",
      "chapter_id": "a14dcd93-69a3-4aff-afb7-d969dbd73e58",
      "chunk_index": 0,
      "content": "touches the playing surface or the net assembly.\ntennis\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 22,
      "page_number": 24
    },
    {
      "id": "5140a9ff-758a-4f2c-8eb3-9802633555c6",
      "chapter_id": "58bc3625-471a-416b-9085-4d7e6702b48d",
      "chunk_index": 0,
      "content": "II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 5,
      "page_number": 24
    },
    {
      "id": "9270c66d-79c2-4d1f-8b1c-dbd80ebc37a7",
      "chapter_id": "f668cd70-01d2-4e8d-93ad-315ec72d2155",
      "chunk_index": 0,
      "content": "inches in length.",
      "content_type": "text",
      "token_count": 4,
      "page_number": 24
    },
    {
      "id": "96445f53-0827-4ef3-8f32-abf0990a94c7",
      "chapter_id": "2ab19733-e881-455f-86c2-bb507089b22c",
      "chunk_index": 0,
      "content": "white, the predominant color was gradually changed to  \n_____________.",
      "content_type": "text",
      "token_count": 17,
      "page_number": 24
    },
    {
      "id": "da09db26-fffc-470b-a1e2-3e5b4f7fb256",
      "chapter_id": "40a96df6-0170-48b9-830d-0027ed5eb46f",
      "chunk_index": 0,
      "content": "wide for singles matches.\nChap-5.indd   75 8/24/2020   11:38:50 AM\n2024-25\n\n--- Page 25 ---\nHealtH and PHysical education - class X\n76",
      "content_type": "text",
      "token_count": 33,
      "page_number": 24
    },
    {
      "id": "aacdeb19-a8e8-480e-ad33-ea95e010b044",
      "chapter_id": "df4e4cb2-2690-4734-aa3a-d1a0c16d2d96",
      "chunk_index": 0,
      "content": "_____________.",
      "content_type": "text",
      "token_count": 3,
      "page_number": 24
    },
    {
      "id": "01c599fe-9e1c-478b-86bd-a409319c74e2",
      "chapter_id": "6cca5dfd-a592-41f9-8971-52f8a7ffec71",
      "chunk_index": 0,
      "content": "Women play  _____________ set matches, while men play  \n_____________ set matches.\nswimminG\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 31,
      "page_number": 24
    },
    {
      "id": "75007003-27dc-4d1c-a727-68977316e128",
      "chapter_id": "6944b1bf-3a93-45ca-9a03-6d7ea16bbe41",
      "chunk_index": 0,
      "content": "I. Fill in the Blanks",
      "content_type": "text",
      "token_count": 5,
      "page_number": 24
    },
    {
      "id": "45f43dfb-b8ab-49cf-8590-0eb372783d08",
      "chapter_id": "a89630ba-301a-4671-8bf7-edd34b24a822",
      "chunk_index": 0,
      "content": "and  _____________ mts. width.",
      "content_type": "text",
      "token_count": 7,
      "page_number": 24
    },
    {
      "id": "95f2ebb1-1bbe-4193-a40c-f2f31996a82e",
      "chapter_id": "d6e62a9c-0973-4000-ad17-57996f3e7abc",
      "chunk_index": 0,
      "content": "II. State whether True or False",
      "content_type": "text",
      "token_count": 7,
      "page_number": 24
    },
    {
      "id": "b79d7572-12c1-4550-9bd5-d8758380c1db",
      "chapter_id": "a3e81514-56a1-4e59-94ce-9234fbad9b84",
      "chunk_index": 0,
      "content": "Chap-5.indd   76 8/24/2020   11:38:51 AM\n2024-25",
      "content_type": "text",
      "token_count": 12,
      "page_number": 24
    }
  ]
}