{
  "textbook": {
    "id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
    "file_name": "Class X Science NCERT - Ch 00 - Magnetic Effects of.pdf",
    "title": "Magnetic Effects of",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 13,
    "file_size_mb": 1.794266700744629,
    "status": "ready",
    "processed_at": "2025-09-28T10:54:37.484888",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 00 - Magnetic Effects of.pdf"
  },
  "chapters": [
    {
      "id": "13bb0b7c-2281-46b3-af3b-86aa1be6f23e",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 1,
      "title": "1. Why does a compass needle get deflected when brought near",
      "topics": [],
      "start_page": 2,
      "end_page": 6,
      "content": "a bar magnet?\nActivity 12.2Activity 12.2Activity 12.2Activity 12.2Activity 12.2\n/square6Fix a sheet of white paper on a drawing\nboard using some adhesive material.\n/square6Place a bar magnet in the centre of it.\n/square6Sprinkle some iron filings uniformly\naround the bar magnet (Fig. 12.2). A\nsalt-sprinkler may be used for this\npurpose.\n/square6Now tap the board gently.\n/square6What do you observe?\n Figure 12.2Figure 12.2Figure 12.2Figure 12.2Figure 12.2\nIron filings near the bar magnet align\nthemselves along the field lines.\nThe iron filings arrange themselves in a pattern as shown\nFig. 12.2.  Why do the iron filings arrange in such a pattern? What does\nthis pattern demonstrate?  The magnet exerts its influence in the region\nsurrounding it.  Therefore the iron filings experience a force.  The force\nthus exerted makes iron filings to arrange in a pattern. The region\nsurrounding a magnet, in which the force of the magnet can be detected,\nis said to have a magnetic field.  The lines along which the iron filings\nalign themselves represent magnetic field lines.\nAre there other ways of obtaining magnetic field lines around a bar\nmagnet?  Yes, you can yourself draw the field lines of a bar magnet.\nActivity 12.3Activity 12.3Activity 12.3Activity 12.3Activity 12.3\n/square6Take a small compass and a bar magnet.\n/square6Place the magnet on a sheet of white paper fixed on a drawing\nboard, using some adhesive material.\n/square6Mark the boundary of the magnet.\n/square6Place the compass near the north pole of the magnet. How does\nit behave? The south pole of the needle points towards the north\npole of the magnet. The north pole of the compass is directed\naway from the north pole of the magnet.\n2024-25\n\n--- Page 3 ---\nMagnetic Effects of Electric Current 197\nMagnetic field is a quantity that has both direction and magnitude.\nThe direction of the magnetic field is taken to be the direction in which a\nnorth pole of the compass needle moves inside it.  Therefore it is taken\nby convention that the field lines emerge from north pole and merge at\nthe south pole (note the arrows marked on the field lines in Fig. 12.4).\nInside the magnet, the direction of field lines is from its south pole to its\nnorth pole. Thus the magnetic field lines are closed curves.\nThe relative strength of the magnetic field is shown by the degree of\ncloseness of the field lines. The field is stronger, that is, the force acting\non the pole of another magnet placed is greater where the field lines are\ncrowded (see Fig. 12.4).\nNo two field-lines are found to cross each other. If they did, it would\nmean that at the point of intersection, the compass needle would point\ntowards two directions, which is not possible.\n12.2\n12.212.2 12.212.2 MA MAMA MAMAGNETIC FIELD DUE TO A CURRENTGNETIC FIELD DUE TO A CURRENTGNETIC FIELD DUE TO A CURRENTGNETIC FIELD DUE TO A CURRENTGNETIC FIELD DUE TO A CURRENT --- --C CC CCARRYING ARRYINGARRYING ARRYINGARRYING\nCONDUCTORCONDUCTORCONDUCTORCONDUCTORCONDUCTOR\nIn Activity 12.1, we have seen that an electric current through a\nmetallic conductor produces a magnetic field around it. In order to\nfind the direction of the field produced let us repeat the activity in the\nfollowing way  –\nFigure 12.3Figure 12.3Figure 12.3Figure 12.3Figure 12.3\nDrawing a magnetic field line with the help of a\ncompass needle\n/square6Mark the position of two ends of the needle.\n/square6Now move the needle to a new position\nsuch that its south pole occupies the\nposition previously occupied by its north\npole.\n/square6In this way, proceed step by step till you\nreach the south pole of the magnet as\nshown in Fig. 12.3.\n/square6Join the points marked on the paper by a\nsmooth curve.  This curve represents\na field line.\n/square6Repeat the above procedure and draw as\nmany lines as you can. Y ou will get a\npattern shown in Fig. 12.4. These lines\nrepresent the magnetic field around the\nmagnet. These are known as magnetic\nfield lines.\n/square6Observe the deflection in the compass\nneedle as you move it along a field line.\nThe deflection increases as the needle is\nmoved towards the poles.\nFigure 12.4Figure 12.4Figure 12.4Figure 12.4Figure 12.4\nField lines around a bar magnet\n2024-25\n\n--- Page 4 ---\nScience198\n12.2.1 Magnetic Field due to a Current through a Straight\nConductor\nWhat determines the pattern of the magnetic field generated by a current\nthrough a conductor? Does the pattern depend on the shape of the\nconductor? We shall investigate this with an activity.\nWe shall first consider the patter n of the magnetic field ar ound a\nstraight conductor carrying current.\nActivity 12.4Activity 12.4Activity 12.4Activity 12.4Activity 12.4\n/square6Take a long straight copper wire, two or three cells of 1.5 V each, and a plug key. Connect\nall of them in series as shown in Fig. 12.5 (a).\n/square6Place the straight wire parallel to and over a compass needle.\n/square6Plug the key in the circuit.\n/square6Observe the direction of deflection of the north pole of the needle. If the current flows from\nnorth to south, as shown in Fig. 12.5 (a), the north pole of the compass needle would move\ntowards the east.\n/square6Replace the cell connections in the circuit as shown in Fig. 12.5 (b). This would result in\nthe change of the direction of current through the copper wire, that is, from south to\nnorth.\n/square6Observe the change in the dir ection of deflection of the needle. Y ou will see that now the\nneedle moves in opposite direction, that is, towards the west [Fig. 12.5 (b)]. It means that\nthe direction of magnetic field produced by the electric current is also reversed.\nFigure 12.5Figure 12.5Figure 12.5Figure 12.5Figure 12.5 A simple electric circuit in which a straight copper wire is placed parallel to and over a compass\nneedle. The deflection in the needle becomes opposite when the direction of the current is reversed.\n(a) (b)\nActivity 12.5Activity 12.5Activity 12.5Activity 12.5Activity 12.5\n/square6Take a battery (12 V), a variable resistance (or a rheostat), an\nammeter (0–5 A), a plug key, connecting wires and a long straight\nthick copper wire.\n/square6Insert the thick wire through the centre, normal to the plane of a\nrectangular cardboard.  Take care that the cardboard is fixed and\ndoes not slide up or down.\n2024-25\n\n--- Page 5 ---\nMagnetic Effects of Electric Current 199\nWhat happens to the deflection of the compass needle placed at a\ngiven point if the current in the copper wire is changed? To see this, vary\nthe current in the wir\ne. We find that the deflection in the needle also\nchanges. In fact, if the current is increased, the deflection also increases.\nIt indicates that the magnitude of the magnetic field produced at a given\npoint increases as the current through the wire increases.\nWhat happens to the deflection of the needle if the compass is moved\naway from the copper wire but the current through the wire remains the\nsame? To see this, now place the compass at a farther point from the\nconducting wire (say at point Q). What change do you observe? We see\nthat the deflection in the needle decreases. Thus the magnetic field\nproduced by a given current in the conductor decreases as the distance\nfrom it increases. From Fig. 12.6, it can be noticed that the concentric\ncircles representing the magnetic field around a current-carrying straight\nwire become larger and larger as we move away from it.\n12.2.2 Right-Hand Thumb Rule\nA convenient way of finding the direction of magnetic field associated\nwith a current-carrying conductor is given in Fig. 12.7.\n/square6Connect the copper wire vertically between the\npoints X and Y, as shown in Fig. 12.6 (a), in\nseries with the battery, a plug and key.\n/square6Sprinkle some iron filings uniformly on the\ncardboard. (You may use a salt sprinkler for this\npurpose.)\n/square6Keep the variable of the rheostat at a fixed\nposition and note the current through the\nammeter.\n/square6Close the key so that a current flows through\nthe wire. Ensure that the copper wire placed\nbetween the points X and Y remains vertically\nstraight.\n/square6Gently tap the cardboard a few times. Observe\nthe patter n of the ir on filings. Y ou would find\nthat the iron filings align themselves showing\na pattern of concentric circles around the\ncopper wire (Fig. 12.6).\n/square6What do these concentric circles represent?\nThey represent the magnetic field lines.\n/square6How can the direction of the magnetic field be\nfound? Place a compass at a point (say P) over\na circle. Observe the direction of the needle. The\ndirection of the north pole of the compass\nneedle would give the direction of the field lines\nproduced by the electric current through the\nstraight wire at point P . Show the dir ection by\nan arrow.\n/square6Does the direction of magnetic field lines get\nreversed if the direction of current through the\nstraight copper wire is reversed? Check it.\nFigure 12.6Figure 12.6Figure 12.6Figure 12.6Figure 12.6\n(a) A pattern of concentric circles indicating\nthe field lines of a magnetic field around a\nstraight conducting wire. The arrows in the\ncircles show the direction of the field lines.\n(b) A close up of the pattern obtained.\n(a)\n(b)\nVariable\nresistance\n2024-25\n\n--- Page 6 ---\nScience200\nImagine that you are holding a current-carrying straight\nconductor in your right hand such that the thumb points towards\nthe direction of current. Then your fingers will wrap around the\nconductor in the direction of the field lines of the magnetic field, as\nshown in Fig. 12.7. This is known as the right-hand thumb rule*.\nExample 12.1\nA current through a horizontal power line flows in east to west\ndirection. What is the direction of magnetic field at a point directly\nbelow it and at a point directly above it?\nSolution\nThe current is in the east-west direction. Applying the right-hand\nthumb rule, we get that the magnetic field (at any point below or\nabove the wire) turns clockwise in a plane perpendicular to the wire,\nwhen viewed from the east end, and anti-clockwise, when viewed\nfrom the west end.\nFigure 12.7Figure 12.7Figure 12.7Figure 12.7Figure 12.7\nRight-hand thumb rule\n* This rule is also called Maxwell’s corkscrew rule. If we consider ourselves driving a\ncorkscrew in the direction of the current, then the direction of the rotation of\ncorkscrew is the direction of the magnetic field.\n12.2.3 Magnetic Field due to a Current through a\nCircular Loop\nWe have so far observed the pattern of the magnetic field lines\nproduced around a current-carrying straight wire. Suppose\nthis straight wire is bent in the form of a circular loop and a\ncurrent is passed through it. How would the magnetic field\nlines look like? We know that the magnetic field pr\noduced\nby a current-carrying straight wire depends inversely on the\ndistance from it. Similarly at every point of a current-carrying\ncircular loop, the concentric circles representing the magnetic\nfield around it would become larger and larger as we move\naway from the wire (Fig. 12.8). By the time we reach at the\ncentre of the circular loop, the arcs of these big circles would\nappear as straight lines. Every point on the wire carrying\ncurrent would give rise to the magnetic field appearing as\nstraight lines at the center of the loop. By applying the right\nhand rule, it is easy to check that every section of the wire\ncontributes to the magnetic field lines in the same direction\nwithin the loop.\nFigure 12.8Figure 12.8Figure 12.8Figure 12.8Figure 12.8\nMagnetic field lines of the field\nproduced by a current-carrying\ncircular loop\n?\nQUESTIONS"
    },
    {
      "id": "3a8102b4-21df-45de-865e-97531480a78c",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 4,
      "title": "3. Why don’t two magnetic field lines intersect each other?",
      "topics": [],
      "start_page": 6,
      "end_page": 7,
      "content": "2024-25\n\n--- Page 7 ---\nMagnetic Effects of Electric Current 201\nWe know that the magnetic field pr oduced by a curr ent-carrying\nwire at a given point depends directly on the current passing through it.\nTherefore, if there is a circular coil having n turns, the field produced is\nn times as large as that produced by a single turn. This is because the\ncurrent in each circular turn has the same direction, and the field due to\neach turn then just adds up.\nActivity 12.6Activity 12.6Activity 12.6Activity 12.6Activity 12.6\n/square6Take a rectangular cardboard having two holes.\nInsert a circular coil having large number of turns\nthrough them, normal to the plane of the cardboard.\n/square6Connect the ends of the coil in series with a battery,\na key and a rheostat, as shown in Fig. 12.9.\n/square6Sprinkle iron filings uniformly on the cardboard.\n/square6Plug the key.\n/square6Tap the cardboard gently a few times. Note the\npattern of the iron filings that emerges on the\ncardboard.\nFigure 12.9Figure 12.9Figure 12.9Figure 12.9Figure 12.9\nMagnetic field produced by a current-\ncarrying circular coil.\n12.2.4 Magnetic Field due to a Current in a Solenoid\nA coil of many circular turns of insulated copper wire wrapped\nclosely in the shape of a cylinder is called a solenoid. The pattern\nof the magnetic field lines around a current-carrying solenoid is\nshown in Fig. 12.10. Compare the pattern of the field with the\nmagnetic field around a bar magnet (Fig. 12.4). Do they look\nsimilar? Yes, they ar\ne similar. In fact, one end of the solenoid\nbehaves as a magnetic north pole, while the other behaves as the\nsouth pole. The field lines inside the solenoid are in the form of\nparallel straight lines. This indicates that the magnetic field is\nthe same at all points inside the solenoid. That is, the field is\nuniform inside the solenoid.\nA strong magnetic field produced inside a solenoid can be\nused to magnetise a piece of magnetic material, like soft iron,\nwhen placed inside the coil (Fig. 12.11). The magnet so formed is\ncalled an electromagnet.\nFigure 12.10Figure 12.10Figure 12.10Figure 12.10Figure 12.10\nField lines of the magnetic field\nthrough and around a current\ncarrying solenoid.\nFigure 12.11Figure 12.11Figure 12.11Figure 12.11Figure 12.11\nA current-carrying solenoid coil\nis used to magnetise steel rod\ninside it – an electromagnet.\nQUESTIONS\n?"
    },
    {
      "id": "b7226800-592b-46ea-9569-6e07b5a09be1",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 5,
      "title": "1. Consider a circular loop of wire lying in",
      "topics": [],
      "start_page": 7,
      "end_page": 8,
      "content": "the plane of the table. Let the current\npass through the loop clockwise. Apply\nthe right-hand rule to find out the\ndirection of the magnetic field inside\nand outside the loop."
    },
    {
      "id": "6eaf6400-d36b-4b91-89fd-1f38c3c7b6bc",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 6,
      "title": "2. The magnetic field in a given region is",
      "topics": [],
      "start_page": 8,
      "end_page": 8,
      "content": "uniform. Draw a diagram to represent it.\n2024-25\n\n--- Page 8 ---\nScience202\n12.3\n12.312.3 12.312.3 FORCE ON A CURRENTFORCE ON A CURRENTFORCE ON A CURRENTFORCE ON A CURRENTFORCE ON A CURRENT --- --C CC CCARRYING CONDUCTORARRYING CONDUCTORARRYING CONDUCTORARRYING CONDUCTORARRYING CONDUCTOR\nIN A MAGNETIC FIELDIN A MAGNETIC FIELDIN A MAGNETIC FIELDIN A MAGNETIC FIELDIN A MAGNETIC FIELD\nWe have lear nt that an electric current flowing through a conductor\nproduces a magnetic field. The field so produced exerts a force on a\nmagnet placed in the vicinity of the conductor. French scientist Andre\nMarie Ampere (1775–1836) suggested that the magnet must also exert\nan equal and opposite force on the current-carrying conductor. The force\ndue to a magnetic field acting on a current-carrying conductor can be\ndemonstrated through the following activity."
    },
    {
      "id": "40056928-0921-47f6-b08f-980143a62364",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 7,
      "title": "3. Choose the correct option.",
      "topics": [],
      "start_page": 8,
      "end_page": 10,
      "content": "The magnetic field inside a long straight solenoid-carrying current\n(a) is zero.\n(b) decreases as we move towards its end.\n(c) increases as we move towards its end.\n(d) is the same at all points.\nActivity 12.7Activity 12.7Activity 12.7Activity 12.7Activity 12.7\n/square6Take a small aluminium rod AB (of about 5 cm). Using\ntwo connecting wires suspend it horizontally from a\nstand, as shown in Fig. 12.12.\n/square6Place a strong horse-shoe magnet in such a way that\nthe rod lies between the two poles with the magnetic\nfield directed upwards. For this put the north pole of\nthe magnet vertically below and south pole vertically\nabove the aluminium rod (Fig. 12.12).\n/square6Connect the aluminium rod in series with a battery,\na key and a rheostat.\n/square6Now pass a current through the aluminium rod from\nend B to end A.\n/square6What do you observe? It is observed that the rod is\ndisplaced towards the left. You will notice that the r od\ngets displaced.\n/square6Reverse the direction of current flowing through the\nrod and observe the direction of its displacement. It is\nnow towards the right.\nWhy does the rod get displaced?\nFigure 12.12Figure 12.12Figure 12.12Figure 12.12Figure 12.12\nA current-carrying rod, AB, experiences\na force perpendicular to its length and\nthe magnetic field. Support for the\nmagnet is not shown here, for simplicity.\nThe displacement of the rod in the above activity suggests that a\nforce is exerted on the current-carrying aluminium rod when it is placed\nin a magnetic field. It also suggests that the direction of force is also\nreversed when the direction of current through the conductor is reversed.\nNow change the direction of field to vertically downwards by\ninterchanging the two poles of the magnet. It is once again observed that\n2024-25\n\n--- Page 9 ---\nMagnetic Effects of Electric Current 203\nthe direction of force acting on the current-carrying rod gets reversed. It\nshows that the direction of the force on the conductor depends upon the\ndirection of current and the direction of the magnetic field. Experiments\nhave shown that the displacement of the rod is largest (or the magnitude\nof the force is the highest) when the direction of current is at right angles\nto the direction of the magnetic field. In such a condition we can use a\nsimple rule to find the direction of the force on the conductor.\nIn Activity 12.7, we considered the\ndirection of the current and that of the magnetic\nfield perpendicular to each other and found\nthat the force is perpendicular to both of them.\nThe three directions can be illustrated through\na simple rule, called Fleming’s left-hand rule.\nAccording to this rule, stretch the thumb,\nforefinger and middle finger of your left hand\nsuch that they are mutually perpendicular\n(Fig. 12.13). If the first finger points in the\ndirection of magnetic field and the second\nfinger in the direction of current, then the\nthumb will point in the direction of motion or\nthe force acting on the conductor.\nDevices that use current-carrying conductors and magnetic fields\ninclude electric motor, electric generator, loudspeakers, micr\nophones\nand measuring instruments.\nExample 12.2\nAn electron enters a magnetic field at right angles to it, as shown\nin Fig. 12.14. The direction of force acting on the electron will be\n(a) to the right.\n(b) to the left.\n(c) out of the page.\n(d) into the page.\nSolution\nAnswer is option (d). The direction of force is perpendicular to the\ndirection of magnetic field and current as given by Fleming’s left hand\nrule. Recall that the direction of current is taken opposite to the direction\nof motion of electrons. The force is therefore directed into the page.\nFigure 12.13Figure 12.13Figure 12.13Figure 12.13Figure 12.13\nFleming’s left-hand rule\nFigure 12.14Figure 12.14Figure 12.14Figure 12.14Figure 12.14\nQUESTIONS\n?"
    },
    {
      "id": "a2be86af-60d2-4e37-b113-25ef490d6f07",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 8,
      "title": "1. Which of the following property of a proton can change while it moves",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "freely in a magnetic field? (Ther e may be mor e than one corr ect answer.)\n(a) mass (b) speed\n(c) velocity (d) momentum\n2024-25\n\n--- Page 10 ---\nScience204\n12.4 DOMESTIC ELECTRIC CIRCUITS12.4 DOMESTIC ELECTRIC CIRCUITS12.4 DOMESTIC ELECTRIC CIRCUITS12.4 DOMESTIC ELECTRIC CIRCUITS12.4 DOMESTIC ELECTRIC CIRCUITS\nIn our homes, we receive supply of electric power through a main supply\n(also called mains), either supported through overhead electric poles or\nby underground cables. One of the wires in this supply, usually with\nred insulation cover, is called live wire (or positive). Another wire, with\nblack insulation, is called neutral wire (or negative). In our country, the\npotential difference between the two is 220 V.\nAt the meter-board in the house, these wires pass into an electricity\nmeter through a main fuse. Through the main switch they are connected\nto the line wires in the house. These wires supply electricity to separate\ncircuits within the house. Often, two separate circuits are used, one of\n15 A current rating for appliances with higher power ratings such as\ngeysers, air coolers, etc. The other circuit is of 5 A current rating for\nbulbs, fans, etc. The earth wire, which has insulation of green colour, is\nusually connected to a metal plate deep in the earth near the house.\nThis is used as a safety measure, especially for those appliances that\nhave a metallic body, for example, electric pr\ness, toaster, table fan,\nrefrigerator, etc. The metallic body is connected to the earth wire, which\nprovides a low-resistance conducting path for the current. Thus, it\nensures that any leakage of current to the metallic body of the appliance\nkeeps its potential to that of the earth, and the user may not get a severe\nelectric shock."
    },
    {
      "id": "dedbe170-456e-4036-98a1-6e4e5352097a",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 9,
      "title": "2. In Activity 12.7, how do we think the displacement of rod AB will be",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "affected if (i) current in rod AB is increased; (ii) a stronger horse-shoe\nmagnet is used; and (iii) length of the rod AB is increased?"
    },
    {
      "id": "a0bf33e8-116d-409d-a491-34a14bfb1617",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 10,
      "title": "3. A positively-charged particle (alpha-particle) projected towards west is",
      "topics": [],
      "start_page": 10,
      "end_page": 11,
      "content": "deflected towards north by a magnetic field. The direction of magnetic\nfield is\n(a) towards south (b) towards east\n(c) downward (d) upward\nMagnetism in medicine\nAn electric current always produces a magnetic field. Even weak ion currents that\ntravel along the nerve cells in our body produce magnetic fields. When we touch\nsomething, our nerves carry an electric impulse to the muscles we need to use. This\nimpulse produces a temporary magnetic field. These fields are very weak and are\nabout one-billionth of the earth’s magnetic field. Two main organs in the human\nbody where the magnetic field produced is significant, are the heart and the brain. The\nmagnetic field inside the body forms the basis of obtaining the images of different body\nparts. This is done using a technique called Magnetic Resonance Imaging (MRI). Analysis\nof these images helps in medical diagnosis. Magnetism has, thus, got important uses\nin medicine.\nMore to Know!\n2024-25\n\n--- Page 11 ---\nMagnetic Effects of Electric Current 205\nFigure 12.15Figure 12.15Figure 12.15Figure 12.15Figure 12.15  A schematic diagram of one of the common domestic circuits\nQUESTIONS\n?\nFigure 12.15 gives a schematic diagram of one of the common\ndomestic circuits. In each separate circuit, different appliances can be\nconnected across the live and neutral wires. Each appliance has a\nseparate switch to ‘ON’/‘OFF’ the flow of current through it. In order\nthat each appliance has equal potential difference, they are connected\nparallel to each other.\nElectric fuse is an important component of all domestic circuits. We\nhave already studied the principle and working of a fuse in the previous\nchapter (see Section 11.7). A fuse in a circuit prevents damage to the\nappliances and the circuit due to overloading. Overloading can occur\nwhen the live wire and the neutral wire come into direct contact. (This\noccurs when the insulation of wires is damaged or there is a fault in the\nappliance.) In such a situation, the current in the circuit abruptly\nincreases. This is called short-circuiting. The use of an electric fuse\nprevents the electric circuit and the appliance from a possible damage\nby stopping the flow of unduly high electric current. The Joule heating\nthat takes place in the fuse melts it to break the electric circuit.\nOverloading can also occur due to an accidental hike in the supply\nvoltage. Sometimes overloading is caused by connecting too many\nappliances to a single socket."
    },
    {
      "id": "d7624094-cb92-4885-b041-89d18207b64c",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 11,
      "title": "1. Name two safety measures commonly used in electric circuits and",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "appliances."
    },
    {
      "id": "c1fb424c-b910-4633-966f-2cc1c26f655f",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 12,
      "title": "2. An electric oven of 2 kW power rating is operated in a domestic electric",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "circuit (220 V) that has a current rating of 5 A. What result do you\nexpect? Explain."
    },
    {
      "id": "f02e3ef4-06c8-4bb5-bdb3-5b5208ed5ecf",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 13,
      "title": "3. What precaution should be taken to avoid the overloading of domestic",
      "topics": [],
      "start_page": 11,
      "end_page": 12,
      "content": "electric circuits?\n2024-25\n\n--- Page 12 ---\nScience206\nWhat you have learnt\n/square6A compass needle is a small magnet. Its one end, which points towards north, is\ncalled a north pole, and the other end, which points towards south, is called a\nsouth pole.\n/square6A magnetic field exists in the region surrounding a magnet, in which the force of\nthe magnet can be detected.\n/square6Field lines are used to represent a magnetic field. A field line is the path along\nwhich a hypothetical free north pole would tend to move. The direction of the\nmagnetic field at a point is given by the direction that a north pole placed at that\npoint would take. Field lines are shown closer together where the magnetic field is\ngreater.\n/square6A metallic wire carrying an electric current has associated with it a magnetic field.\nThe field lines about the wire consist of a series of concentric circles whose direction\nis given by the right-hand rule.\n/square6The pattern of the magnetic field around a conductor due to an electric current\nflowing through it depends on the shape of the conductor. The magnetic field of a\nsolenoid carrying a current is similar to that of a bar magnet.\n/square6An electromagnet consists of a core of soft iron wrapped around with a coil of\ninsulated copper wire.\n/square6A current-carrying conductor when placed in a magnetic field experiences a force.\nIf the direction of the field and that of the current are mutually perpendicular to\neach other, then the force acting on the conductor will be perpendicular to both\nand will be given by Fleming’s left-hand rule.\n/square6In our houses we receive AC electric power of 220 V with a frequency of 50 Hz. One\nof the wires in this supply is with red insulation, called live wire. The other one is of\nblack insulation, which is a neutral wire. The potential difference between the two\nis 220 V. The third is the earth wire that has green insulation and this is connected\nto a metallic body deep inside earth. It is used as a safety measure to ensure that\nany leakage of current to a metallic body does not give any severe shock to a user.\n/square6Fuse is the most important safety device, used for protecting the circuits due to\nshort-circuiting or overloading of the circuits.\n2024-25\n\n--- Page 13 ---\nMagnetic Effects of Electric Current 207\nEXERCISES"
    },
    {
      "id": "2ba15c68-dba5-4ca6-bc3b-c9eb856480e6",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 14,
      "title": "1. Which of the following correctly describes the magnetic field near a long",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "straight wire?\n(a) The field consists of straight lines perpendicular to the wire.\n(b)  The field consists of straight lines parallel to the wire.\n(c) The field consists of radial lines originating from the wire.\n(d) The field consists of concentric circles centred on the wire."
    },
    {
      "id": "ec252e08-be5a-408d-a389-98929a76edcb",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 15,
      "title": "2. At the time of short circuit, the current in the circuit",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "(a) reduces substantially.\n(b) does not change.\n(c) increases heavily.\n(d) vary continuously."
    },
    {
      "id": "78e69592-6041-4d41-8269-b718718a3e5d",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 16,
      "title": "3. State whether the following statements are true or false.",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "(a) The field at the centre of a long circular coil carrying current will be\nparallel straight lines.\n(b) A wire with a green insulation is usually the live wire of an electric supply."
    },
    {
      "id": "9c91f9e3-361e-49a5-8c8b-82c71f18bfad",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 18,
      "title": "5. When is the force experienced by a current– carrying conductor placed in a magnetic",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "field largest?"
    },
    {
      "id": "c76ae1b4-15d3-4d67-875f-e74ee831fa7a",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 19,
      "title": "6. Imagine that you are sitting in a chamber with your back to one wall. An electron",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "beam, moving horizontally from back wall towards the front wall, is deflected by a\nstrong magnetic field to your right side. What is the direction of magnetic field?"
    },
    {
      "id": "541ee2c4-c439-44b2-b7f7-2f2d379dadca",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 20,
      "title": "7. State the rule to determine the direction of a (i) magnetic field produced around a",
      "topics": [],
      "start_page": 12,
      "end_page": 13,
      "content": "straight conductor-carrying current, (ii) for\nce experienced by a current-carrying\nstraight conductor placed in a magnetic field which is perpendicular to it, and\n(iii) current induced in a coil due to its rotation in a magnetic field."
    },
    {
      "id": "18bf6a3a-d874-4eb8-bd21-8f2015b952be",
      "textbook_id": "efc96001-93c7-43f4-9a44-9c234707dc5b",
      "chapter_number": 22,
      "title": "9. What is the function of an earth wire? Why is it necessary to earth metallic",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "appliances?\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "d610c1bc-8808-461c-8217-4ffb613678e2",
      "chapter_id": "13bb0b7c-2281-46b3-af3b-86aa1be6f23e",
      "chunk_index": 0,
      "content": "a bar magnet?\nActivity 12.2Activity 12.2Activity 12.2Activity 12.2Activity 12.2\n/square6Fix a sheet of white paper on a drawing\nboard using some adhesive material.\n/square6Place a bar magnet in the centre of it.\n/square6Sprinkle some iron filings uniformly\naround the bar magnet (Fig. 12.2). A\nsalt-sprinkler may be used for this\npurpose.\n/square6Now tap the board gently.\n/square6What do you observe?\n Figure 12.2Figure 12.2Figure 12.2Figure 12.2Figure 12.2\nIron filings near the bar magnet align\nthemselves along the field lines.\nThe iron filings arrange themselves in a pattern as shown\nFig. 12.2.  Why do the iron filings arrange in such a pattern? What does\nthis pattern demonstrate?  The magnet exerts its influence in the region\nsurrounding it.  Therefore the iron filings experience a force.  The force\nthus exerted makes iron filings to arrange in a pattern. The region\nsurrounding a magnet, in which the force of the magnet can be detected,\nis said to have a magnetic field.  The lines along which the iron filings\nalign themselves represent magnetic field lines.\nAre there other ways of obtaining magnetic field lines around a bar\nmagnet?  Yes, you can yourself draw the field lines of a bar magnet.\nActivity 12.3Activity 12.3Activity 12.3Activity 12.3Activity 12.3\n/square6Take a small compass and a bar magnet.\n/square6Place the magnet on a sheet of white paper fixed on a drawing\nboard, using some adhesive material.\n/square6Mark the boundary of the magnet.\n/square6Place the compass near the north pole of the magnet. How does\nit behave? The south pole of the needle points towards the north\npole of the magnet. The north pole of the compass is directed\naway from the north pole of the magnet.\n2024-25",
      "content_type": "text",
      "token_count": 429,
      "page_number": 2
    },
    {
      "id": "b0972bb7-a154-407b-bb68-33e14cc6562f",
      "chapter_id": "13bb0b7c-2281-46b3-af3b-86aa1be6f23e",
      "chunk_index": 1,
      "content": "--- Page 3 ---\nMagnetic Effects of Electric Current 197\nMagnetic field is a quantity that has both direction and magnitude.\nThe direction of the magnetic field is taken to be the direction in which a\nnorth pole of the compass needle moves inside it.  Therefore it is taken\nby convention that the field lines emerge from north pole and merge at\nthe south pole (note the arrows marked on the field lines in Fig. 12.4).\nInside the magnet, the direction of field lines is from its south pole to its\nnorth pole. Thus the magnetic field lines are closed curves.\nThe relative strength of the magnetic field is shown by the degree of\ncloseness of the field lines. The field is stronger, that is, the force acting\non the pole of another magnet placed is greater where the field lines are\ncrowded (see Fig. 12.4).\nNo two field-lines are found to cross each other. If they did, it would\nmean that at the point of intersection, the compass needle would point\ntowards two directions, which is not possible.\n12.2\n12.212.2 12.212.2 MA MAMA MAMAGNETIC FIELD DUE TO A CURRENTGNETIC FIELD DUE TO A CURRENTGNETIC FIELD DUE TO A CURRENTGNETIC FIELD DUE TO A CURRENTGNETIC FIELD DUE TO A CURRENT --- --C CC CCARRYING ARRYINGARRYING ARRYINGARRYING\nCONDUCTORCONDUCTORCONDUCTORCONDUCTORCONDUCTOR\nIn Activity 12.1, we have seen that an electric current through a\nmetallic conductor produces a magnetic field around it. In order to\nfind the direction of the field produced let us repeat the activity in the\nfollowing way  –\nFigure 12.3Figure 12.3Figure 12.3Figure 12.3Figure 12.3\nDrawing a magnetic field line with the help of a\ncompass needle\n/square6Mark the position of two ends of the needle.\n/square6Now move the needle to a new position\nsuch that its south pole occupies the\nposition previously occupied by its north\npole.\n/square6In this way, proceed step by step till you\nreach the south pole of the magnet as\nshown in Fig. 12.3.\n/square6Join the points marked on the paper by a\nsmooth curve.  This curve represents\na field line.\n/square6Repeat the above procedure and draw as\nmany lines as you can. Y ou will get a\npattern shown in Fig. 12.4. These lines\nrepresent the magnetic field around the\nmagnet. These are known as magnetic\nfield lines.\n/square6Observe the deflection in the compass\nneedle as you move it along a field line.\nThe deflection increases as the needle is\nmoved towards the poles.\nFigure 12.4Figure 12.4Figure 12.4Figure 12.4Figure 12.4\nField lines around a bar magnet\n2024-25",
      "content_type": "text",
      "token_count": 619,
      "page_number": 2
    },
    {
      "id": "a94a962b-2542-455d-bf5b-803051bb5752",
      "chapter_id": "13bb0b7c-2281-46b3-af3b-86aa1be6f23e",
      "chunk_index": 2,
      "content": "--- Page 4 ---\nScience198\n12.2.1 Magnetic Field due to a Current through a Straight\nConductor\nWhat determines the pattern of the magnetic field generated by a current\nthrough a conductor? Does the pattern depend on the shape of the\nconductor? We shall investigate this with an activity.\nWe shall first consider the patter n of the magnetic field ar ound a\nstraight conductor carrying current.\nActivity 12.4Activity 12.4Activity 12.4Activity 12.4Activity 12.4\n/square6Take a long straight copper wire, two or three cells of 1.5 V each, and a plug key. Connect\nall of them in series as shown in Fig. 12.5 (a).\n/square6Place the straight wire parallel to and over a compass needle.\n/square6Plug the key in the circuit.\n/square6Observe the direction of deflection of the north pole of the needle. If the current flows from\nnorth to south, as shown in Fig. 12.5 (a), the north pole of the compass needle would move\ntowards the east.\n/square6Replace the cell connections in the circuit as shown in Fig. 12.5 (b). This would result in\nthe change of the direction of current through the copper wire, that is, from south to\nnorth.\n/square6Observe the change in the dir ection of deflection of the needle. Y ou will see that now the\nneedle moves in opposite direction, that is, towards the west [Fig. 12.5 (b)]. It means that\nthe direction of magnetic field produced by the electric current is also reversed.\nFigure 12.5Figure 12.5Figure 12.5Figure 12.5Figure 12.5 A simple electric circuit in which a straight copper wire is placed parallel to and over a compass\nneedle. The deflection in the needle becomes opposite when the direction of the current is reversed.\n(a) (b)\nActivity 12.5Activity 12.5Activity 12.5Activity 12.5Activity 12.5\n/square6Take a battery (12 V), a variable resistance (or a rheostat), an\nammeter (0–5 A), a plug key, connecting wires and a long straight\nthick copper wire.\n/square6Insert the thick wire through the centre, normal to the plane of a\nrectangular cardboard.  Take care that the cardboard is fixed and\ndoes not slide up or down.\n2024-25",
      "content_type": "text",
      "token_count": 515,
      "page_number": 2
    },
    {
      "id": "63f32f10-9136-4ad0-909b-e5ad414e94ae",
      "chapter_id": "13bb0b7c-2281-46b3-af3b-86aa1be6f23e",
      "chunk_index": 3,
      "content": "--- Page 5 ---\nMagnetic Effects of Electric Current 199\nWhat happens to the deflection of the compass needle placed at a\ngiven point if the current in the copper wire is changed? To see this, vary\nthe current in the wir\ne. We find that the deflection in the needle also\nchanges. In fact, if the current is increased, the deflection also increases.\nIt indicates that the magnitude of the magnetic field produced at a given\npoint increases as the current through the wire increases.\nWhat happens to the deflection of the needle if the compass is moved\naway from the copper wire but the current through the wire remains the\nsame? To see this, now place the compass at a farther point from the\nconducting wire (say at point Q). What change do you observe? We see\nthat the deflection in the needle decreases. Thus the magnetic field\nproduced by a given current in the conductor decreases as the distance\nfrom it increases. From Fig. 12.6, it can be noticed that the concentric\ncircles representing the magnetic field around a current-carrying straight\nwire become larger and larger as we move away from it.\n12.2.2 Right-Hand Thumb Rule\nA convenient way of finding the direction of magnetic field associated\nwith a current-carrying conductor is given in Fig. 12.7.\n/square6Connect the copper wire vertically between the\npoints X and Y, as shown in Fig. 12.6 (a), in\nseries with the battery, a plug and key.\n/square6Sprinkle some iron filings uniformly on the\ncardboard. (You may use a salt sprinkler for this\npurpose.)\n/square6Keep the variable of the rheostat at a fixed\nposition and note the current through the\nammeter.\n/square6Close the key so that a current flows through\nthe wire. Ensure that the copper wire placed\nbetween the points X and Y remains vertically\nstraight.\n/square6Gently tap the cardboard a few times. Observe\nthe patter n of the ir on filings. Y ou would find\nthat the iron filings align themselves showing\na pattern of concentric circles around the\ncopper wire (Fig. 12.6).\n/square6What do these concentric circles represent?\nThey represent the magnetic field lines.\n/square6How can the direction of the magnetic field be\nfound? Place a compass at a point (say P) over\na circle. Observe the direction of the needle. The\ndirection of the north pole of the compass\nneedle would give the direction of the field lines\nproduced by the electric current through the\nstraight wire at point P . Show the dir ection by\nan arrow.\n/square6Does the direction of magnetic field lines get\nreversed if the direction of current through the\nstraight copper wire is reversed? Check it.\nFigure 12.6Figure 12.6Figure 12.6Figure 12.6Figure 12.6\n(a) A pattern of concentric circles indicating\nthe field lines of a magnetic field around a\nstraight conducting wire. The arrows in the\ncircles show the direction of the field lines.\n(b) A close up of the pattern obtained.\n(a)\n(b)\nVariable\nresistance\n2024-25",
      "content_type": "text",
      "token_count": 724,
      "page_number": 2
    },
    {
      "id": "3771d083-5c40-498e-9758-2eba85fa9713",
      "chapter_id": "13bb0b7c-2281-46b3-af3b-86aa1be6f23e",
      "chunk_index": 4,
      "content": "--- Page 6 ---\nScience200\nImagine that you are holding a current-carrying straight\nconductor in your right hand such that the thumb points towards\nthe direction of current. Then your fingers will wrap around the\nconductor in the direction of the field lines of the magnetic field, as\nshown in Fig. 12.7. This is known as the right-hand thumb rule*.\nExample 12.1\nA current through a horizontal power line flows in east to west\ndirection. What is the direction of magnetic field at a point directly\nbelow it and at a point directly above it?\nSolution\nThe current is in the east-west direction. Applying the right-hand\nthumb rule, we get that the magnetic field (at any point below or\nabove the wire) turns clockwise in a plane perpendicular to the wire,\nwhen viewed from the east end, and anti-clockwise, when viewed\nfrom the west end.\nFigure 12.7Figure 12.7Figure 12.7Figure 12.7Figure 12.7\nRight-hand thumb rule\n* This rule is also called Maxwell’s corkscrew rule. If we consider ourselves driving a\ncorkscrew in the direction of the current, then the direction of the rotation of\ncorkscrew is the direction of the magnetic field.\n12.2.3 Magnetic Field due to a Current through a\nCircular Loop\nWe have so far observed the pattern of the magnetic field lines\nproduced around a current-carrying straight wire. Suppose\nthis straight wire is bent in the form of a circular loop and a\ncurrent is passed through it. How would the magnetic field\nlines look like? We know that the magnetic field pr\noduced\nby a current-carrying straight wire depends inversely on the\ndistance from it. Similarly at every point of a current-carrying\ncircular loop, the concentric circles representing the magnetic\nfield around it would become larger and larger as we move\naway from the wire (Fig. 12.8). By the time we reach at the\ncentre of the circular loop, the arcs of these big circles would\nappear as straight lines. Every point on the wire carrying\ncurrent would give rise to the magnetic field appearing as\nstraight lines at the center of the loop. By applying the right\nhand rule, it is easy to check that every section of the wire\ncontributes to the magnetic field lines in the same direction\nwithin the loop.\nFigure 12.8Figure 12.8Figure 12.8Figure 12.8Figure 12.8\nMagnetic field lines of the field\nproduced by a current-carrying\ncircular loop\n?\nQUESTIONS",
      "content_type": "example",
      "token_count": 585,
      "page_number": 6
    },
    {
      "id": "2ea73baf-3c75-4af2-b24f-a547d5f0fc51",
      "chapter_id": "3a8102b4-21df-45de-865e-97531480a78c",
      "chunk_index": 0,
      "content": "2024-25\n\n--- Page 7 ---\nMagnetic Effects of Electric Current 201\nWe know that the magnetic field pr oduced by a curr ent-carrying\nwire at a given point depends directly on the current passing through it.\nTherefore, if there is a circular coil having n turns, the field produced is\nn times as large as that produced by a single turn. This is because the\ncurrent in each circular turn has the same direction, and the field due to\neach turn then just adds up.\nActivity 12.6Activity 12.6Activity 12.6Activity 12.6Activity 12.6\n/square6Take a rectangular cardboard having two holes.\nInsert a circular coil having large number of turns\nthrough them, normal to the plane of the cardboard.\n/square6Connect the ends of the coil in series with a battery,\na key and a rheostat, as shown in Fig. 12.9.\n/square6Sprinkle iron filings uniformly on the cardboard.\n/square6Plug the key.\n/square6Tap the cardboard gently a few times. Note the\npattern of the iron filings that emerges on the\ncardboard.\nFigure 12.9Figure 12.9Figure 12.9Figure 12.9Figure 12.9\nMagnetic field produced by a current-\ncarrying circular coil.\n12.2.4 Magnetic Field due to a Current in a Solenoid\nA coil of many circular turns of insulated copper wire wrapped\nclosely in the shape of a cylinder is called a solenoid. The pattern\nof the magnetic field lines around a current-carrying solenoid is\nshown in Fig. 12.10. Compare the pattern of the field with the\nmagnetic field around a bar magnet (Fig. 12.4). Do they look\nsimilar? Yes, they ar\ne similar. In fact, one end of the solenoid\nbehaves as a magnetic north pole, while the other behaves as the\nsouth pole. The field lines inside the solenoid are in the form of\nparallel straight lines. This indicates that the magnetic field is\nthe same at all points inside the solenoid. That is, the field is\nuniform inside the solenoid.\nA strong magnetic field produced inside a solenoid can be\nused to magnetise a piece of magnetic material, like soft iron,\nwhen placed inside the coil (Fig. 12.11). The magnet so formed is\ncalled an electromagnet.\nFigure 12.10Figure 12.10Figure 12.10Figure 12.10Figure 12.10\nField lines of the magnetic field\nthrough and around a current\ncarrying solenoid.\nFigure 12.11Figure 12.11Figure 12.11Figure 12.11Figure 12.11\nA current-carrying solenoid coil\nis used to magnetise steel rod\ninside it – an electromagnet.\nQUESTIONS\n?",
      "content_type": "exercise",
      "token_count": 589,
      "page_number": 7
    },
    {
      "id": "925193b8-c97e-48aa-bd43-db1918849a8c",
      "chapter_id": "b7226800-592b-46ea-9569-6e07b5a09be1",
      "chunk_index": 0,
      "content": "the plane of the table. Let the current\npass through the loop clockwise. Apply\nthe right-hand rule to find out the\ndirection of the magnetic field inside\nand outside the loop.",
      "content_type": "text",
      "token_count": 43,
      "page_number": 8
    },
    {
      "id": "e182e3e6-8c8a-4c0c-a601-adb7e15fbb87",
      "chapter_id": "6eaf6400-d36b-4b91-89fd-1f38c3c7b6bc",
      "chunk_index": 0,
      "content": "uniform. Draw a diagram to represent it.\n2024-25\n\n--- Page 8 ---\nScience202\n12.3\n12.312.3 12.312.3 FORCE ON A CURRENTFORCE ON A CURRENTFORCE ON A CURRENTFORCE ON A CURRENTFORCE ON A CURRENT --- --C CC CCARRYING CONDUCTORARRYING CONDUCTORARRYING CONDUCTORARRYING CONDUCTORARRYING CONDUCTOR\nIN A MAGNETIC FIELDIN A MAGNETIC FIELDIN A MAGNETIC FIELDIN A MAGNETIC FIELDIN A MAGNETIC FIELD\nWe have lear nt that an electric current flowing through a conductor\nproduces a magnetic field. The field so produced exerts a force on a\nmagnet placed in the vicinity of the conductor. French scientist Andre\nMarie Ampere (1775–1836) suggested that the magnet must also exert\nan equal and opposite force on the current-carrying conductor. The force\ndue to a magnetic field acting on a current-carrying conductor can be\ndemonstrated through the following activity.",
      "content_type": "text",
      "token_count": 212,
      "page_number": 8
    },
    {
      "id": "3311ec81-aa38-4e9d-b652-767b7daf1606",
      "chapter_id": "40056928-0921-47f6-b08f-980143a62364",
      "chunk_index": 0,
      "content": "The magnetic field inside a long straight solenoid-carrying current\n(a) is zero.\n(b) decreases as we move towards its end.\n(c) increases as we move towards its end.\n(d) is the same at all points.\nActivity 12.7Activity 12.7Activity 12.7Activity 12.7Activity 12.7\n/square6Take a small aluminium rod AB (of about 5 cm). Using\ntwo connecting wires suspend it horizontally from a\nstand, as shown in Fig. 12.12.\n/square6Place a strong horse-shoe magnet in such a way that\nthe rod lies between the two poles with the magnetic\nfield directed upwards. For this put the north pole of\nthe magnet vertically below and south pole vertically\nabove the aluminium rod (Fig. 12.12).\n/square6Connect the aluminium rod in series with a battery,\na key and a rheostat.\n/square6Now pass a current through the aluminium rod from\nend B to end A.\n/square6What do you observe? It is observed that the rod is\ndisplaced towards the left. You will notice that the r od\ngets displaced.\n/square6Reverse the direction of current flowing through the\nrod and observe the direction of its displacement. It is\nnow towards the right.\nWhy does the rod get displaced?\nFigure 12.12Figure 12.12Figure 12.12Figure 12.12Figure 12.12\nA current-carrying rod, AB, experiences\na force perpendicular to its length and\nthe magnetic field. Support for the\nmagnet is not shown here, for simplicity.\nThe displacement of the rod in the above activity suggests that a\nforce is exerted on the current-carrying aluminium rod when it is placed\nin a magnetic field. It also suggests that the direction of force is also\nreversed when the direction of current through the conductor is reversed.\nNow change the direction of field to vertically downwards by\ninterchanging the two poles of the magnet. It is once again observed that\n2024-25",
      "content_type": "text",
      "token_count": 444,
      "page_number": 8
    },
    {
      "id": "3bf3ad8e-2b10-4ab8-89f3-133aacf5302d",
      "chapter_id": "40056928-0921-47f6-b08f-980143a62364",
      "chunk_index": 1,
      "content": "--- Page 9 ---\nMagnetic Effects of Electric Current 203\nthe direction of force acting on the current-carrying rod gets reversed. It\nshows that the direction of the force on the conductor depends upon the\ndirection of current and the direction of the magnetic field. Experiments\nhave shown that the displacement of the rod is largest (or the magnitude\nof the force is the highest) when the direction of current is at right angles\nto the direction of the magnetic field. In such a condition we can use a\nsimple rule to find the direction of the force on the conductor.\nIn Activity 12.7, we considered the\ndirection of the current and that of the magnetic\nfield perpendicular to each other and found\nthat the force is perpendicular to both of them.\nThe three directions can be illustrated through\na simple rule, called Fleming’s left-hand rule.\nAccording to this rule, stretch the thumb,\nforefinger and middle finger of your left hand\nsuch that they are mutually perpendicular\n(Fig. 12.13). If the first finger points in the\ndirection of magnetic field and the second\nfinger in the direction of current, then the\nthumb will point in the direction of motion or\nthe force acting on the conductor.\nDevices that use current-carrying conductors and magnetic fields\ninclude electric motor, electric generator, loudspeakers, micr\nophones\nand measuring instruments.\nExample 12.2\nAn electron enters a magnetic field at right angles to it, as shown\nin Fig. 12.14. The direction of force acting on the electron will be\n(a) to the right.\n(b) to the left.\n(c) out of the page.\n(d) into the page.\nSolution\nAnswer is option (d). The direction of force is perpendicular to the\ndirection of magnetic field and current as given by Fleming’s left hand\nrule. Recall that the direction of current is taken opposite to the direction\nof motion of electrons. The force is therefore directed into the page.\nFigure 12.13Figure 12.13Figure 12.13Figure 12.13Figure 12.13\nFleming’s left-hand rule\nFigure 12.14Figure 12.14Figure 12.14Figure 12.14Figure 12.14\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 509,
      "page_number": 10
    },
    {
      "id": "fdacd357-d77b-4173-8af7-f2324eec7a1f",
      "chapter_id": "a2be86af-60d2-4e37-b113-25ef490d6f07",
      "chunk_index": 0,
      "content": "freely in a magnetic field? (Ther e may be mor e than one corr ect answer.)\n(a) mass (b) speed\n(c) velocity (d) momentum\n2024-25\n\n--- Page 10 ---\nScience204\n12.4 DOMESTIC ELECTRIC CIRCUITS12.4 DOMESTIC ELECTRIC CIRCUITS12.4 DOMESTIC ELECTRIC CIRCUITS12.4 DOMESTIC ELECTRIC CIRCUITS12.4 DOMESTIC ELECTRIC CIRCUITS\nIn our homes, we receive supply of electric power through a main supply\n(also called mains), either supported through overhead electric poles or\nby underground cables. One of the wires in this supply, usually with\nred insulation cover, is called live wire (or positive). Another wire, with\nblack insulation, is called neutral wire (or negative). In our country, the\npotential difference between the two is 220 V.\nAt the meter-board in the house, these wires pass into an electricity\nmeter through a main fuse. Through the main switch they are connected\nto the line wires in the house. These wires supply electricity to separate\ncircuits within the house. Often, two separate circuits are used, one of\n15 A current rating for appliances with higher power ratings such as\ngeysers, air coolers, etc. The other circuit is of 5 A current rating for\nbulbs, fans, etc. The earth wire, which has insulation of green colour, is\nusually connected to a metal plate deep in the earth near the house.\nThis is used as a safety measure, especially for those appliances that\nhave a metallic body, for example, electric pr\ness, toaster, table fan,\nrefrigerator, etc. The metallic body is connected to the earth wire, which\nprovides a low-resistance conducting path for the current. Thus, it\nensures that any leakage of current to the metallic body of the appliance\nkeeps its potential to that of the earth, and the user may not get a severe\nelectric shock.",
      "content_type": "example",
      "token_count": 438,
      "page_number": 10
    },
    {
      "id": "fa259772-a62f-4c44-af95-fc8f312eeb67",
      "chapter_id": "dedbe170-456e-4036-98a1-6e4e5352097a",
      "chunk_index": 0,
      "content": "affected if (i) current in rod AB is increased; (ii) a stronger horse-shoe\nmagnet is used; and (iii) length of the rod AB is increased?",
      "content_type": "text",
      "token_count": 33,
      "page_number": 10
    },
    {
      "id": "8f6001c5-f69b-45eb-ae6b-0bb19c07d5b0",
      "chapter_id": "a0bf33e8-116d-409d-a491-34a14bfb1617",
      "chunk_index": 0,
      "content": "deflected towards north by a magnetic field. The direction of magnetic\nfield is\n(a) towards south (b) towards east\n(c) downward (d) upward\nMagnetism in medicine\nAn electric current always produces a magnetic field. Even weak ion currents that\ntravel along the nerve cells in our body produce magnetic fields. When we touch\nsomething, our nerves carry an electric impulse to the muscles we need to use. This\nimpulse produces a temporary magnetic field. These fields are very weak and are\nabout one-billionth of the earth’s magnetic field. Two main organs in the human\nbody where the magnetic field produced is significant, are the heart and the brain. The\nmagnetic field inside the body forms the basis of obtaining the images of different body\nparts. This is done using a technique called Magnetic Resonance Imaging (MRI). Analysis\nof these images helps in medical diagnosis. Magnetism has, thus, got important uses\nin medicine.\nMore to Know!\n2024-25\n\n--- Page 11 ---\nMagnetic Effects of Electric Current 205\nFigure 12.15Figure 12.15Figure 12.15Figure 12.15Figure 12.15  A schematic diagram of one of the common domestic circuits\nQUESTIONS\n?\nFigure 12.15 gives a schematic diagram of one of the common\ndomestic circuits. In each separate circuit, different appliances can be\nconnected across the live and neutral wires. Each appliance has a\nseparate switch to ‘ON’/‘OFF’ the flow of current through it. In order\nthat each appliance has equal potential difference, they are connected\nparallel to each other.\nElectric fuse is an important component of all domestic circuits. We\nhave already studied the principle and working of a fuse in the previous\nchapter (see Section 11.7). A fuse in a circuit prevents damage to the\nappliances and the circuit due to overloading. Overloading can occur\nwhen the live wire and the neutral wire come into direct contact. (This\noccurs when the insulation of wires is damaged or there is a fault in the\nappliance.) In such a situation, the current in the circuit abruptly\nincreases. This is called short-circuiting. The use of an electric fuse\nprevents the electric circuit and the appliance from a possible damage\nby stopping the flow of unduly high electric current. The Joule heating\nthat takes place in the fuse melts it to break the electric circuit.\nOverloading can also occur due to an accidental hike in the supply\nvoltage. Sometimes overloading is caused by connecting too many\nappliances to a single socket.",
      "content_type": "exercise",
      "token_count": 612,
      "page_number": 11
    },
    {
      "id": "df7a6982-61eb-4efb-9eba-82e79d753f85",
      "chapter_id": "d7624094-cb92-4885-b041-89d18207b64c",
      "chunk_index": 0,
      "content": "appliances.",
      "content_type": "text",
      "token_count": 2,
      "page_number": 11
    },
    {
      "id": "d5e01232-098e-4a1d-a3ff-8126b7c3505b",
      "chapter_id": "c1fb424c-b910-4633-966f-2cc1c26f655f",
      "chunk_index": 0,
      "content": "circuit (220 V) that has a current rating of 5 A. What result do you\nexpect? Explain.",
      "content_type": "text",
      "token_count": 21,
      "page_number": 11
    },
    {
      "id": "3d94f8c2-1921-4250-b12b-56f1aaa05b68",
      "chapter_id": "f02e3ef4-06c8-4bb5-bdb3-5b5208ed5ecf",
      "chunk_index": 0,
      "content": "electric circuits?\n2024-25\n\n--- Page 12 ---\nScience206\nWhat you have learnt\n/square6A compass needle is a small magnet. Its one end, which points towards north, is\ncalled a north pole, and the other end, which points towards south, is called a\nsouth pole.\n/square6A magnetic field exists in the region surrounding a magnet, in which the force of\nthe magnet can be detected.\n/square6Field lines are used to represent a magnetic field. A field line is the path along\nwhich a hypothetical free north pole would tend to move. The direction of the\nmagnetic field at a point is given by the direction that a north pole placed at that\npoint would take. Field lines are shown closer together where the magnetic field is\ngreater.\n/square6A metallic wire carrying an electric current has associated with it a magnetic field.\nThe field lines about the wire consist of a series of concentric circles whose direction\nis given by the right-hand rule.\n/square6The pattern of the magnetic field around a conductor due to an electric current\nflowing through it depends on the shape of the conductor. The magnetic field of a\nsolenoid carrying a current is similar to that of a bar magnet.\n/square6An electromagnet consists of a core of soft iron wrapped around with a coil of\ninsulated copper wire.\n/square6A current-carrying conductor when placed in a magnetic field experiences a force.\nIf the direction of the field and that of the current are mutually perpendicular to\neach other, then the force acting on the conductor will be perpendicular to both\nand will be given by Fleming’s left-hand rule.\n/square6In our houses we receive AC electric power of 220 V with a frequency of 50 Hz. One\nof the wires in this supply is with red insulation, called live wire. The other one is of\nblack insulation, which is a neutral wire. The potential difference between the two\nis 220 V. The third is the earth wire that has green insulation and this is connected\nto a metallic body deep inside earth. It is used as a safety measure to ensure that\nany leakage of current to a metallic body does not give any severe shock to a user.\n/square6Fuse is the most important safety device, used for protecting the circuits due to\nshort-circuiting or overloading of the circuits.\n2024-25\n\n--- Page 13 ---\nMagnetic Effects of Electric Current 207\nEXERCISES",
      "content_type": "exercise",
      "token_count": 579,
      "page_number": 12
    },
    {
      "id": "bdec6857-ec95-4a56-ba1d-aa29e06d6177",
      "chapter_id": "2ba15c68-dba5-4ca6-bc3b-c9eb856480e6",
      "chunk_index": 0,
      "content": "straight wire?\n(a) The field consists of straight lines perpendicular to the wire.\n(b)  The field consists of straight lines parallel to the wire.\n(c) The field consists of radial lines originating from the wire.\n(d) The field consists of concentric circles centred on the wire.",
      "content_type": "text",
      "token_count": 69,
      "page_number": 12
    },
    {
      "id": "c97ad651-37bb-4697-91b1-551524611272",
      "chapter_id": "ec252e08-be5a-408d-a389-98929a76edcb",
      "chunk_index": 0,
      "content": "(a) reduces substantially.\n(b) does not change.\n(c) increases heavily.\n(d) vary continuously.",
      "content_type": "text",
      "token_count": 23,
      "page_number": 12
    },
    {
      "id": "ad285089-7507-4a1d-837b-cb5fed150296",
      "chapter_id": "78e69592-6041-4d41-8269-b718718a3e5d",
      "chunk_index": 0,
      "content": "(a) The field at the centre of a long circular coil carrying current will be\nparallel straight lines.\n(b) A wire with a green insulation is usually the live wire of an electric supply.",
      "content_type": "text",
      "token_count": 46,
      "page_number": 12
    },
    {
      "id": "a3131951-4ea2-4c2c-ad96-a6be7e1a7af3",
      "chapter_id": "9c91f9e3-361e-49a5-8c8b-82c71f18bfad",
      "chunk_index": 0,
      "content": "field largest?",
      "content_type": "text",
      "token_count": 3,
      "page_number": 12
    },
    {
      "id": "47502bab-8886-488d-bc80-558c2c83bb60",
      "chapter_id": "c76ae1b4-15d3-4d67-875f-e74ee831fa7a",
      "chunk_index": 0,
      "content": "beam, moving horizontally from back wall towards the front wall, is deflected by a\nstrong magnetic field to your right side. What is the direction of magnetic field?",
      "content_type": "text",
      "token_count": 41,
      "page_number": 12
    },
    {
      "id": "cd1511e6-cb4e-4e9f-a28c-880f120fa459",
      "chapter_id": "541ee2c4-c439-44b2-b7f7-2f2d379dadca",
      "chunk_index": 0,
      "content": "straight conductor-carrying current, (ii) for\nce experienced by a current-carrying\nstraight conductor placed in a magnetic field which is perpendicular to it, and\n(iii) current induced in a coil due to its rotation in a magnetic field.",
      "content_type": "text",
      "token_count": 58,
      "page_number": 13
    },
    {
      "id": "17a2778f-4775-4cdf-aabf-1ecbb133bd59",
      "chapter_id": "18bf6a3a-d874-4eb8-bd21-8f2015b952be",
      "chunk_index": 0,
      "content": "appliances?\n2024-25",
      "content_type": "text",
      "token_count": 4,
      "page_number": 13
    }
  ]
}