{
  "textbook": {
    "id": "c4ee25ef-917b-4494-b621-674698d0a149",
    "file_name": "Class X Science NCERT - Ch 04 - (g) + 2O2 (g) → CO2 (g) + 2H2O (g) (1.17).pdf",
    "title": "(g) + 2O2 (g) → CO2 (g) + 2H2O (g) (1.17)",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 16,
    "file_size_mb": 3.37398624420166,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:16.343804",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 04 - (g) + 2O2 (g) → CO2 (g) + 2H2O (g) (1.17).pdf"
  },
  "chapters": [
    {
      "id": "7884515a-d851-4c4a-9ad6-9fc6e77e68d7",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 2,
      "title": "2. Write the balanced equation for the following chemical r eactions.",
      "topics": [],
      "start_page": 6,
      "end_page": 6,
      "content": "(i) Hydrogen + Chlorine →  Hydrogen chloride\n(ii) Barium chloride + Aluminium sulphate →   Barium sulphate +\n     Aluminium chloride\n(iii) Sodium + Water  →  Sodium hydroxide + Hydr ogen"
    },
    {
      "id": "ed076433-6aad-4118-8eeb-8df230805b33",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 3,
      "title": "3. Write a balanced chemical equation with state symbols for the",
      "topics": [],
      "start_page": 6,
      "end_page": 10,
      "content": "following reactions.\n(i) Solutions of barium chloride and sodium sulphate in water react\nto give insoluble barium sulphate and the solution of sodium\nchloride.\n(ii) Sodium hydroxide solution (in water) reacts with hydrochloric\nacid solution (in water) to produce sodium chloride solution and\nwater.\n?\n2024-25\n\n--- Page 7 ---\nChemical Reactions and Equations 7\nLet us discuss some more examples of combination reactions.\n(i) Burning of coal\nC(s) + O2(g)  →  CO2(g) (1.15)\n(ii) Formation of water from H2(g) and O2(g)\n2H2(g) + O2(g) →  2H2O(l) (1.16)\nIn simple language we can say that when two or more substances\n(elements or compounds) combine to form a single product, the reactions\nare called combination reactions.\nIn Activity 1.4, we also observed that a large amount of heat is evolved.\nThis makes the reaction mixture warm. Reactions in which heat is\nreleased along with the formation of products are called exothermic\nchemical reactions.\nOther examples of exothermic reactions are –\n(i) Burning of natural gas\nCH4(g) + 2O2 (g) →  CO2 (g) + 2H2O (g) (1.17)\n(ii) Do you know that respiration is an exothermic process?\nWe all know that we need ener gy to stay alive. We get this energy\nfrom the food we eat. During digestion, food is broken down into simpler\nsubstances. For example, rice, potatoes and bread contain\ncarbohydrates. These carbohydrates are broken down to form glucose.\nThis glucose combines with oxygen in the cells of our body and provides\nenergy. The special name of this reaction is respiration, the process of\nwhich you will study in Chapter 6.\nC6H12O6(aq) + 6O2(aq) →  6CO2(aq) + 6H2O(l) + energy (1.18)\n(Glucose)\n(iii) The decomposition of vegetable matter into compost is also an\nexample of an exothermic reaction.\nIdentify the type of the reaction taking place in Activity 1.1, where\nheat is given out along with the formation of a single product.\nDo You Know?\nA solution of slaked lime produced by the reaction 1.13 is used for whitewashing\nwalls. Calcium hydroxide reacts slowly with the carbon dioxide in air to form a thin\nlayer of calcium carbonate on the walls. Calcium carbonate is  formed after two to\nthree days of whitewashing and gives a shiny finish to the walls. It is interesting to note\nthat the chemical formula for marble is also CaCO3.\nCa(OH)2(aq) + CO2(g) → CaCO3(s)  + H2O(l) (1.14)\n(Calcium (Calcium\nhydroxide) carbonate)\n2024-25\n\n--- Page 8 ---\nScience8 88 88\nFigure 1.5\nHeating of lead nitrate and\nemission of nitrogen dioxide\nFigure 1.4\nCorrect way of heating\nthe boiling tube\ncontaining crystals\nof ferrous sulphate\nand of smelling the\nodour\nActivity 1.6Activity 1.6Activity 1.6Activity 1.6Activity 1.6\nn Take about 2 g lead nitrate powder in a boiling\ntube.\nn Hold the boiling tube with a pair of tongs and\nheat it over a flame, as shown in Fig. 1.5.\nn What do you observe? Note down the change,\nif any.\nYou will observe the emission of brown fumes.\nThese fumes are of nitrogen dioxide (NO 2). The\nreaction that takes place is –\nActivity 1.5Activity 1.5Activity 1.5Activity 1.5Activity 1.5\nn Take about 2 g ferrous sulphate crystals\nin a dry boiling tube.\nn Note the colour of the ferrous sulphate\ncrystals.\nn Heat the boiling tube over the  flame  of\na burner or spirit lamp as shown in\nFig. 1.4.\nn Observe the colour of the crystals after\nheating.\nHave you noticed that the green colour of the ferrous sulphate crystals\nhas changed? You can also smell the characteristic odour of burning\nsulphur.\n2FeSO4(s) \nHeat →   Fe2O3(s)  +  SO2(g)  + SO3(g) (1.19)\n(Ferrous sulphate)   (Ferric oxide)\nIn this reaction you can observe that a single reactant breaks down\nto give simpler products. This is a decomposition reaction. Ferrous\nsulphate crystals (FeSO4. 7H2O) lose water when heated and the colour\nof the crystals changes. It then decomposes to ferric oxide (Fe 2O3),\nsulphur dioxide (SO2) and sulphur trioxide (SO3). Ferric oxide is a solid,\nwhile SO2 and SO3 are gases.\nDecomposition of calcium carbonate to calcium oxide and carbon\ndioxide on heating is an important decomposition reaction used in\nvarious industries. Calcium oxide is called lime or quick lime. It has\nmany uses – one is in the manufacture of cement. When a decomposition\nreaction is carried out by heating, it is called thermal decomposition.\nCaCO3(s) \nHeat →   CaO(s)    +   CO2(g) (1.20)\n(Limestone)    (Quick lime)\nAnother example of a thermal decomposition reaction is given\nin Activity 1.6.\n1.2.2 Decomposition Reaction\n2024-25\n\n--- Page 9 ---\nChemical Reactions and Equations 9 9999\nActivity 1.7Activity 1.7Activity 1.7Activity 1.7Activity 1.7\nActivity 1.8Activity 1.8Activity 1.8Activity 1.8Activity 1.8\nn Take about 2 g silver chloride in a china dish.\nn What is its colour?\nn Place this china dish in sunlight for some time\n(Fig. 1.7).\nn Observe the colour of the silver chloride after some\ntime.\nFigure 1.7\nSilver chloride turns grey\nin sunlight to form silver\nmetal\nYou will see that white silver chloride turns grey in sunlight. This is\ndue to the decomposition of silver chloride into silver and chlorine by\nlight.\n2AgCl(s) \nSunlight → 2Ag(s) + Cl2(g) (1.22)\nn Take a plastic mug. Drill two holes at its\nbase and fit rubber stoppers in these holes.\nInsert carbon electrodes in these rubber\nstoppers as shown in Fig. 1.6.\nn Connect these electrodes to a 6 volt\nbattery.\nn Fill the mug with water such that the\nelectrodes are immersed. Add a few drops\nof dilute sulphuric acid to the water.\nn Take two test tubes filled with water and\ninvert them over the two carbon electrodes.\nn Switch on the current and leave the\napparatus undisturbed for some time.\nn You will observe the formation of bubbles\nat both the electrodes. These bubbles displace water in the\ntest tubes.\nn Is the volume of the gas collected the same in both the test tubes?\nn Once the test tubes are filled with the respective gases, remove\nthem carefully.\nn Test these gases one by one by bringing a burning candle close\nto the mouth of the test tubes.\nCAUTION: This step must be performed carefully by the teacher.\nn What happens in each case?\nn Which gas is present in each test tube?\nFigure 1.6\nElectrolysis of water\n2Pb(NO3)2(s) Heat →  2PbO(s) + 4NO2(g)  +  O2(g) (1.21)\n(Lead nitrate)       (Lead oxide) (Nitrogen      (Oxygen)\ndioxide)\nLet us perform some more decomposition reactions as given in\nActivities 1.7 and 1.8.\n2024-25\n\n--- Page 10 ---\nScience10 1010 1010\nFigure 1.8\n(a) Iron nails dipped in copper sulphate solution\n?\nQUESTIONS"
    },
    {
      "id": "1a2cf08b-f847-4cd9-8d3b-91db30e9efcb",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 4,
      "title": "1. A solution of a substance ‘X’ is used for whitewashing.",
      "topics": [],
      "start_page": 10,
      "end_page": 10,
      "content": "(i) Name the substance ‘X’ and write its formula.\n(ii) Write the reaction of the substance ‘X’ named in (i) above with\nwater."
    },
    {
      "id": "798d6d96-de0a-4656-8805-9f8da0cb3b8a",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 5,
      "title": "2. Why is the amount of gas collected in one of the test tubes in Activity",
      "topics": [],
      "start_page": 10,
      "end_page": 12,
      "content": "1.7 double of the amount collected in the other? Name this gas.\n1.2.3  Displacement Reaction\nActivity 1.9Activity 1.9Activity 1.9Activity 1.9Activity 1.9\nn Take three iron nails and clean them by\nrubbing with sand paper.\nn Take two test tubes marked as (A) and\n(B). In each test tube, take about 10 mL\ncopper sulphate solution.\nn Tie two iron nails with a thread and\nimmerse them carefully in the copper\nsulphate solution in test tube B for\nabout 20 minutes [Fig. 1.8 (a)]. Keep one\niron nail aside for comparison.\nn After 20 minutes, take out the iron nails\nfrom the copper sulphate solution.\nn Compare the intensity of the blue colour\nof copper sulphate solutions in test tubes\n(A) and (B) [Fig. 1.8 (b)].\nn Also, compare the colour of the iron nails\ndipped in the copper sulphate solution\nwith the one kept aside [Fig. 1.8 (b)].\nTake about 2 g barium hydroxide in a test tube. Add 1 g of ammonium chloride and mix\nwith the help of a glass rod. Touch the bottom of the test tube with your palm. What do you\nfeel? Is this an exothermic or endothermic reaction?\nCarry out the following Activity\nSilver bromide also behaves in the same way.\n2AgBr(s) Sunlight → 2Ag(s) + Br2(g) (1.23)\nThe above reactions are used in black and white photography.\nWhat form of energy is causing these decomposition reactions?\nWe have seen that the decomposition reactions require energy either\nin the form of heat, light or electricity for breaking down the reactants.\nReactions in which energy is absorbed are known as endothermic\nreactions.\n2024-25\n\n--- Page 11 ---\nChemical Reactions and Equations 11\nWhy does the iron nail become brownish in colour and the blue colour\nof copper sulphate solution fades?\nThe following chemical reaction takes place in this Activity–\nFe(s) + CuSO4(aq) → FeSO4(aq)    +   Cu(s) (1.24)\n        (Copper sulphate) (Iron sulphate)\nIn this reaction, iron has displaced or removed another element,\ncopper, fr om copper sulphate solution. This r eaction is known as\ndisplacement reaction.\nOther examples of displacement reactions are\nZn(s) + CuSO4(aq)  → ZnSO4(aq)   +     Cu(s) (1.25)\n     (Copper sulphate) (Zinc sulphate)\nPb(s) + CuCl2(aq)   → PbCl2(aq)     +     Cu(s) (1.26)\n      (Copper chloride) (Lead chloride)\nZinc and lead are more reactive elements than copper. They displace\ncopper from its compounds.\n1.2.4 Double Displacement Reaction\nActivity 1.10Activity 1.10Activity 1.10Activity 1.10Activity 1.10\n/square6Take about 3 mL of sodium sulphate\nsolution in a test tube.\n/square6In another test tube, take about 3 mL of\nbarium chloride solution.\n/square6Mix the two solutions (Fig. 1.9).\n/square6What do you observe?\nFigure 1.9Figure 1.9Figure 1.9Figure 1.9Figure 1.9\nFormation of barium\nsulphate and sodium\nchloride\nYou will observe that a white substance, which is\ninsoluble in water, is formed. This insoluble substance\nformed is known as a precipitate. Any reaction that\nproduces a precipitate can be called a precipitation reaction.\nNa2SO4(aq) + BaCl2(aq) →  BaSO4(s) + 2NaCl(aq) (1.27)\n(Sodium (Barium (Barium (Sodium\nsulphate) chloride) sulphate) chloride)\nFigure 1.8 Figure 1.8 Figure 1.8 Figure 1.8 Figure 1.8 (b) Iron nails and copper sulphate solutions compared before and after the experiment\n2024-25\n\n--- Page 12 ---\nScience12\n1.2.5 Oxidation and Reduction\nActivity 1.11Activity 1.11Activity 1.11Activity 1.11Activity 1.11\n/square6Heat a china dish containing about 1 g\ncopper powder (Fig. 1.10).\n/square6What do you observe?\nFigure 1.10Figure 1.10Figure 1.10Figure 1.10Figure 1.10\nOxidation of copper to\ncopper oxide\nThe surface of copper powder becomes coated with\nblack copper(II) oxide. Why has this black\nsubstance formed?\nThis is because oxygen is added to copper and\ncopper oxide is formed.\n2Cu + O2  \nHeat →  2CuO (1.28)\nIf hydrogen gas is passed over this heated material (CuO), the black\ncoating on the surface turns brown as the reverse reaction takes place\nand copper is obtained.\nCuO +H Cu+H O2 2\nHea\nt →   (1.29)\nIf a substance gains oxygen during a reaction, it is said to be oxidised.\nIf a substance loses oxygen during a reaction, it is said to be reduced.\nDuring this reaction (1.29), the copper(II) oxide is losing oxygen and\nis being reduced. The hydrogen is gaining oxygen and is being oxidised.\nIn other words, one reactant gets oxidised while the other gets reduced\nduring a reaction. Such reactions are called oxidation-reduction reactions\nor redox reactions.\n(1.30)\nSome other examples of redox reactions are:\nZnO + C → + Zn CO (1.31)\nMnO HCl MnCl H O Cl2 2 2 24 2+ → + + (1.32)\nRecall Activity 1.2Recall Activity 1.2Recall Activity 1.2Recall Activity 1.2Recall Activity 1.2 , where you have mixed the solutions of lead(II) nitrate\nand potassium iodide.\n(i) What was the colour of the precipitate formed? Can you name the compound\nprecipitated?\n(ii) Write the balanced chemical equation for this reaction.\n(iii) Is this also a double displacement reaction?\nWhat causes this? The  white precipitate of BaSO4 is formed by the\nreaction of \n2–\n4SO  and Ba2+. The other product formed is sodium chloride\nwhich remains in the solution. Such reactions in which there is an\nexchange of ions between the reactants are called double displacement\nreactions.\n2024-25\n\n--- Page 13 ---\nChemical Reactions and Equations 13\nIn reaction (1.31) carbon is oxidised to CO and ZnO is reduced to Zn.\nIn reaction (1.32) HCl is oxidised to Cl2 whereas MnO2 is reduced to MnCl2.\nFrom the above examples we can say that if a substance gains oxygen\nor loses hydrogen during a reaction, it is oxidised. If a substance loses\noxygen or gains hydrogen during a reaction, it is reduced.\nQUESTIONS\n?"
    },
    {
      "id": "b6c08389-f19d-4e4f-907e-bc5562b8f34f",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 6,
      "title": "1. Why does the colour of copper sulphate solution change when",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "an iron nail is dipped in it?"
    },
    {
      "id": "7af937cf-2c0b-4b71-93a4-7d6e3b0b3622",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 7,
      "title": "2. Give an example of a double displacement reaction other than",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "the one given in Activity 1.10."
    },
    {
      "id": "3a0d967f-8ef9-4aaf-8034-5633baa3a107",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 8,
      "title": "3. Identify the substances that are oxidised and the substances",
      "topics": [],
      "start_page": 12,
      "end_page": 14,
      "content": "that are reduced in the following reactions.\n(i) 4Na(s) + O 2(g) →  2Na2O(s)\n(ii) CuO(s) + H2(g) →  Cu(s) + H2O(l)\n1.3\n1.31.3 1.31.3 HA HAHA HAHAVE YOU OBSERVED THE EFFECTS OF OVE YOU OBSERVED THE EFFECTS OF OVE YOU OBSERVED THE EFFECTS OF OVE YOU OBSERVED THE EFFECTS OF OVE YOU OBSERVED THE EFFECTS OF O XID XIDXID XIDXIDA AAAATION TIONTION TIONTION\nREA REAREA REAREA CTIONS IN EVERYDCTIONS IN EVERYDCTIONS IN EVERYDCTIONS IN EVERYDCTIONS IN EVERYD A AA AAY LIFE? Y LIFE?Y LIFE? Y LIFE?Y LIFE?\n1.3.1 Corrosion\nYou must have observed that iron articles are shiny when new, but get\ncoated with a reddish brown powder when left for some time. This process\nis commonly known as rusting of iron. Some other metals also get\ntarnished in this manner. Have you noticed the colour of the coating\nformed on copper and silver? When a metal is attacked by substances\naround it such as moisture, acids, etc., it is said to corrode and this\nprocess is called corrosion. The black coating on silver and the green\ncoating on copper are other examples of corrosion.\nCorrosion causes damage to car bodies, bridges, iron railings, ships\nand to all objects made of metals, specially those of iron. Corrosion of\niron is a serious problem. Every year an enormous amount of money is\nspent to replace damaged iron. You will learn more about corrosion in\nChapter 3.\n1.3.2 Rancidity\nHave you ever tasted or smelt the fat/oil containing food materials left\nfor a long time?\nWhen fats and oils are oxidised, they become rancid and their smell\nand taste change. Usually substances which prevent oxidation\n(antioxidants) are added to foods containing fats and oil. Keeping food\nin air tight containers helps to slow down oxidation. Do you know that\nchips manufacturers usually flush bags of chips with gas such as\nnitrogen to prevent the chips from getting oxidised ?\nRecall Activity 1.1Recall Activity 1.1Recall Activity 1.1Recall Activity 1.1Recall Activity 1.1 ,     where a magnesium ribbon burns with a dazzling flame in air (oxygen)\nand changes into a white substance, magnesium oxide. Is magnesium being oxidised or\nreduced in this reaction?\n2024-25\n\n--- Page 14 ---\nScience14\nWhat you have learnt\n/square6A complete chemical equation represents the reactants, products and their physical\nstates symbolically.\n/square6A chemical equation is balanced so that the numbers of atoms of each type involved\nin a chemical reaction are the same on the reactant and product sides of the\nequation. Equations must always be balanced.\n/square6In a combination reaction two or more substances combine to form a new single\nsubstance.\n/square6Decomposition reactions are opposite to combination reactions. In a decomposition\nreaction, a single substance decomposes to give two or more substances.\n/square6Reactions in which heat is given out along with the products are called exothermic\nreactions.\n/square6Reactions in which energy is absorbed are known as endothermic reactions.\n/square6When an element displaces another element from its compound, a displacement\nreaction occurs.\n/square6Two different atoms or groups of atoms (ions) are exchanged in double displacement\nreactions.\n/square6Precipitation reactions produce insoluble salts.\n/square6Reactions also involve the gain or loss of oxygen or hydrogen by substances.\nOxidation is the gain of oxygen or loss of hydrogen. Reduction is the loss of oxygen\nor gain of hydrogen.\nEXERCISES"
    },
    {
      "id": "e69766e2-f631-4131-ab0c-c5d7ac447950",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 9,
      "title": "1. Which of the statements about the reaction below are incorrect?",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "2PbO(s) + C(s) →  2Pb(s) + CO2(g)\n(a) Lead is getting reduced.\n(b) Carbon dioxide is getting oxidised.\n(c) Carbon is getting oxidised.\n(d) Lead oxide is getting reduced.\n(i) (a) and (b)\n(ii) (a) and (c)\n(iii) (a), (b) and (c)\n(iv) all"
    },
    {
      "id": "99d86841-b65a-4eb7-95d4-247e85f2061e",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 10,
      "title": "2. Fe2O3 + 2Al →  Al2O3 + 2Fe",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "The above reaction is an example of a\n(a) combination reaction.\n(b) double displacement reaction.\n2024-25\n\n--- Page 15 ---\nChemical Reactions and Equations 15\n(c) decomposition reaction.\n(d) displacement reaction."
    },
    {
      "id": "f0bd42f5-cf12-40e0-9a00-c2e60e3f19b2",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 11,
      "title": "3. What happens when dilute hydr ochloric acid is added to ir on fillings? Tick the",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "correct answer.\n(a) Hydrogen gas and iron chloride are produced.\n(b) Chlorine gas and iron hydroxide are produced.\n(c) No reaction takes place.\n(d) Iron salt and water are produced."
    },
    {
      "id": "fcf17090-1b86-4a18-984c-31dc02890585",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 12,
      "title": "4. What is a balanced chemical equation? Why should chemical equations be",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "balanced?"
    },
    {
      "id": "88661a61-bb7c-4d65-9e22-24dd358fe3df",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 13,
      "title": "5. Translate the following statements into chemical equations and then balance them.",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "(a) Hydrogen gas combines with nitrogen to form ammonia.\n(b) Hydrogen sulphide gas burns in air to give water and sulpur dioxide.\n(c) Barium chloride reacts with aluminium sulphate to give aluminium chloride\nand a precipitate of barium sulphate.\n(d) Potassium metal reacts with water to give potassium hydroxide and hydrogen\ngas."
    },
    {
      "id": "fd0f48af-b10b-4f7e-91e3-1f39dbb937ba",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 14,
      "title": "6. Balance the following chemical equations.",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "(a) HNO3 + Ca(OH)2 →  Ca(NO3)2 + H2O\n(b) NaOH + H2SO4 →  Na2SO4 + H2O\n(c) NaCl + AgNO3 →  AgCl + NaNO3\n(d) BaCl2 + H2SO4 →  BaSO4 + HCl"
    },
    {
      "id": "63058b56-7542-423b-b358-a68a337f0038",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 15,
      "title": "7. Write the balanced chemical equations for the following reactions.",
      "topics": [],
      "start_page": 14,
      "end_page": 14,
      "content": "(a) Calcium hydroxide + Carbon dioxide  \n→   Calcium carbonate + Water\n(b) Zinc + Silver nitrate  →   Zinc nitrate + Silver\n(c) Aluminium + Copper chloride  →   Aluminium chloride + Copper\n(d) Barium chloride + Potassium sulphate →  Barium sulphate + Potassium chloride"
    },
    {
      "id": "718e73af-3cf9-4d2c-a990-13e8b82c5ed0",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 16,
      "title": "8. Write the balanced chemical equation for the following and identify the type of",
      "topics": [],
      "start_page": 14,
      "end_page": 15,
      "content": "reaction in each case.\n(a) Potassium bromide(aq) + Barium iodide(aq) →   Potassium iodide(aq) +\nBarium bromide(s)\n(b) Zinc carbonate(s) →   Zinc oxide(s) + Carbon dioxide(g)\n(c) Hydrogen(g) + Chlorine(g)  →   Hydrogen chloride(g)\n(d) Magnesium(s) + Hydrochloric acid(aq)  →   Magnesium chloride(aq) + Hydrogen(g)"
    },
    {
      "id": "b05b461f-785b-46b0-952b-ba81b53e1233",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 19,
      "title": "11. Why are decomposition reactions called the opposite of combination reactions?",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "Write equations for these reactions.\n2024-25\n\n--- Page 16 ---\nScience16\nGroup  Activity\nPerform the following activity.\n/square6Take four beakers and label them as A, B, C and D.\n/square6Put 25 mL of water in A, B and C beakers and copper sulphate solution in beaker D.\n/square6Measure and record the temperature of each liquid contained in the beakers above.\n/square6Add two spatulas of potassium sulphate, ammonium nitrate, anhydrous copper\nsulphate and fine iron fillings to beakers A, B, C and D respectively and stir.\n/square6Finally measure and record the temperature of each of the mixture above.\nFind out which reactions are exothermic and which ones are endothermic in nature."
    },
    {
      "id": "09d75848-63ac-49d8-a0d0-7a22f735b4ab",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 20,
      "title": "12. Write one equation each for decomposition reactions where energy is supplied in",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "the form of heat, light or electricity."
    },
    {
      "id": "e6ebceb9-f7b3-44fc-b0e1-61c12ad53ef9",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 21,
      "title": "13. What is the difference between displacement and double displacement reactions?",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "Write equations for these reactions."
    },
    {
      "id": "a7adf6f5-d00c-4a5d-8a90-7c6d25ac51b5",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 22,
      "title": "14.  In the r",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "efining of silver, the recovery of silver from silver nitrate solution involved\ndisplacement by copper metal. Write down the reaction involved."
    },
    {
      "id": "75fc11ff-2790-4a1c-b37e-dbaf0ae26e6a",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 24,
      "title": "16. Explain the following in terms of gain or loss of oxygen with two examples each.",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "(a) Oxidation\n(b) Reduction"
    },
    {
      "id": "71525ccd-d250-4d3e-a7a1-6fb759425dbc",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 25,
      "title": "17. A shiny brown coloured element ‘X’ on heating in air becomes black in colour .",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "Name the element ‘X’ and the black coloured compound formed."
    },
    {
      "id": "5d1f1ac5-19d3-4181-a2c0-cda3b9ebe2c1",
      "textbook_id": "c4ee25ef-917b-4494-b621-674698d0a149",
      "chapter_number": 28,
      "title": "20. Explain the following terms with one example each.",
      "topics": [],
      "start_page": 15,
      "end_page": 15,
      "content": "(a) Corrosion\n(b) Rancidity\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "13dbb290-73f1-4003-95b7-5605b4e4b70e",
      "chapter_id": "7884515a-d851-4c4a-9ad6-9fc6e77e68d7",
      "chunk_index": 0,
      "content": "(i) Hydrogen + Chlorine →  Hydrogen chloride\n(ii) Barium chloride + Aluminium sulphate →   Barium sulphate +\n     Aluminium chloride\n(iii) Sodium + Water  →  Sodium hydroxide + Hydr ogen",
      "content_type": "text",
      "token_count": 46,
      "page_number": 6
    },
    {
      "id": "0324c8b0-3e5d-45b6-994d-694b5799c001",
      "chapter_id": "ed076433-6aad-4118-8eeb-8df230805b33",
      "chunk_index": 0,
      "content": "following reactions.\n(i) Solutions of barium chloride and sodium sulphate in water react\nto give insoluble barium sulphate and the solution of sodium\nchloride.\n(ii) Sodium hydroxide solution (in water) reacts with hydrochloric\nacid solution (in water) to produce sodium chloride solution and\nwater.\n?\n2024-25\n\n--- Page 7 ---\nChemical Reactions and Equations 7\nLet us discuss some more examples of combination reactions.\n(i) Burning of coal\nC(s) + O2(g)  →  CO2(g) (1.15)\n(ii) Formation of water from H2(g) and O2(g)\n2H2(g) + O2(g) →  2H2O(l) (1.16)\nIn simple language we can say that when two or more substances\n(elements or compounds) combine to form a single product, the reactions\nare called combination reactions.\nIn Activity 1.4, we also observed that a large amount of heat is evolved.\nThis makes the reaction mixture warm. Reactions in which heat is\nreleased along with the formation of products are called exothermic\nchemical reactions.\nOther examples of exothermic reactions are –\n(i) Burning of natural gas\nCH4(g) + 2O2 (g) →  CO2 (g) + 2H2O (g) (1.17)\n(ii) Do you know that respiration is an exothermic process?\nWe all know that we need ener gy to stay alive. We get this energy\nfrom the food we eat. During digestion, food is broken down into simpler\nsubstances. For example, rice, potatoes and bread contain\ncarbohydrates. These carbohydrates are broken down to form glucose.\nThis glucose combines with oxygen in the cells of our body and provides\nenergy. The special name of this reaction is respiration, the process of\nwhich you will study in Chapter 6.\nC6H12O6(aq) + 6O2(aq) →  6CO2(aq) + 6H2O(l) + energy (1.18)\n(Glucose)\n(iii) The decomposition of vegetable matter into compost is also an\nexample of an exothermic reaction.\nIdentify the type of the reaction taking place in Activity 1.1, where\nheat is given out along with the formation of a single product.\nDo You Know?\nA solution of slaked lime produced by the reaction 1.13 is used for whitewashing\nwalls. Calcium hydroxide reacts slowly with the carbon dioxide in air to form a thin\nlayer of calcium carbonate on the walls. Calcium carbonate is  formed after two to\nthree days of whitewashing and gives a shiny finish to the walls. It is interesting to note\nthat the chemical formula for marble is also CaCO3.\nCa(OH)2(aq) + CO2(g) → CaCO3(s)  + H2O(l) (1.14)\n(Calcium (Calcium\nhydroxide) carbonate)\n2024-25",
      "content_type": "example",
      "token_count": 594,
      "page_number": 6
    },
    {
      "id": "d06bb54c-dd27-4793-8142-9959ace8c743",
      "chapter_id": "ed076433-6aad-4118-8eeb-8df230805b33",
      "chunk_index": 1,
      "content": "--- Page 8 ---\nScience8 88 88\nFigure 1.5\nHeating of lead nitrate and\nemission of nitrogen dioxide\nFigure 1.4\nCorrect way of heating\nthe boiling tube\ncontaining crystals\nof ferrous sulphate\nand of smelling the\nodour\nActivity 1.6Activity 1.6Activity 1.6Activity 1.6Activity 1.6\nn Take about 2 g lead nitrate powder in a boiling\ntube.\nn Hold the boiling tube with a pair of tongs and\nheat it over a flame, as shown in Fig. 1.5.\nn What do you observe? Note down the change,\nif any.\nYou will observe the emission of brown fumes.\nThese fumes are of nitrogen dioxide (NO 2). The\nreaction that takes place is –\nActivity 1.5Activity 1.5Activity 1.5Activity 1.5Activity 1.5\nn Take about 2 g ferrous sulphate crystals\nin a dry boiling tube.\nn Note the colour of the ferrous sulphate\ncrystals.\nn Heat the boiling tube over the  flame  of\na burner or spirit lamp as shown in\nFig. 1.4.\nn Observe the colour of the crystals after\nheating.\nHave you noticed that the green colour of the ferrous sulphate crystals\nhas changed? You can also smell the characteristic odour of burning\nsulphur.\n2FeSO4(s) \nHeat →   Fe2O3(s)  +  SO2(g)  + SO3(g) (1.19)\n(Ferrous sulphate)   (Ferric oxide)\nIn this reaction you can observe that a single reactant breaks down\nto give simpler products. This is a decomposition reaction. Ferrous\nsulphate crystals (FeSO4. 7H2O) lose water when heated and the colour\nof the crystals changes. It then decomposes to ferric oxide (Fe 2O3),\nsulphur dioxide (SO2) and sulphur trioxide (SO3). Ferric oxide is a solid,\nwhile SO2 and SO3 are gases.\nDecomposition of calcium carbonate to calcium oxide and carbon\ndioxide on heating is an important decomposition reaction used in\nvarious industries. Calcium oxide is called lime or quick lime. It has\nmany uses – one is in the manufacture of cement. When a decomposition\nreaction is carried out by heating, it is called thermal decomposition.\nCaCO3(s) \nHeat →   CaO(s)    +   CO2(g) (1.20)\n(Limestone)    (Quick lime)\nAnother example of a thermal decomposition reaction is given\nin Activity 1.6.\n1.2.2 Decomposition Reaction\n2024-25",
      "content_type": "example",
      "token_count": 521,
      "page_number": 6
    },
    {
      "id": "94957c42-97b0-4c6a-a501-9aa672714fc3",
      "chapter_id": "ed076433-6aad-4118-8eeb-8df230805b33",
      "chunk_index": 2,
      "content": "--- Page 9 ---\nChemical Reactions and Equations 9 9999\nActivity 1.7Activity 1.7Activity 1.7Activity 1.7Activity 1.7\nActivity 1.8Activity 1.8Activity 1.8Activity 1.8Activity 1.8\nn Take about 2 g silver chloride in a china dish.\nn What is its colour?\nn Place this china dish in sunlight for some time\n(Fig. 1.7).\nn Observe the colour of the silver chloride after some\ntime.\nFigure 1.7\nSilver chloride turns grey\nin sunlight to form silver\nmetal\nYou will see that white silver chloride turns grey in sunlight. This is\ndue to the decomposition of silver chloride into silver and chlorine by\nlight.\n2AgCl(s) \nSunlight → 2Ag(s) + Cl2(g) (1.22)\nn Take a plastic mug. Drill two holes at its\nbase and fit rubber stoppers in these holes.\nInsert carbon electrodes in these rubber\nstoppers as shown in Fig. 1.6.\nn Connect these electrodes to a 6 volt\nbattery.\nn Fill the mug with water such that the\nelectrodes are immersed. Add a few drops\nof dilute sulphuric acid to the water.\nn Take two test tubes filled with water and\ninvert them over the two carbon electrodes.\nn Switch on the current and leave the\napparatus undisturbed for some time.\nn You will observe the formation of bubbles\nat both the electrodes. These bubbles displace water in the\ntest tubes.\nn Is the volume of the gas collected the same in both the test tubes?\nn Once the test tubes are filled with the respective gases, remove\nthem carefully.\nn Test these gases one by one by bringing a burning candle close\nto the mouth of the test tubes.\nCAUTION: This step must be performed carefully by the teacher.\nn What happens in each case?\nn Which gas is present in each test tube?\nFigure 1.6\nElectrolysis of water\n2Pb(NO3)2(s) Heat →  2PbO(s) + 4NO2(g)  +  O2(g) (1.21)\n(Lead nitrate)       (Lead oxide) (Nitrogen      (Oxygen)\ndioxide)\nLet us perform some more decomposition reactions as given in\nActivities 1.7 and 1.8.\n2024-25\n\n--- Page 10 ---\nScience10 1010 1010\nFigure 1.8\n(a) Iron nails dipped in copper sulphate solution\n?\nQUESTIONS",
      "content_type": "exercise",
      "token_count": 499,
      "page_number": 10
    },
    {
      "id": "7c40adea-cf57-49b2-a090-c41e7ee4ea40",
      "chapter_id": "1a2cf08b-f847-4cd9-8d3b-91db30e9efcb",
      "chunk_index": 0,
      "content": "(i) Name the substance ‘X’ and write its formula.\n(ii) Write the reaction of the substance ‘X’ named in (i) above with\nwater.",
      "content_type": "text",
      "token_count": 31,
      "page_number": 10
    },
    {
      "id": "0ac60b65-5049-4832-ab4e-b12f733937a2",
      "chapter_id": "798d6d96-de0a-4656-8805-9f8da0cb3b8a",
      "chunk_index": 0,
      "content": "1.7 double of the amount collected in the other? Name this gas.\n1.2.3  Displacement Reaction\nActivity 1.9Activity 1.9Activity 1.9Activity 1.9Activity 1.9\nn Take three iron nails and clean them by\nrubbing with sand paper.\nn Take two test tubes marked as (A) and\n(B). In each test tube, take about 10 mL\ncopper sulphate solution.\nn Tie two iron nails with a thread and\nimmerse them carefully in the copper\nsulphate solution in test tube B for\nabout 20 minutes [Fig. 1.8 (a)]. Keep one\niron nail aside for comparison.\nn After 20 minutes, take out the iron nails\nfrom the copper sulphate solution.\nn Compare the intensity of the blue colour\nof copper sulphate solutions in test tubes\n(A) and (B) [Fig. 1.8 (b)].\nn Also, compare the colour of the iron nails\ndipped in the copper sulphate solution\nwith the one kept aside [Fig. 1.8 (b)].\nTake about 2 g barium hydroxide in a test tube. Add 1 g of ammonium chloride and mix\nwith the help of a glass rod. Touch the bottom of the test tube with your palm. What do you\nfeel? Is this an exothermic or endothermic reaction?\nCarry out the following Activity\nSilver bromide also behaves in the same way.\n2AgBr(s) Sunlight → 2Ag(s) + Br2(g) (1.23)\nThe above reactions are used in black and white photography.\nWhat form of energy is causing these decomposition reactions?\nWe have seen that the decomposition reactions require energy either\nin the form of heat, light or electricity for breaking down the reactants.\nReactions in which energy is absorbed are known as endothermic\nreactions.\n2024-25",
      "content_type": "text",
      "token_count": 383,
      "page_number": 10
    },
    {
      "id": "4448f76d-72ee-4e54-89ea-4c19326db43b",
      "chapter_id": "798d6d96-de0a-4656-8805-9f8da0cb3b8a",
      "chunk_index": 1,
      "content": "--- Page 11 ---\nChemical Reactions and Equations 11\nWhy does the iron nail become brownish in colour and the blue colour\nof copper sulphate solution fades?\nThe following chemical reaction takes place in this Activity–\nFe(s) + CuSO4(aq) → FeSO4(aq)    +   Cu(s) (1.24)\n        (Copper sulphate) (Iron sulphate)\nIn this reaction, iron has displaced or removed another element,\ncopper, fr om copper sulphate solution. This r eaction is known as\ndisplacement reaction.\nOther examples of displacement reactions are\nZn(s) + CuSO4(aq)  → ZnSO4(aq)   +     Cu(s) (1.25)\n     (Copper sulphate) (Zinc sulphate)\nPb(s) + CuCl2(aq)   → PbCl2(aq)     +     Cu(s) (1.26)\n      (Copper chloride) (Lead chloride)\nZinc and lead are more reactive elements than copper. They displace\ncopper from its compounds.\n1.2.4 Double Displacement Reaction\nActivity 1.10Activity 1.10Activity 1.10Activity 1.10Activity 1.10\n/square6Take about 3 mL of sodium sulphate\nsolution in a test tube.\n/square6In another test tube, take about 3 mL of\nbarium chloride solution.\n/square6Mix the two solutions (Fig. 1.9).\n/square6What do you observe?\nFigure 1.9Figure 1.9Figure 1.9Figure 1.9Figure 1.9\nFormation of barium\nsulphate and sodium\nchloride\nYou will observe that a white substance, which is\ninsoluble in water, is formed. This insoluble substance\nformed is known as a precipitate. Any reaction that\nproduces a precipitate can be called a precipitation reaction.\nNa2SO4(aq) + BaCl2(aq) →  BaSO4(s) + 2NaCl(aq) (1.27)\n(Sodium (Barium (Barium (Sodium\nsulphate) chloride) sulphate) chloride)\nFigure 1.8 Figure 1.8 Figure 1.8 Figure 1.8 Figure 1.8 (b) Iron nails and copper sulphate solutions compared before and after the experiment\n2024-25",
      "content_type": "example",
      "token_count": 425,
      "page_number": 10
    },
    {
      "id": "1f1b6887-dc83-44e2-80f5-81e2dfc55bf0",
      "chapter_id": "798d6d96-de0a-4656-8805-9f8da0cb3b8a",
      "chunk_index": 2,
      "content": "--- Page 12 ---\nScience12\n1.2.5 Oxidation and Reduction\nActivity 1.11Activity 1.11Activity 1.11Activity 1.11Activity 1.11\n/square6Heat a china dish containing about 1 g\ncopper powder (Fig. 1.10).\n/square6What do you observe?\nFigure 1.10Figure 1.10Figure 1.10Figure 1.10Figure 1.10\nOxidation of copper to\ncopper oxide\nThe surface of copper powder becomes coated with\nblack copper(II) oxide. Why has this black\nsubstance formed?\nThis is because oxygen is added to copper and\ncopper oxide is formed.\n2Cu + O2  \nHeat →  2CuO (1.28)\nIf hydrogen gas is passed over this heated material (CuO), the black\ncoating on the surface turns brown as the reverse reaction takes place\nand copper is obtained.\nCuO +H Cu+H O2 2\nHea\nt →   (1.29)\nIf a substance gains oxygen during a reaction, it is said to be oxidised.\nIf a substance loses oxygen during a reaction, it is said to be reduced.\nDuring this reaction (1.29), the copper(II) oxide is losing oxygen and\nis being reduced. The hydrogen is gaining oxygen and is being oxidised.\nIn other words, one reactant gets oxidised while the other gets reduced\nduring a reaction. Such reactions are called oxidation-reduction reactions\nor redox reactions.\n(1.30)\nSome other examples of redox reactions are:\nZnO + C → + Zn CO (1.31)\nMnO HCl MnCl H O Cl2 2 2 24 2+ → + + (1.32)\nRecall Activity 1.2Recall Activity 1.2Recall Activity 1.2Recall Activity 1.2Recall Activity 1.2 , where you have mixed the solutions of lead(II) nitrate\nand potassium iodide.\n(i) What was the colour of the precipitate formed? Can you name the compound\nprecipitated?\n(ii) Write the balanced chemical equation for this reaction.\n(iii) Is this also a double displacement reaction?\nWhat causes this? The  white precipitate of BaSO4 is formed by the\nreaction of \n2–\n4SO  and Ba2+. The other product formed is sodium chloride\nwhich remains in the solution. Such reactions in which there is an\nexchange of ions between the reactants are called double displacement\nreactions.\n2024-25\n\n--- Page 13 ---\nChemical Reactions and Equations 13\nIn reaction (1.31) carbon is oxidised to CO and ZnO is reduced to Zn.\nIn reaction (1.32) HCl is oxidised to Cl2 whereas MnO2 is reduced to MnCl2.\nFrom the above examples we can say that if a substance gains oxygen\nor loses hydrogen during a reaction, it is oxidised. If a substance loses\noxygen or gains hydrogen during a reaction, it is reduced.\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 599,
      "page_number": 12
    },
    {
      "id": "81580522-06e0-45bd-b4ae-62fbce91adb5",
      "chapter_id": "b6c08389-f19d-4e4f-907e-bc5562b8f34f",
      "chunk_index": 0,
      "content": "an iron nail is dipped in it?",
      "content_type": "text",
      "token_count": 7,
      "page_number": 12
    },
    {
      "id": "88bcd142-198b-4350-8f5b-4646058f9a1e",
      "chapter_id": "7af937cf-2c0b-4b71-93a4-7d6e3b0b3622",
      "chunk_index": 0,
      "content": "the one given in Activity 1.10.",
      "content_type": "text",
      "token_count": 7,
      "page_number": 12
    },
    {
      "id": "baf44a05-32bd-41db-8ce5-6fd1b80b1065",
      "chapter_id": "3a0d967f-8ef9-4aaf-8034-5633baa3a107",
      "chunk_index": 0,
      "content": "that are reduced in the following reactions.\n(i) 4Na(s) + O 2(g) →  2Na2O(s)\n(ii) CuO(s) + H2(g) →  Cu(s) + H2O(l)\n1.3\n1.31.3 1.31.3 HA HAHA HAHAVE YOU OBSERVED THE EFFECTS OF OVE YOU OBSERVED THE EFFECTS OF OVE YOU OBSERVED THE EFFECTS OF OVE YOU OBSERVED THE EFFECTS OF OVE YOU OBSERVED THE EFFECTS OF O XID XIDXID XIDXIDA AAAATION TIONTION TIONTION\nREA REAREA REAREA CTIONS IN EVERYDCTIONS IN EVERYDCTIONS IN EVERYDCTIONS IN EVERYDCTIONS IN EVERYD A AA AAY LIFE? Y LIFE?Y LIFE? Y LIFE?Y LIFE?\n1.3.1 Corrosion\nYou must have observed that iron articles are shiny when new, but get\ncoated with a reddish brown powder when left for some time. This process\nis commonly known as rusting of iron. Some other metals also get\ntarnished in this manner. Have you noticed the colour of the coating\nformed on copper and silver? When a metal is attacked by substances\naround it such as moisture, acids, etc., it is said to corrode and this\nprocess is called corrosion. The black coating on silver and the green\ncoating on copper are other examples of corrosion.\nCorrosion causes damage to car bodies, bridges, iron railings, ships\nand to all objects made of metals, specially those of iron. Corrosion of\niron is a serious problem. Every year an enormous amount of money is\nspent to replace damaged iron. You will learn more about corrosion in\nChapter 3.\n1.3.2 Rancidity\nHave you ever tasted or smelt the fat/oil containing food materials left\nfor a long time?\nWhen fats and oils are oxidised, they become rancid and their smell\nand taste change. Usually substances which prevent oxidation\n(antioxidants) are added to foods containing fats and oil. Keeping food\nin air tight containers helps to slow down oxidation. Do you know that\nchips manufacturers usually flush bags of chips with gas such as\nnitrogen to prevent the chips from getting oxidised ?\nRecall Activity 1.1Recall Activity 1.1Recall Activity 1.1Recall Activity 1.1Recall Activity 1.1 ,     where a magnesium ribbon burns with a dazzling flame in air (oxygen)\nand changes into a white substance, magnesium oxide. Is magnesium being oxidised or\nreduced in this reaction?\n2024-25",
      "content_type": "example",
      "token_count": 532,
      "page_number": 12
    },
    {
      "id": "98ef4703-74ee-4477-b80b-248ff275e812",
      "chapter_id": "3a0d967f-8ef9-4aaf-8034-5633baa3a107",
      "chunk_index": 1,
      "content": "--- Page 14 ---\nScience14\nWhat you have learnt\n/square6A complete chemical equation represents the reactants, products and their physical\nstates symbolically.\n/square6A chemical equation is balanced so that the numbers of atoms of each type involved\nin a chemical reaction are the same on the reactant and product sides of the\nequation. Equations must always be balanced.\n/square6In a combination reaction two or more substances combine to form a new single\nsubstance.\n/square6Decomposition reactions are opposite to combination reactions. In a decomposition\nreaction, a single substance decomposes to give two or more substances.\n/square6Reactions in which heat is given out along with the products are called exothermic\nreactions.\n/square6Reactions in which energy is absorbed are known as endothermic reactions.\n/square6When an element displaces another element from its compound, a displacement\nreaction occurs.\n/square6Two different atoms or groups of atoms (ions) are exchanged in double displacement\nreactions.\n/square6Precipitation reactions produce insoluble salts.\n/square6Reactions also involve the gain or loss of oxygen or hydrogen by substances.\nOxidation is the gain of oxygen or loss of hydrogen. Reduction is the loss of oxygen\nor gain of hydrogen.\nEXERCISES",
      "content_type": "exercise",
      "token_count": 318,
      "page_number": 14
    },
    {
      "id": "8750ca48-aab2-4a9a-89cb-2909c7ed5fab",
      "chapter_id": "e69766e2-f631-4131-ab0c-c5d7ac447950",
      "chunk_index": 0,
      "content": "2PbO(s) + C(s) →  2Pb(s) + CO2(g)\n(a) Lead is getting reduced.\n(b) Carbon dioxide is getting oxidised.\n(c) Carbon is getting oxidised.\n(d) Lead oxide is getting reduced.\n(i) (a) and (b)\n(ii) (a) and (c)\n(iii) (a), (b) and (c)\n(iv) all",
      "content_type": "text",
      "token_count": 58,
      "page_number": 14
    },
    {
      "id": "86cc2b77-d60c-44a9-91c2-f140e0e99303",
      "chapter_id": "99d86841-b65a-4eb7-95d4-247e85f2061e",
      "chunk_index": 0,
      "content": "The above reaction is an example of a\n(a) combination reaction.\n(b) double displacement reaction.\n2024-25\n\n--- Page 15 ---\nChemical Reactions and Equations 15\n(c) decomposition reaction.\n(d) displacement reaction.",
      "content_type": "example",
      "token_count": 53,
      "page_number": 14
    },
    {
      "id": "2427f173-5371-46c5-b392-b38138192a0d",
      "chapter_id": "f0bd42f5-cf12-40e0-9a00-c2e60e3f19b2",
      "chunk_index": 0,
      "content": "correct answer.\n(a) Hydrogen gas and iron chloride are produced.\n(b) Chlorine gas and iron hydroxide are produced.\n(c) No reaction takes place.\n(d) Iron salt and water are produced.",
      "content_type": "text",
      "token_count": 45,
      "page_number": 14
    },
    {
      "id": "0f319753-8cc4-4e83-af29-2d4dd174cfdc",
      "chapter_id": "fcf17090-1b86-4a18-984c-31dc02890585",
      "chunk_index": 0,
      "content": "balanced?",
      "content_type": "text",
      "token_count": 2,
      "page_number": 14
    },
    {
      "id": "e99c9934-3483-443b-a7d1-2996be9c6886",
      "chapter_id": "88661a61-bb7c-4d65-9e22-24dd358fe3df",
      "chunk_index": 0,
      "content": "(a) Hydrogen gas combines with nitrogen to form ammonia.\n(b) Hydrogen sulphide gas burns in air to give water and sulpur dioxide.\n(c) Barium chloride reacts with aluminium sulphate to give aluminium chloride\nand a precipitate of barium sulphate.\n(d) Potassium metal reacts with water to give potassium hydroxide and hydrogen\ngas.",
      "content_type": "text",
      "token_count": 82,
      "page_number": 14
    },
    {
      "id": "e52c48fe-8d4e-4a24-8d7d-d892817e5b38",
      "chapter_id": "fd0f48af-b10b-4f7e-91e3-1f39dbb937ba",
      "chunk_index": 0,
      "content": "(a) HNO3 + Ca(OH)2 →  Ca(NO3)2 + H2O\n(b) NaOH + H2SO4 →  Na2SO4 + H2O\n(c) NaCl + AgNO3 →  AgCl + NaNO3\n(d) BaCl2 + H2SO4 →  BaSO4 + HCl",
      "content_type": "text",
      "token_count": 33,
      "page_number": 14
    },
    {
      "id": "e6f00246-4b80-450d-9dc6-63ab815d89e8",
      "chapter_id": "63058b56-7542-423b-b358-a68a337f0038",
      "chunk_index": 0,
      "content": "(a) Calcium hydroxide + Carbon dioxide  \n→   Calcium carbonate + Water\n(b) Zinc + Silver nitrate  →   Zinc nitrate + Silver\n(c) Aluminium + Copper chloride  →   Aluminium chloride + Copper\n(d) Barium chloride + Potassium sulphate →  Barium sulphate + Potassium chloride",
      "content_type": "text",
      "token_count": 67,
      "page_number": 14
    },
    {
      "id": "709437de-6a94-4cd8-9dcf-25537a264973",
      "chapter_id": "718e73af-3cf9-4d2c-a990-13e8b82c5ed0",
      "chunk_index": 0,
      "content": "reaction in each case.\n(a) Potassium bromide(aq) + Barium iodide(aq) →   Potassium iodide(aq) +\nBarium bromide(s)\n(b) Zinc carbonate(s) →   Zinc oxide(s) + Carbon dioxide(g)\n(c) Hydrogen(g) + Chlorine(g)  →   Hydrogen chloride(g)\n(d) Magnesium(s) + Hydrochloric acid(aq)  →   Magnesium chloride(aq) + Hydrogen(g)",
      "content_type": "text",
      "token_count": 78,
      "page_number": 15
    },
    {
      "id": "bef379b0-e04a-47bc-a2c4-47a5c55e5841",
      "chapter_id": "b05b461f-785b-46b0-952b-ba81b53e1233",
      "chunk_index": 0,
      "content": "Write equations for these reactions.\n2024-25\n\n--- Page 16 ---\nScience16\nGroup  Activity\nPerform the following activity.\n/square6Take four beakers and label them as A, B, C and D.\n/square6Put 25 mL of water in A, B and C beakers and copper sulphate solution in beaker D.\n/square6Measure and record the temperature of each liquid contained in the beakers above.\n/square6Add two spatulas of potassium sulphate, ammonium nitrate, anhydrous copper\nsulphate and fine iron fillings to beakers A, B, C and D respectively and stir.\n/square6Finally measure and record the temperature of each of the mixture above.\nFind out which reactions are exothermic and which ones are endothermic in nature.",
      "content_type": "text",
      "token_count": 171,
      "page_number": 15
    },
    {
      "id": "5e055503-c4f6-47d1-8458-8a4c01e71108",
      "chapter_id": "09d75848-63ac-49d8-a0d0-7a22f735b4ab",
      "chunk_index": 0,
      "content": "the form of heat, light or electricity.",
      "content_type": "text",
      "token_count": 9,
      "page_number": 15
    },
    {
      "id": "f23350b3-1610-4389-853b-8bf308b4dcb1",
      "chapter_id": "e6ebceb9-f7b3-44fc-b0e1-61c12ad53ef9",
      "chunk_index": 0,
      "content": "Write equations for these reactions.",
      "content_type": "text",
      "token_count": 9,
      "page_number": 15
    },
    {
      "id": "fb077737-7bbd-430a-924b-33eca7e8edd0",
      "chapter_id": "a7adf6f5-d00c-4a5d-8a90-7c6d25ac51b5",
      "chunk_index": 0,
      "content": "efining of silver, the recovery of silver from silver nitrate solution involved\ndisplacement by copper metal. Write down the reaction involved.",
      "content_type": "text",
      "token_count": 35,
      "page_number": 15
    },
    {
      "id": "fa7adf79-26b2-4023-bcf8-b2664cf779c0",
      "chapter_id": "75fc11ff-2790-4a1c-b37e-dbaf0ae26e6a",
      "chunk_index": 0,
      "content": "(a) Oxidation\n(b) Reduction",
      "content_type": "text",
      "token_count": 6,
      "page_number": 15
    },
    {
      "id": "9c74766b-a2bf-4b30-93f9-d4241468eca2",
      "chapter_id": "71525ccd-d250-4d3e-a7a1-6fb759425dbc",
      "chunk_index": 0,
      "content": "Name the element ‘X’ and the black coloured compound formed.",
      "content_type": "text",
      "token_count": 15,
      "page_number": 15
    },
    {
      "id": "55046c1f-2ba2-4864-9492-46f50c710ce2",
      "chapter_id": "5d1f1ac5-19d3-4181-a2c0-cda3b9ebe2c1",
      "chunk_index": 0,
      "content": "(a) Corrosion\n(b) Rancidity\n2024-25",
      "content_type": "text",
      "token_count": 8,
      "page_number": 15
    }
  ]
}