{
  "textbook": {
    "id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
    "file_name": "Class X Science NCERT - Ch 04 - The pancreas secretes pancreatic juice which contains.pdf",
    "title": "The pancreas secretes pancreatic juice which contains",
    "grade": 10,
    "subject": "Class X Science NCERT",
    "total_pages": 21,
    "file_size_mb": 8.46302318572998,
    "status": "ready",
    "processed_at": "2025-09-28T10:54:44.293263",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Science NCERT/Class X Science NCERT - Ch 04 - The pancreas secretes pancreatic juice which contains.pdf"
  },
  "chapters": [
    {
      "id": "606f4bc8-c9f3-4b4a-8a2f-353f5886332c",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 1,
      "title": "1. Why is diffusion insufficient to meet the oxygen requirements of multi-",
      "topics": [],
      "start_page": 3,
      "end_page": 3,
      "content": "cellular organisms like humans?"
    },
    {
      "id": "6f54de56-f0d2-4dbf-a6f1-dc75cb59b985",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 4,
      "title": "4. What processes would you consider essential for maintaining life?",
      "topics": [],
      "start_page": 3,
      "end_page": 9,
      "content": "5.2 NUTRITION5.2 NUTRITION5.2 NUTRITION5.2 NUTRITION5.2 NUTRITION\nWhen we walk or ride a bicycle, we are using up energy. Even when we\nare not doing any apparent activity, energy is needed to maintain a\nstate of order in our body. We also need materials from outside in order\nto grow, develop, synthesise protein and other substances needed in\nthe body. This source of energy and materials is the food we eat.\nHow do living things get their food?\nThe general requirement for energy and materials is common in all\norganisms, but it is fulfilled in different ways. Some organisms use simple\nfood material obtained from inorganic sources in the form of carbon\ndioxide and water . These or ganisms, the autotr ophs, include gr\neen\nplants and some bacteria. Other organisms utilise complex substances.\nThese complex substances have to be broken down into simpler ones\nbefore they can be used for the upkeep and growth of the body. To\nachieve this, organisms use bio-catalysts called enzymes. Thus, the\nheterotrophs survival depends directly or indirectly on autotrophs.\nHeterotrophic organisms include animals and fungi.\n5.2.1 Autotrophic Nutrition\nCarbon and energy requirements of the autotrophic organism are\nfulfilled by photosynthesis. It is the process by which autotrophs take\nin substances from the outside and convert them into stored forms of\nenergy. This material is taken in the form of carbon dioxide and water\nwhich is converted into carbohydrates in the presence of sunlight and\nchlorophyll. Carbohydrates are utilised for providing energy to the plant.\nWe will study how this takes place in the next section. The carbohydrates\nwhich are not used immediately are stored in the form of starch, which\nserves as the internal energy reserve to be used as and when required\nby the plant. A somewhat similar situation is seen in us where some of\nthe energy derived from the food we eat is stored in our body in the form\nof glycogen.\n2024-25\n\n--- Page 4 ---\nScience82\nLet us now see what actually happens during the process of\nphotosynthesis. The following events occur during this process –\nFigure 5.2Figure 5.2Figure 5.2Figure 5.2Figure 5.2\nVariegated leaf (a) before\nand (b) after starch test\nFigure 5.1Figure 5.1Figure 5.1Figure 5.1Figure 5.1\nCross-section of a leaf\nActivity 5.1Activity 5.1Activity 5.1Activity 5.1Activity 5.1\n/square6Take a potted plant with variegated leaves – for example, money plant\nor crotons.\n/square6Keep the plant in a dark room for three days so that all the starch\ngets used up.\n/square6Now keep the plant in sunlight for about six hours.\n/square6Pluck a leaf from the plant. Mark the green areas in it and trace them\non a sheet of paper .\n/square6Dip the leaf in boiling water for a few minutes.\n/square6After this, immerse it in a beaker containing alcohol.\n/square6Carefully place the above beaker in a water -bath and heat till the\nalcohol begins to boil.\n/square6What happens to the colour of the leaf? What is the colour of the\nsolution?\n/square6Now dip the leaf in a dilute solution of iodine for a few minutes.\n/square6Take out the leaf and rinse off the iodine solution.\n/square6Observe the colour of the leaf and compare this with the tracing of\nthe leaf done in the beginning (Fig. 5.2).\n/square6What can you conclude about the presence of starch in various areas\nof the leaf?\n(i) Absorption of light energy by\nchlorophyll.\n(ii) Conversion of light energy to chemical\nenergy and splitting of water molecules\ninto hydrogen and oxygen.\n(iii) Reduction of carbon dioxide to\ncarbohydrates.\nThese steps need not take place one after\nthe other immediately. For example, desert\nplants take up carbon dioxide at night and\nprepare an intermediate which is acted upon\nby the energy absorbed by the chlorophyll\nduring the day.\nLet us see how each of the components of\nthe above reaction are necessary for\nphotosynthesis.\nIf you carefully observe a cross-section of a\nleaf under the microscope (shown in Fig. 5.1),\nyou will notice that some cells contain green\ndots. These green dots are cell organelles called\nchloroplasts which contain chlorophyll. Let us\ndo an activity which demonstrates that\nchlorophyll is essential for photosynthesis.\n2024-25\n\n--- Page 5 ---\nLife Processes 83\nNow, let us study how the plant\nobtains carbon dioxide. In Class IX,\nwe had talked about stomata (Fig. 5.3)\nwhich are tiny pores present on the\nsurface of the leaves. Massive amounts\nof gaseous exchange takes place in the\nleaves through these pores for the\npurpose of photosynthesis. But it is\nimportant to note here that exchange\nof gases occurs across the surface of\nstems, roots and leaves as well. Since\nlarge amounts of water can also be lost\nthrough these stomata, the plant\ncloses these pores when it does not\nneed carbon dioxide for photosynthesis. The opening and closing of the\npore is a function of the guard cells. The guard cells swell when water\nflows into them, causing the stomatal pore to open. Similarly the pore\ncloses if the guard cells shrink.\n/square6Take two healthy potted plants\nwhich are nearly the same size.\n/square6Keep them in a dark room for\nthree days.\n/square6Now place each plant on\nseparate glass plates. Place a\nwatch-glass containing potassium\nhydroxide by the side of one of\nthe plants. The potassium\nhydroxide is used to absorb\ncarbon dioxide.\n/square6Cover both plants with separate\nbell-jars as shown in Fig. 5.4.\n/square6Use vaseline to seal the bottom\nof the jars to the glass plates so\nthat the set-up is air -tight.\n/square6Keep the plants in sunlight for\nabout two hours.\n/square6Pluck a leaf from each plant and check for the presence of starch as in the above activity.\n/square6Do both the leaves show the presence of the same amount of starch?\n/square6What can you conclude from this activity?\nFigure 5.3 Figure 5.3 Figure 5.3 Figure 5.3 Figure 5.3 (a) Open and (b) closed stomatal pore\nActivity 5.2Activity 5.2Activity 5.2Activity 5.2Activity 5.2\nBased on the two activities performed above, can we design an\nexperiment to demonstrate that sunlight is essential for photosynthesis?\nSo far, we have talked about how autotr ophs meet their ener gy\nrequirements. But they also need other raw materials for building their\nbody. Water used in photosynthesis is taken up fr om the soil by the\nroots in terrestrial plants. Other materials like nitrogen, phosphorus,\niron and magnesium are taken up from the soil. Nitrogen is an essential\nelement used in the synthesis of proteins and other compounds. This is\nFigure 5.4 Experimental set-up (a) with potassium\nhydroxide (b) without potassium hydroxide\n(a) (b)\n2024-25\n\n--- Page 6 ---\nScience84\ntaken up in the form of inorganic nitrates or nitrites. Or it is taken up as\norganic compounds which have been prepared by bacteria from\natmospheric nitrogen.\n5.2.2 Heterotrophic Nutrition\nEach organism is adapted to its environment. The form of nutrition\ndiffers depending on the type and availability of food material as well\nas how it is obtained by the organism. For example, whether the food\nsource is stationary (such as grass) or mobile (such as a deer), would\nallow for differences in how the food is accessed and what is the nutritive\napparatus used by a cow and a lion. There is a range of strategies by\nwhich the food is taken in and used by the organism. Some organisms\nbreak-down the food material outside the body and then absorb it.\nExamples are fungi like bread moulds, yeast and mushrooms. Others\ntake in whole material and break it down inside their bodies. What can\nbe taken in and broken down depends on the body design and\nfunctioning. Some other organisms derive nutrition from plants or\nanimals without killing them. This parasitic nutritive strategy is used\nby a wide variety of or ganisms like cuscuta (amar -bel), ticks, lice,\nleeches and tape-worms.\n5.2.3 How do Organisms obtain their Nutrition?\nSince the food and the way it is obtained differ, the digestive system is\ndifferent in various organisms. In single-celled organisms, the food\nmay be taken in by the entire surface. But as the complexity of the\norganism increases, different parts become specialised to perform\ndifferent functions. For example, \nAmoeba takes in food using\ntemporary finger-like extensions of the cell surface which fuse over\nthe food particle forming a food-vacuole (Fig. 5.5). Inside the food-\nvacuole, complex substances are broken down into simpler ones\nwhich then diffuse into the cytoplasm. The remaining undigested\nmaterial is moved to the surface of the cell and thrown out. In\nParamoecium, which is also a unicellular organism, the cell has a\ndefinite shape and food is taken in at a specific spot. Food is moved\nto this spot by the movement of cilia which cover the entire surface\nof the cell.\n5.2.4 Nutrition in Human Beings\nThe alimentary canal is basically a long tube extending from the mouth\nto the anus. In Fig. 5.6, we can see that the tube has different parts.\nVarious regions are specialised to per form different functions. What\nhappens to the food once it enters our body? W e shall discuss this\nprocess here.\nFigure 5.5Figure 5.5Figure 5.5Figure 5.5Figure 5.5\nNutrition in Amoeba\n2024-25\n\n--- Page 7 ---\nLife Processes 85\nActivity 5.3Activity 5.3Activity 5.3Activity 5.3Activity 5.3\n/square6Take 1 mL starch solution (1%) in two test tubes (A and B).\n/square6Add 1 mL saliva to test tube A and leave both test tubes undisturbed\nfor 20-30 minutes.\n/square6Now add a few drops of dilute iodine solution to the test tubes.\n/square6In which test tube do you observe a colour change?\n/square6What does this indicate about the presence or absence of starch\nin the two test tubes?\n/square6What does this tell us about the action of saliva on starch?\nWe eat various types of food which has to pass through the same\ndigestive tract. Naturally the food has to be processed to generate\nparticles which are small and of the same texture. This is achieved by\ncrushing the food with our teeth. Since the lining of the canal is soft, the\nfood is also wetted to make its passage smooth. When we eat something\nwe like, our mouth ‘waters’. This is actually not only water, but a fluid\ncalled saliva secreted by the salivary glands. Another aspect of the food\nwe ingest is its complex nature. If it is to be absorbed from the alimentary\ncanal, it has to be broken into smaller molecules. This is done with the\nhelp of biological catalysts called\nenzymes. The saliva contains an\nenzyme called salivary amylase that\nbreaks down starch which is a complex\nmolecule to give simple sugar. The food\nis mixed thoroughly with saliva and\nmoved around the mouth while\nchewing by the muscular tongue.\nIt is necessary to move the food in\na regulated manner along the digestive\ntube so that it can be processed\nproperly in each part. The lining of\ncanal has muscles that contract\nrhythmically in order to push the food\nforward. These peristaltic movements\noccur all along the gut.\nFrom the mouth, the food is taken\nto the stomach through the food-pipe\nor oesophagus. The stomach is a large\norgan which expands when food\nenters it. The muscular walls of the\nstomach help in mixing the food\nthoroughly with more digestive juices.\nThe digestion in stomach is taken\ncare of by the gastric glands present in the wall of the stomach. These\nrelease hydrochloric acid, a protein digesting enzyme called pepsin,\nand mucus. The hydrochloric acid creates an acidic medium which\nfacilitates the action of the enzyme pepsin. What other function do you\nthink is served by the acid? The mucus protects the inner lining of the\nstomach fr om the action of the acid under nor mal conditions. W e\nFigure 5.6Figure 5.6Figure 5.6Figure 5.6Figure 5.6  Human alimentary canal\n2024-25\n\n--- Page 8 ---\nScience86\nhave often heard adults complaining about ‘acidity’. Can this be related\nto what has been discussed above?\nThe exit of food from the stomach is regulated by a sphincter muscle\nwhich releases it in small amounts into the small intestine. From the\nstomach, the food now enters the small intestine. This is the longest part\nof the alimentary canal which is fitted into a compact space because of\nextensive coiling. The length of the small intestine differs in various\nanimals depending on the food they eat. Herbivores eating grass need a\nlonger small intestine to allow the cellulose to be digested. Meat is easier\nto digest, hence carnivores like tigers have a shorter small intestine.\nThe small intestine is the site of the complete digestion of\ncarbohydrates, proteins and fats. It receives the secretions of the liver\nand pancreas for this purpose. The food coming from the stomach is\nacidic and has to be made alkaline for the pancreatic enzymes to act.\nBile juice from the liver accomplishes this in addition to acting on fats.\nFats are present in the intestine in the form of large globules which makes\nit difficult for enzymes to act on them. Bile salts break them down into\nsmaller globules increasing the efficiency of enzyme action. This is similar\nto the emulsifying action of soaps on dirt that we have learnt about in\nChapter 4. The pancreas secretes pancreatic juice which contains\nenzymes like trypsin for digesting proteins and lipase for breaking down\nemulsified fats. The walls of the small intestine contain glands which\nsecrete intestinal juice. The enzymes present in it finally convert the\nproteins to amino acids, complex carbohydrates into glucose and fats\ninto fatty acids and glycerol.\nDigested food is taken up by the walls of the intestine. The inner\nlining of the small intestine has numerous finger-like projections called\nvilli which increase the surface area for absorption. The villi are richly\nsupplied with blood vessels which take the absorbed food to each and\nevery cell of the body, where it is utilised for obtaining energy, building\nup new tissues and the repair of old tissues.\nThe unabsorbed food is sent into the large intestine where its wall\nabsorb more water from this material. The rest of the material is removed\nfrom the body via the anus. The exit of this waste material is regulated\nby the anal sphincter.\nMore to Know!\nDental caries\nDental caries or tooth decay causes gradual softening of enamel and dentine. It begins\nwhen bacteria acting on sugars produce acids that softens or demineralises the enamel.\nMasses of bacterial cells together with food particles stick to the teeth to form dental\nplaque. Saliva cannot reach the tooth surface to neutralise the acid as plaque covers\nthe teeth. Brushing the teeth after eating removes the plaque before the bacteria\nproduce acids. If untreated, microorganisms may invade the pulp, causing\ninflammation and infection.\n2024-25\n\n--- Page 9 ---\nLife Processes 87\n5.3 RESPIR5.3 RESPIR5.3 RESPIR5.3 RESPIR5.3 RESPIR AAA AATION TIONTION TIONTION\nActivity 5.4Activity 5.4Activity 5.4Activity 5.4Activity 5.4\n/square6Take some freshly prepared lime\nwater in a test tube.\n/square6Blow air through this lime water .\n/square6Note how long it takes for the lime\nwater to turn milky.\n/square6Use a syringe or pichkari  to pass air\nthrough some fresh lime water\ntaken in another test tube (Fig. 5.7).\n/square6Note how long it takes for this lime\nwater to turn milky.\n/square6What does this tell us about the\namount of carbon dioxide in the air\nthat we breathe out?"
    },
    {
      "id": "f2ea6bd3-061a-4e08-ab49-f35453b3ad11",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 5,
      "title": "1. What are the differences between autotrophic nutrition and heterotrophic",
      "topics": [],
      "start_page": 9,
      "end_page": 9,
      "content": "nutrition?"
    },
    {
      "id": "57a298fc-f7d7-4193-968b-c94dc06e9c9f",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 9,
      "title": "5. How is the small intestine designed to absorb digested food?",
      "topics": [],
      "start_page": 9,
      "end_page": 13,
      "content": "Tube\nTest tube containing\nlime waterLime\nwater\nRubber\ntube\n(a) (b)\nPichkari\nQUESTIONS\n?\nActivity 5.5Activity 5.5Activity 5.5Activity 5.5Activity 5.5\n/square6Take some fruit juice or sugar solution and add some yeast to\nthis. Take this mixture in a test tube fitted with a one-holed cork.\n/square6Fit the cork with a bent glass tube. Dip the free end of the glass\ntube into a test tube containing fr eshly prepared lime water .\n/square6What change is observed in the lime water and how long does it\ntake for this change to occur?\n/square6What does this tell us about the products of fermentation?\nWe have discussed nutrition in or\nganisms in the last section. The\nfood material taken in during the process of nutrition is used in cells to\nprovide energy for various life processes. Diverse organisms do this in\ndifferent ways – some use oxygen to break-down glucose completely\ninto carbon dioxide and water, some use other pathways that do not\ninvolve oxygen (Fig. 5.8). In all cases, the first step is the break-down of\nglucose, a six-carbon molecule, into a three-carbon molecule called\npyruvate. This pr ocess takes place in the cytoplasm. Further , the\npyruvate may be converted into ethanol and carbon dioxide. This process\ntakes place in yeast during fermentation. Since this process takes place\nin the absence of air (oxygen), it is called anaerobic respiration. Break-\ndown of pyruvate using oxygen takes place in the mitochondria. This\nFigure 5.7Figure 5.7Figure 5.7Figure 5.7Figure 5.7\n(a) Air being passed into lime water with a pichkari/\nsyringe, (b) air being exhaled into lime water\n2024-25\n\n--- Page 10 ---\nScience88\nprocess breaks up the three-carbon pyruvate molecule to give three\nmolecules of carbon dioxide. The other pr oduct is water . Since this\nprocess takes place in the presence of air (oxygen), it is called aerobic\nrespiration. The release of energy in this aerobic process is a lot greater\nthan in the anaerobic process. Sometimes, when there is a lack of oxygen\nin our muscle cells, another pathway for the break-down of pyruvate is\ntaken. Here the pyruvate is converted into lactic acid which is also a\nthree-carbon molecule. This build-up of lactic acid in our muscles during\nsudden activity causes cramps.\nFigure 5.8Figure 5.8Figure 5.8Figure 5.8Figure 5.8  Break-down of glucose by various pathways\nThe energy released during cellular respiration is immediately used\nto synthesise a molecule called ATP which is used to fuel all other\nactivities in the cell. In these processes, ATP is broken down giving rise\nto a fixed amount of energy which can drive the endothermic reactions\ntaking place in the cell.\nATP\nATP is the energy currency for most cellular processes. The energy released during\nthe process of respiration is used to make an ATP molecule from ADP and inorganic\nphosphate.\nEndothermic processes in the cell then use this ATP to drive the reactions. When the\nterminal phosphate linkage in A\nTP is broken using water, the energy equivalent to\n30.5 kJ/mol is released.\nThink of how a battery can provide energy for many different kinds of uses. It can be\nused to obtain mechanical energy, light energy, electrical energy and so on. Similarly,\nATP can be used in the cells for the contraction of muscles, protein synthesis,\nconduction of nervous impulses and many other activities.\nSince the aerobic respiration pathway depends on oxygen, aerobic\norganisms need to ensure that there is sufficient intake of oxygen. We\nhave seen that plants exchange gases through stomata, and the large\ninter-cellular spaces ensure that all cells are in contact with air. Carbon\ndioxide and oxygen are exchanged by diffusion here. They can go into\nMore to Know!\n2024-25\n\n--- Page 11 ---\nLife Processes 89\ncells, or away from them and out into the air. The direction of diffusion\ndepends upon the environmental conditions and the requirements of\nthe plant. At night, when there is no photosynthesis occurring, CO 2\nelimination is the major exchange activity going on. During the day,\nCO2 generated during respiration is used up for photosynthesis, hence\nthere is no CO2 release. Instead, oxygen release is the major event at\nthis time.\nAnimals have evolved different organs for the uptake of oxygen\nfrom the environment and for getting rid of the carbon dioxide\nproduced. Terrestrial animals can breathe the oxygen in the\natmosphere, but animals that live in water need to use the oxygen\ndissolved in water.\nActivity 5.6Activity 5.6Activity 5.6Activity 5.6Activity 5.6\n/square6Observe fish in an aquarium. They open and close their mouths\nand the gill-slits (or the operculum which covers the gill-slits)\nbehind their eyes also open and close. Are the timings of the\nopening and closing of the mouth and gill-slits coordinated in some\nmanner?\n/square6Count the number of times the fish opens and closes its mouth in\na minute.\n/square6Compare this to the number of times you breathe in and out in a\nminute.\nSince the amount of dissolved oxygen is fairly low compared\nto the amount of oxygen in the air, the rate of br\neathing in aquatic\norganisms is much faster than that seen in terrestrial organisms.\nFishes take in water through their mouths and force it past the\ngills where the dissolved oxygen is taken up by blood.\nTerrestrial organisms use the oxygen in the atmosphere for\nrespiration. This oxygen is absorbed by different organs in\ndifferent animals. All these organs have a structure that increases\nthe surface area which is in contact with the oxygen-rich\natmosphere. Since the exchange of oxygen and carbon dioxide\nhas to take place across this surface, this surface is very fine\nand delicate. In order to protect this surface, it is usually placed\nwithin the body, so there have to be passages that will take air\nto this area. In addition, there is a mechanism for moving the air\nin and out of this area where the oxygen is absorbed.\nIn human beings (Fig. 5.9), air is taken into the body through\nthe nostrils. The air passing through the nostrils is filtered by\nfine hairs that line the passage. The passage is also lined with\nmucus which helps in this process. From here, the air passes\nthrough the throat and into the lungs. Rings of cartilage are\npresent in the throat. These ensure that the air-passage does\nnot collapse.\nUsing tobacco directly or\nany product of tobacco in\nthe form of cigar, cigarettes,\nbidis, hookah, gutkha\n, etc.,\nis harmful. Use of tobacco\nmost commonly affects the\ntongue, lungs, heart and\nliver. Smokeless tobacco is\nalso a major risk factor for\nheart attacks, strokes,\npulmonary diseases and\nseveral forms of cancers.\nThere is a high incidence of\noral cancer in India due to\nthe chewing of tobacco in\nthe form of gutkha. Stay\nhealthy; just say NO to\ntobacco and its products!\nMore to Know!\n2024-25\n\n--- Page 12 ---\nScience90\nWithin the lungs, the passage divides into smaller and smaller\ntubes which finally terminate in balloon-like structures which\nare called alveoli (singular–alveolus). The alveoli provide a surface\nwhere the exchange of gases can take place. The walls of the alveoli\ncontain an extensive network of blood-vessels. As we have seen\nin earlier years, when we breathe in, we lift our ribs and flatten\nour diaphragm, and the chest cavity becomes larger as a result.\nBecause of this, air is sucked into the lungs and fills the expanded\nalveoli. The blood brings carbon dioxide from the rest of the body\nfor release into the alveoli, and the oxygen in the alveolar air is\ntaken up by blood in the alveolar blood vessels to be transported\nto all the cells in the body. During the breathing cycle, when air is\ntaken in and let out, the lungs always contain a residual volume\nof air so that there is sufficient time for oxygen to be absorbed\nand for the carbon dioxide to be released.\nWhen the body size of animals is large,  the diffusion pressure\nalone cannot take care of oxygen delivery to all parts of the body.\nInstead, respiratory pigments take up oxygen from the air in the\nlungs and carry it to tissues which are deficient in oxygen before\nreleasing it. In human beings, the respiratory pigment is\nhaemoglobin which has a very high affinity for oxygen. This pigment\nis present in the red blood corpuscles. Carbon dioxide is more\nsoluble in water than oxygen is and hence is mostly transported in\nthe dissolved form in our blood.\nFigure 5.9Figure 5.9Figure 5.9Figure 5.9Figure 5.9  Human respiratory system\nDo You Know?\nSmoking is injurious to\nhealth.\nLung cancer is one of\ncommon causes of\ndeaths in the world. The\nupper part of respiratory\ntract is provided with\nsmall hair -like\nstructures called cilia.\nThese cilia help to\nremove germs, dust and\nother harmful  particles\nfrom inhaled air .\nSmoking destroys these\nhair due to which germs,\ndust, smoke and other\nharmful chemicals enter\nlungs and cause\ninfection, cough and\neven lung cancer.\n2024-25\n\n--- Page 13 ---\nLife Processes 91\n5.4 TR\n5.4 TR5.4 TR 5.4 TR5.4 TR ANSPORT ANSPORTANSPORT ANSPORTANSPORT AAA AATION TIONTION TIONTION\n5.4.1 Transportation in Human Beings\nDo You Know?\n/square6If the alveolar surface were spread out, it would cover about 80 m2. How much\ndo you think the surface area of your body is? Consider how efficient exchange\nof gases becomes because of the large surface available for the exchange to take\nplace.\n/square6If diffusion were to move oxygen in our body, it is estimated that it would take 3\nyears for a molecule of oxygen to get to our toes from our lungs. Aren’t you glad\nthat we have haemoglobin?\nQUESTIONS\n?"
    },
    {
      "id": "d987cd18-1701-4099-b65c-73be87eda05f",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 10,
      "title": "1. What advantage over an aquatic organism does a terrestrial organism",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "have with regard to obtaining oxygen for respiration?"
    },
    {
      "id": "978de283-9bbd-4158-8637-04235c6d6d96",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 11,
      "title": "2. What are the different ways in which glucose is oxidised to provide",
      "topics": [],
      "start_page": 13,
      "end_page": 13,
      "content": "energy in various organisms?"
    },
    {
      "id": "1b49c04f-8ed6-4ab5-863a-39190106e24a",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 13,
      "title": "4. How are the lungs designed in human beings to maximise the area for",
      "topics": [],
      "start_page": 13,
      "end_page": 18,
      "content": "exchange of gases?\nActivity 5.7Activity 5.7Activity 5.7Activity 5.7Activity 5.7\n/square6Visit a health centre in your locality and find out what is the\nnormal range of haemoglobin content in human beings.\n/square6Is it the same for children and adults?\n/square6Is there any difference in the haemoglobin levels for men and\nwomen?\n/square6Visit a veterinary clinic in your locality. Find out what is the normal\nrange of haemoglobin content in an animal like the buffalo\nor cow.\n/square6Is this content different in calves, male and female animals?\n/square6Compare the difference seen in male and female human beings\nand animals.\n/square6How would the difference, if any, be explained?\nWe have seen in previous sections that blood transports food, oxygen\nand waste materials in our bodies. In Class IX, we learnt about blood\nbeing a fluid connective tissue. Blood consists of a fluid medium called\nplasma in which the cells are suspended. Plasma transports food, carbon\ndioxide and nitrogenous wastes in dissolved form. Oxygen is carried by\nthe red blood corpuscles. Many other substances like salts, are also\ntransported by the blood. We thus need a pumping organ to push blood\naround the body, a network of tubes to reach all the tissues and a system\nin place to ensure that this network can be repaired if damaged.\n2024-25\n\n--- Page 14 ---\nScience92\nThe heart is a muscular organ which is\nas big as our fist (Fig. 5.10). Because\nboth oxygen and carbon dioxide have to\nbe transported by the blood, the heart\nhas different chambers to prevent the\noxygen-rich blood from mixing with the\nblood containing carbon dioxide. The\ncarbon dioxide-rich blood has to reach\nthe lungs for the carbon dioxide to be\nremoved, and the oxygenated blood from\nthe lungs has to be brought back to the\nheart. This oxygen-rich blood is then\npumped to the rest of the body.\nWe can follow this pr ocess step by\nstep (Fig. 5.11). Oxygen-rich blood from\nthe lungs comes to the thin-walled upper\nchamber of the heart on the left, the left atrium. The left atrium relaxes\nwhen it is collecting this blood. It then contracts, while the next chamber,\nthe left ventricle, relaxes, so that the blood is transferred to it. When the\nmuscular left ventricle contracts in its turn, the blood is pumped out to\nthe body. De-oxygenated blood comes from the body to the upper\nchamber on the right, the right atrium, as it relaxes. As the right atrium\ncontracts, the corresponding lower chamber, the right ventricle, dilates.\nThis transfers blood to the right ventricle, which in turn pumps it to the\nlungs for oxygenation. Since ventricles have to pump blood into various\norgans, they have thicker muscular walls than the atria do. Valves ensure\nthat blood does not flow backwards when the atria or ventricles contract.\nOxygen enters the blood in the lungs\nThe separation of the right side and the left side of\nthe heart is useful to keep oxygenated and de-\noxygenated blood from mixing. Such separation\nallows a highly efficient supply of oxygen to the\nbody. This is useful in animals that have high\nenergy needs, such as birds and mammals, which\nconstantly use energy to maintain their body\ntemperature. In animals that do not use energy\nfor this purpose, the body temperature depends\non the temperature in the environment. Such\nanimals, like amphibians or  many reptiles have\nthree-chambered hearts, and tolerate some mixing\nof the oxygenated and de-oxygenated blood\nstreams. Fishes, on the other hand, have only two\nchambers to their hearts, and the blood is pumped\nto the gills, is oxygenated there, and passes directly\nto the rest of the body. Thus, blood goes only once\nthrough the heart in the fish during one cycle of\npassage through the body. On the other hand, it goes through the heart\ntwice during each cycle in other vertebrates. This is known as double\ncirculation.\nOur pump — the heart\nFigure 5.10Figure 5.10Figure 5.10Figure 5.10Figure 5.10\nSchematic sectional\nview of the human heart\nFigure 5.11Figure 5.11Figure 5.11Figure 5.11Figure 5.11\nSchematic representation of transport and exchange\nof oxygen and carbon dioxide\n2024-25\n\n--- Page 15 ---\nLife Processes 93\nMore to Know!\nBlood pressure is measured with an instrument called sphygmomanometer. High\nblood pressure is also called hypertension and is caused by the constriction of\narterioles, which results in increased resistance to blood flow. It can lead to the rupture\nof an artery and internal bleeding.\nBlood pressure\nThe force that blood exerts against the wall of a vessel is called blood pressure. This\npressure is much greater in arteries than in veins. The pressure of blood inside the\nartery during ventricular systole (contraction) is called systolic pressure and pressure\nin artery during ventricular diastole (relaxation) is called diastolic pressure. The normal\nsystolic pressure is about 120 mm of Hg and diastolic pressure is 80 mm of Hg.\nThe tubes – blood vessels\nArteries are the vessels which carry blood away from the heart to various\norgans of the body. Since the blood emerges from the heart under high\npressure, the arteries have thick, elastic walls. Veins collect the blood\nfrom different organs and bring it back to the heart. They do not need\nthick walls because the blood is no longer under pressure, instead they\nhave valves that ensure that the blood flows only in one direction.\nOn reaching an organ or tissue, the artery divides into smaller and\nsmaller vessels to bring the blood in contact with all the individual cells.\nThe smallest vessels have walls which are one-cell thick and are called\ncapillaries. Exchange of material between the blood and surrounding\ncells takes place across this thin wall. The capillaries then join together\nto form veins that convey the blood away from the organ or tissue.\nMaintenance by platelets\nWhat happens if this system of tubes develops a leak? Think about\nsituations when we are injured and start bleeding. Naturally the loss of\nblood from the system has to be minimised. In addition, leakage would\nlead to a loss of pressure which would reduce the efficiency of the\n2024-25\n\n--- Page 16 ---\nScience94\npumping system. To avoid this, the blood has platelet cells which circulate\naround the body and plug these leaks by helping to clot the blood at\nthese points of injury.\nLymph\nThere is another type of fluid also involved in transportation. This is\ncalled lymph or tissue fluid. Through the pores present in the walls of\ncapillaries some amount of plasma, proteins and blood cells escape into\nintercellular spaces in the tissues to form the tissue fluid or lymph. It is\nsimilar to the plasma of blood but colourless and contains less protein.\nLymph drains into lymphatic capillaries fr\nom the intercellular spaces,\nwhich join to form large lymph vessels that finally open into larger veins.\nLymph carries digested and absorbed fat from intestine and drains excess\nfluid from extra cellular space back into the blood.\n5.4.2 Transportation in Plants\nWe have discussed earlier how plants take in simple compounds such\nas CO2 and photosynthesise energy stored in their chlorophyll-containing\norgans, namely leaves. The other kinds of raw materials needed for\nbuilding plant bodies will also have to be taken up separately. For plants,\nthe soil is the nearest and richest source of raw materials like nitrogen,\nphosphorus and other minerals. The absorption of these substances\ntherefore occurs through the part in contact with the soil, namely roots.\nIf the distances between soil-contacting organs and chlorophyll-\ncontaining organs are small, energy and raw materials can easily diffuse\nto all parts of the plant body. But if these distances become large because\nof changes in plant body design, diffusion processes will not be sufficient\nto provide raw material in leaves and energy in roots. A proper system of\ntransportation is therefore essential in such situations.\nEnergy needs differ between different body designs. Plants do not\nmove, and plant bodies have a large proportion of dead cells in many\ntissues. As a result, plants have low energy needs, and can use relatively\nslow transport systems. The distances over which transport systems\nhave to operate, however, can be very large in plants such as very tall\ntrees.\nPlant transport systems will move energy stores from leaves and raw\nmaterials from roots. These two pathways are constructed as\nindependently organised conducting tubes. One, the xylem  moves water\nand minerals obtained from the soil. The other , phloem transports\nproducts of photosynthesis from the leaves where they are synthesised\nto other parts of the plant. We have studied the structure of these tissues\nin detail in Class IX.\nTransport of water\nIn xylem tissue, vessels and tracheids of the roots, stems and leaves are\ninterconnected to for m a continuous system of water -conducting\nchannels reaching all parts of the plant. At the roots, cells in contact\nwith the soil actively take up ions. This creates a difference in the\nconcentration of these ions between the root and the soil. Water, therefore,\n2024-25\n\n--- Page 17 ---\nLife Processes 95\nmoves into the root from the soil to eliminate this difference. This means\nthat there is steady movement of water into root xylem, creating a column\nof water that is steadily pushed upwards.\nHowever, this pressure by itself is unlikely to be enough to move\nwater over the heights that we commonly see in plants. Plants use another\nstrategy to move water in the xylem upwards to the highest points of the\nplant body.\nActivity 5.8Activity 5.8Activity 5.8Activity 5.8Activity 5.8\n/square6Take two small pots of approximately the same size and having\nthe same amount of soil. One should have a plant in it. Place a\nstick of the same height as the plant in the other pot.\n/square6Cover the soil in both pots with a plastic sheet so that moisture\ncannot escape by evaporation.\n/square6Cover both sets, one with the plant and the other with the stick,\nwith plastic sheets and place in bright sunlight for half an hour .\n/square6Do you observe any difference in the two cases?\nProvided that the plant has an adequate\nsupply of water, the water which is lost thr\nough the\nstomata is replaced by water from the xylem vessels\nin the leaf. In fact, evaporation of water molecules from\nthe cells of a leaf creates a suction which pulls water\nfrom the xylem cells of roots. The loss of water in the\nform of vapour from the aerial parts of the plant is\nknown as transpiration.\nThus, transpiration helps in the absorption and\nupward movement of water and minerals dissolved\nin it from roots to the leaves. It also helps in\ntemperature regulation. The effect of root pressure in\ntransport of water is more important at night. During\nthe day when the stomata are open, the transpiration\npull becomes the major driving force in the movement\nof water in the xylem.\nTransport of food and other substances\nSo far we have discussed the transport of water and minerals in plants.\nNow let us consider how the products of metabolic processes, particularly\nphotosynthesis, are moved from leaves, where they are formed, to other\nparts of the plant. This transport of soluble products of photosynthesis\nis called translocation and it occurs in the part of the vascular tissue\nknown as phloem. Besides the products of photosynthesis, the phloem\ntransports amino acids and other substances. These substances are\nespecially delivered to the storage organs of roots, fruits and seeds and\nto growing organs. The translocation of food and other substances takes\nplace in the sieve tubes with the help of adjacent companion cells both\nin upward and downward directions.\nUnlike transport in xylem which can be largely explained by simple\nphysical forces, the translocation in phloem is achieved by utilising\nFigure 5.12Figure 5.12Figure 5.12Figure 5.12Figure 5.12\nMovement of water during transpiration in a tree\n2024-25\n\n--- Page 18 ---\nScience96\nenergy. Material like sucrose is transferred into phloem tissue using\nenergy from ATP. This incr eases the osmotic pr essure of the tissue\ncausing water to move into it. This pressure moves the material in the\nphloem to tissues which have less pressure. This allows the phloem to\nmove material according to the plant’s needs. For example, in the spring,\nsugar stored in root or stem tissue would be transported to the buds\nwhich need energy to grow.\nQUESTIONS\n?"
    },
    {
      "id": "1e4018c3-584f-432e-a40a-35f1bb8adb3c",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 14,
      "title": "1. What are the components of the transport system in human beings?",
      "topics": [],
      "start_page": 18,
      "end_page": 18,
      "content": "What are the functions of these components?"
    },
    {
      "id": "524a303b-6d22-41a1-8e17-e753e8d2d9ec",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 15,
      "title": "2. Why is it necessary to separate oxygenated and deoxygenated blood in",
      "topics": [],
      "start_page": 18,
      "end_page": 18,
      "content": "mammals and birds?"
    },
    {
      "id": "59f4dd2b-e052-4849-a66e-552da18aeb13",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 16,
      "title": "3. What are the components of the transport system in highly organised",
      "topics": [],
      "start_page": 18,
      "end_page": 18,
      "content": "plants?"
    },
    {
      "id": "e917aaa9-02ec-466c-9980-e8a7379b5b61",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 18,
      "title": "5. How is food transported in plants?",
      "topics": [],
      "start_page": 18,
      "end_page": 21,
      "content": "5.5 EX\n5.5 EX5.5 EX 5.5 EX5.5 EX CRETION CRETIONCRETION CRETIONCRETION\nWe have already discussed how organisms get rid of gaseous wastes\ngenerated during photosynthesis or respiration. Other metabolic activities\ngenerate nitrogenous materials which need to be removed. The biological\nprocess involved in the removal of these harmful metabolic wastes from\nthe body is called excretion. Different organisms use varied strategies to\ndo this. Many unicellular organisms remove these wastes by simple\ndiffusion from the body surface into the surrounding\nwater. As we have seen in other processes, complex\nmulti-cellular organisms use specialised organs to\nperform the same function.\n5.5.1 Excretion in Human Beings\nThe excretory system of human beings (Fig. 5.13)\nincludes a pair of kidneys, a pair of ureters, a urinary\nbladder and a urethra. Kidneys are located in the\nabdomen, one on either side of the backbone. Urine\nproduced in the kidneys passes through the ureters\ninto the urinary bladder where it is stored until it is\nreleased through the urethra.\nHow is urine produced? The purpose of making\nurine is to filter out waste products from the blood.\nJust as CO2 is removed from the blood in the lungs,\nnitrogenous waste such as urea or uric acid are\nremoved from blood in the kidneys. It is then no\nsurprise that the basic filtration unit in the kidneys,\nFigure 5.13\nExcretory system in human beings\n2024-25\n\n--- Page 19 ---\nLife Processes 97\nlike in the lungs, is a cluster of very thin-walled blood\ncapillaries. Each capillary cluster in the kidney is\nassociated with the cup-shaped end of a coiled tube\ncalled Bowman’s capsule that collects the filtrate\n (Fig. 5.14). Each kidney has large numbers of these\nfiltration units called nephrons packed close together.\nSome substances in the initial filtrate, such as glucose,\namino acids, salts and a major amount of water, are\nselectively re-absorbed as the urine flows along the tube.\nThe amount of water re-absorbed depends on how much\nexcess water there is in the body, and on how much of\ndissolved waste there is to be excreted. The urine forming\nin each kidney eventually enters a long tube, the ureter,\nwhich connects the kidneys with the urinary bladder.\nUrine is stored in the urinary bladder until the pressure\nof the expanded bladder leads to the urge to pass it out\nthrough the urethra. The bladder is muscular, so it is\nunder nervous control, as we have discussed elsewhere.\nAs a result, we can usually control the urge to urinate.\nMore to Know!\nArtificial kidney (Hemodialysis)\nKidneys are vital organs for survival. Several factors like infections, injury or restricted\nblood flow to kidneys reduce the activity of kidneys. This leads to accumulation of\npoisonous wastes in the body, which can even lead to death. In case of kidney\nfailure, an artificial kidney can be used. An artificial kidney is a device to remove\nnitrogenous waste products from the blood through dialysis.\nArtificial kidneys contain a number of tubes with a semi-permeable lining, suspended\nin a tank filled with dialysing fluid.\nThis fluid has the same osmotic\npressure as blood, except that it is\ndevoid of nitrogenous wastes. The\npatient’s blood is passed through\nthese tubes. During this passage,\nthe waste products from the blood\npass into dialysing fluid by diffusion.\nThe purified blood is pumped back\ninto the patient. This is similar to the\nfunction of the kidney, but it is\ndifferent since there is no re-\nabsorption involved. Normally, in a\nhealthy adult, the initial filtrate in the\nkidneys is about 180 L daily.\nHowever , the volume actually\nexcreted is only a litre or two a day,\nbecause the remaining filtrate is re-\nabsorbed in the kidney tubules.\nFigure 5.14Figure 5.14Figure 5.14Figure 5.14Figure 5.14\nStructure of a nephron\n2024-25\n\n--- Page 20 ---\nScience98\n5.5.2 Excretion in Plants\nPlants use completely different\nstrategies for excretion than those\nof animals. Oxygen itself can be\nthought of as a waste product\ngenerated during photosynthesis!\nWe have discussed earlier how\nplants deal with oxygen as well as\nCO2. They can get rid of excess water\nby transpiration. For other wastes,\nplants use the fact that many of\ntheir tissues consist of dead cells,\nand that they can even lose some\nparts such as leaves. Many plant\nwaste products are stored in\ncellular vacuoles. Waste pr\noducts\nmay be stored in leaves that fall off.\nOther waste products are stored as\nresins and gums, especially in old\nxylem. Plants also excrete some\nwaste substances into the soil\naround them.\nWhat you have learnt\n/square6Movement of various types can be taken as an indication of life.\n/square6Maintenance of life requires processes like nutrition, respiration, transport of\nmaterials within the body and excretion of waste products.\n/square6Autotrophic nutrition involves the intake of simple inorganic materials from the\nenvironment and using an external energy source like the Sun to synthesise complex\nhigh-energy organic material.\n/square6Heterotrophic nutrition involves the intake of complex material prepared by other\norganisms.\n/square6In human beings, the food eaten is broken down by various steps along the\nalimentary canal and the digested food is absorbed in the small intestine to be sent\nto all cells in the body.\nThink it over!\nOrgan donation\nOrgan donation is a generous act of donating an\norgan to a person who suffers from non-function of\norgan(s). Donation of an organ may be done by the\nconsent of the donor and his/her family. Anyone\nregardless of age or gender can become an organ\nand tissue donor. Organ transplants can save or\ntransform the life of a person. Transplantation is\nrequired because recipient’s organ has been\ndamaged or has failed by disease or injury. In organ\ntransplantation the organ is surgically removed\nfrom one person (organ donor) and transplanted to\nanother person (the recipient). Common\ntransplantations include corneas, kidneys, heart,\nliver, pancreas, lungs, intestines and bone marrow.\nMost organ and tissue donations occur just after\nthe donor has died or when the doctor declares a\nperson brain dead. But some organs such as\nkidney, part of a liver, lung, etc., and tissues can be\ndonated while the donor is alive.\n?\nQUESTIONS"
    },
    {
      "id": "a7781876-e961-41dd-8feb-d1427ac8f47a",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 21,
      "title": "3. How is the amount of urine produced regulated?",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "2024-25\n\n--- Page 21 ---\nLife Processes 99\n/square6During the process of respiration, organic compounds such as glucose are broken\ndown to provide energy in the form of ATP. ATP is used to pr\novide energy for other\nreactions in the cell.\n/square6Respiration may be aerobic or anaerobic. Aerobic respiration makes more energy\navailable to the organism.\n/square6In human beings, the transport of materials such as oxygen, carbon dioxide, food\nand excretory products is a function of the circulatory system. The circulatory\nsystem consists of the heart, blood and blood vessels.\n/square6In highly differentiated plants, transport of water, minerals, food and other materials\nis a function of the vascular tissue which consists of xylem and phloem.\n/square6In human beings, excretory products in the form of soluble nitrogen compounds\nare removed by the nephrons in the kidneys.\n/square6Plants use a variety of techniques to get rid of waste material. For example, waste\nmaterial may be stored in the cell-vacuoles or as gum and resin, removed in the\nfalling leaves, or excreted into the surrounding soil.\nEXERCISES"
    },
    {
      "id": "4a317b79-0b1b-4980-9481-f5c1e8aaf1c2",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 22,
      "title": "1. The kidneys in human beings are a part of the system for",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "(a) nutrition. (c) excretion.\n(b) respiration. (d) transportation."
    },
    {
      "id": "a5be143d-b5c7-4308-9c76-482c249d6795",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 23,
      "title": "2. The xylem in plants are responsible for",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "(a) transport of water. (c) transport of amino acids.\n(b) transport of food. (d) transport of oxygen."
    },
    {
      "id": "a351496d-e74f-416f-a7e8-548e5f2343e6",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 24,
      "title": "3. The autotrophic mode of nutrition requires",
      "topics": [],
      "start_page": 21,
      "end_page": 22,
      "content": "(a) carbon dioxide and water. (c) sunlight.\n(b) chlorophyll. (d) all of the above."
    },
    {
      "id": "4e9f7aed-e910-4e80-9106-7f8c414b7aaa",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 25,
      "title": "4. The breakdown of pyruvate to give carbon dioxide, water and energy takes place in",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "(a) cytoplasm. (c) chloroplast.\n(b) mitochondria. (d) nucleus."
    },
    {
      "id": "4500e8b9-604a-4491-ad8b-0c2452c5a65c",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 28,
      "title": "7. What are the necessary conditions for autotrophic nutrition and what are its by-",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "products?"
    },
    {
      "id": "c1bba211-2257-4f09-bd05-c9a33748d0e5",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 29,
      "title": "8. What are the differences between aerobic and anaerobic respiration? Name some",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "organisms that use the anaerobic mode of respiration."
    },
    {
      "id": "a8c49372-5364-4308-93de-df59c6a878d4",
      "textbook_id": "015f0469-9f3b-4daa-ad1d-3d1d422a6ddc",
      "chapter_number": 34,
      "title": "13. Compare the functioning of alveoli in the lungs and nephrons in the kidneys with",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "respect to their structure and functioning.\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "3c571cbd-f766-474d-9fb1-4e06311c5b7d",
      "chapter_id": "606f4bc8-c9f3-4b4a-8a2f-353f5886332c",
      "chunk_index": 0,
      "content": "cellular organisms like humans?",
      "content_type": "text",
      "token_count": 7,
      "page_number": 3
    },
    {
      "id": "083e93a9-f10f-44f0-8128-a3482dc1f2c2",
      "chapter_id": "6f54de56-f0d2-4dbf-a6f1-dc75cb59b985",
      "chunk_index": 0,
      "content": "5.2 NUTRITION5.2 NUTRITION5.2 NUTRITION5.2 NUTRITION5.2 NUTRITION\nWhen we walk or ride a bicycle, we are using up energy. Even when we\nare not doing any apparent activity, energy is needed to maintain a\nstate of order in our body. We also need materials from outside in order\nto grow, develop, synthesise protein and other substances needed in\nthe body. This source of energy and materials is the food we eat.\nHow do living things get their food?\nThe general requirement for energy and materials is common in all\norganisms, but it is fulfilled in different ways. Some organisms use simple\nfood material obtained from inorganic sources in the form of carbon\ndioxide and water . These or ganisms, the autotr ophs, include gr\neen\nplants and some bacteria. Other organisms utilise complex substances.\nThese complex substances have to be broken down into simpler ones\nbefore they can be used for the upkeep and growth of the body. To\nachieve this, organisms use bio-catalysts called enzymes. Thus, the\nheterotrophs survival depends directly or indirectly on autotrophs.\nHeterotrophic organisms include animals and fungi.\n5.2.1 Autotrophic Nutrition\nCarbon and energy requirements of the autotrophic organism are\nfulfilled by photosynthesis. It is the process by which autotrophs take\nin substances from the outside and convert them into stored forms of\nenergy. This material is taken in the form of carbon dioxide and water\nwhich is converted into carbohydrates in the presence of sunlight and\nchlorophyll. Carbohydrates are utilised for providing energy to the plant.\nWe will study how this takes place in the next section. The carbohydrates\nwhich are not used immediately are stored in the form of starch, which\nserves as the internal energy reserve to be used as and when required\nby the plant. A somewhat similar situation is seen in us where some of\nthe energy derived from the food we eat is stored in our body in the form\nof glycogen.\n2024-25",
      "content_type": "text",
      "token_count": 486,
      "page_number": 3
    },
    {
      "id": "e0325ecc-6701-4d56-a90f-ec08bd0a43bc",
      "chapter_id": "6f54de56-f0d2-4dbf-a6f1-dc75cb59b985",
      "chunk_index": 1,
      "content": "--- Page 4 ---\nScience82\nLet us now see what actually happens during the process of\nphotosynthesis. The following events occur during this process –\nFigure 5.2Figure 5.2Figure 5.2Figure 5.2Figure 5.2\nVariegated leaf (a) before\nand (b) after starch test\nFigure 5.1Figure 5.1Figure 5.1Figure 5.1Figure 5.1\nCross-section of a leaf\nActivity 5.1Activity 5.1Activity 5.1Activity 5.1Activity 5.1\n/square6Take a potted plant with variegated leaves – for example, money plant\nor crotons.\n/square6Keep the plant in a dark room for three days so that all the starch\ngets used up.\n/square6Now keep the plant in sunlight for about six hours.\n/square6Pluck a leaf from the plant. Mark the green areas in it and trace them\non a sheet of paper .\n/square6Dip the leaf in boiling water for a few minutes.\n/square6After this, immerse it in a beaker containing alcohol.\n/square6Carefully place the above beaker in a water -bath and heat till the\nalcohol begins to boil.\n/square6What happens to the colour of the leaf? What is the colour of the\nsolution?\n/square6Now dip the leaf in a dilute solution of iodine for a few minutes.\n/square6Take out the leaf and rinse off the iodine solution.\n/square6Observe the colour of the leaf and compare this with the tracing of\nthe leaf done in the beginning (Fig. 5.2).\n/square6What can you conclude about the presence of starch in various areas\nof the leaf?\n(i) Absorption of light energy by\nchlorophyll.\n(ii) Conversion of light energy to chemical\nenergy and splitting of water molecules\ninto hydrogen and oxygen.\n(iii) Reduction of carbon dioxide to\ncarbohydrates.\nThese steps need not take place one after\nthe other immediately. For example, desert\nplants take up carbon dioxide at night and\nprepare an intermediate which is acted upon\nby the energy absorbed by the chlorophyll\nduring the day.\nLet us see how each of the components of\nthe above reaction are necessary for\nphotosynthesis.\nIf you carefully observe a cross-section of a\nleaf under the microscope (shown in Fig. 5.1),\nyou will notice that some cells contain green\ndots. These green dots are cell organelles called\nchloroplasts which contain chlorophyll. Let us\ndo an activity which demonstrates that\nchlorophyll is essential for photosynthesis.\n2024-25",
      "content_type": "example",
      "token_count": 559,
      "page_number": 3
    },
    {
      "id": "b5b85501-b6ae-4abe-a62b-ffed8d3aab12",
      "chapter_id": "6f54de56-f0d2-4dbf-a6f1-dc75cb59b985",
      "chunk_index": 2,
      "content": "--- Page 5 ---\nLife Processes 83\nNow, let us study how the plant\nobtains carbon dioxide. In Class IX,\nwe had talked about stomata (Fig. 5.3)\nwhich are tiny pores present on the\nsurface of the leaves. Massive amounts\nof gaseous exchange takes place in the\nleaves through these pores for the\npurpose of photosynthesis. But it is\nimportant to note here that exchange\nof gases occurs across the surface of\nstems, roots and leaves as well. Since\nlarge amounts of water can also be lost\nthrough these stomata, the plant\ncloses these pores when it does not\nneed carbon dioxide for photosynthesis. The opening and closing of the\npore is a function of the guard cells. The guard cells swell when water\nflows into them, causing the stomatal pore to open. Similarly the pore\ncloses if the guard cells shrink.\n/square6Take two healthy potted plants\nwhich are nearly the same size.\n/square6Keep them in a dark room for\nthree days.\n/square6Now place each plant on\nseparate glass plates. Place a\nwatch-glass containing potassium\nhydroxide by the side of one of\nthe plants. The potassium\nhydroxide is used to absorb\ncarbon dioxide.\n/square6Cover both plants with separate\nbell-jars as shown in Fig. 5.4.\n/square6Use vaseline to seal the bottom\nof the jars to the glass plates so\nthat the set-up is air -tight.\n/square6Keep the plants in sunlight for\nabout two hours.\n/square6Pluck a leaf from each plant and check for the presence of starch as in the above activity.\n/square6Do both the leaves show the presence of the same amount of starch?\n/square6What can you conclude from this activity?\nFigure 5.3 Figure 5.3 Figure 5.3 Figure 5.3 Figure 5.3 (a) Open and (b) closed stomatal pore\nActivity 5.2Activity 5.2Activity 5.2Activity 5.2Activity 5.2\nBased on the two activities performed above, can we design an\nexperiment to demonstrate that sunlight is essential for photosynthesis?\nSo far, we have talked about how autotr ophs meet their ener gy\nrequirements. But they also need other raw materials for building their\nbody. Water used in photosynthesis is taken up fr om the soil by the\nroots in terrestrial plants. Other materials like nitrogen, phosphorus,\niron and magnesium are taken up from the soil. Nitrogen is an essential\nelement used in the synthesis of proteins and other compounds. This is\nFigure 5.4 Experimental set-up (a) with potassium\nhydroxide (b) without potassium hydroxide\n(a) (b)\n2024-25",
      "content_type": "text",
      "token_count": 598,
      "page_number": 3
    },
    {
      "id": "815e6a91-aa1e-4b38-818a-d0c601761df2",
      "chapter_id": "6f54de56-f0d2-4dbf-a6f1-dc75cb59b985",
      "chunk_index": 3,
      "content": "--- Page 6 ---\nScience84\ntaken up in the form of inorganic nitrates or nitrites. Or it is taken up as\norganic compounds which have been prepared by bacteria from\natmospheric nitrogen.\n5.2.2 Heterotrophic Nutrition\nEach organism is adapted to its environment. The form of nutrition\ndiffers depending on the type and availability of food material as well\nas how it is obtained by the organism. For example, whether the food\nsource is stationary (such as grass) or mobile (such as a deer), would\nallow for differences in how the food is accessed and what is the nutritive\napparatus used by a cow and a lion. There is a range of strategies by\nwhich the food is taken in and used by the organism. Some organisms\nbreak-down the food material outside the body and then absorb it.\nExamples are fungi like bread moulds, yeast and mushrooms. Others\ntake in whole material and break it down inside their bodies. What can\nbe taken in and broken down depends on the body design and\nfunctioning. Some other organisms derive nutrition from plants or\nanimals without killing them. This parasitic nutritive strategy is used\nby a wide variety of or ganisms like cuscuta (amar -bel), ticks, lice,\nleeches and tape-worms.\n5.2.3 How do Organisms obtain their Nutrition?\nSince the food and the way it is obtained differ, the digestive system is\ndifferent in various organisms. In single-celled organisms, the food\nmay be taken in by the entire surface. But as the complexity of the\norganism increases, different parts become specialised to perform\ndifferent functions. For example, \nAmoeba takes in food using\ntemporary finger-like extensions of the cell surface which fuse over\nthe food particle forming a food-vacuole (Fig. 5.5). Inside the food-\nvacuole, complex substances are broken down into simpler ones\nwhich then diffuse into the cytoplasm. The remaining undigested\nmaterial is moved to the surface of the cell and thrown out. In\nParamoecium, which is also a unicellular organism, the cell has a\ndefinite shape and food is taken in at a specific spot. Food is moved\nto this spot by the movement of cilia which cover the entire surface\nof the cell.\n5.2.4 Nutrition in Human Beings\nThe alimentary canal is basically a long tube extending from the mouth\nto the anus. In Fig. 5.6, we can see that the tube has different parts.\nVarious regions are specialised to per form different functions. What\nhappens to the food once it enters our body? W e shall discuss this\nprocess here.\nFigure 5.5Figure 5.5Figure 5.5Figure 5.5Figure 5.5\nNutrition in Amoeba\n2024-25",
      "content_type": "example",
      "token_count": 635,
      "page_number": 3
    },
    {
      "id": "18197c97-3878-462f-880b-5512e887d44d",
      "chapter_id": "6f54de56-f0d2-4dbf-a6f1-dc75cb59b985",
      "chunk_index": 4,
      "content": "--- Page 7 ---\nLife Processes 85\nActivity 5.3Activity 5.3Activity 5.3Activity 5.3Activity 5.3\n/square6Take 1 mL starch solution (1%) in two test tubes (A and B).\n/square6Add 1 mL saliva to test tube A and leave both test tubes undisturbed\nfor 20-30 minutes.\n/square6Now add a few drops of dilute iodine solution to the test tubes.\n/square6In which test tube do you observe a colour change?\n/square6What does this indicate about the presence or absence of starch\nin the two test tubes?\n/square6What does this tell us about the action of saliva on starch?\nWe eat various types of food which has to pass through the same\ndigestive tract. Naturally the food has to be processed to generate\nparticles which are small and of the same texture. This is achieved by\ncrushing the food with our teeth. Since the lining of the canal is soft, the\nfood is also wetted to make its passage smooth. When we eat something\nwe like, our mouth ‘waters’. This is actually not only water, but a fluid\ncalled saliva secreted by the salivary glands. Another aspect of the food\nwe ingest is its complex nature. If it is to be absorbed from the alimentary\ncanal, it has to be broken into smaller molecules. This is done with the\nhelp of biological catalysts called\nenzymes. The saliva contains an\nenzyme called salivary amylase that\nbreaks down starch which is a complex\nmolecule to give simple sugar. The food\nis mixed thoroughly with saliva and\nmoved around the mouth while\nchewing by the muscular tongue.\nIt is necessary to move the food in\na regulated manner along the digestive\ntube so that it can be processed\nproperly in each part. The lining of\ncanal has muscles that contract\nrhythmically in order to push the food\nforward. These peristaltic movements\noccur all along the gut.\nFrom the mouth, the food is taken\nto the stomach through the food-pipe\nor oesophagus. The stomach is a large\norgan which expands when food\nenters it. The muscular walls of the\nstomach help in mixing the food\nthoroughly with more digestive juices.\nThe digestion in stomach is taken\ncare of by the gastric glands present in the wall of the stomach. These\nrelease hydrochloric acid, a protein digesting enzyme called pepsin,\nand mucus. The hydrochloric acid creates an acidic medium which\nfacilitates the action of the enzyme pepsin. What other function do you\nthink is served by the acid? The mucus protects the inner lining of the\nstomach fr om the action of the acid under nor mal conditions. W e\nFigure 5.6Figure 5.6Figure 5.6Figure 5.6Figure 5.6  Human alimentary canal\n2024-25",
      "content_type": "text",
      "token_count": 634,
      "page_number": 3
    },
    {
      "id": "3a44dc63-eb33-4929-9715-b09c3e82248c",
      "chapter_id": "6f54de56-f0d2-4dbf-a6f1-dc75cb59b985",
      "chunk_index": 5,
      "content": "--- Page 8 ---\nScience86\nhave often heard adults complaining about ‘acidity’. Can this be related\nto what has been discussed above?\nThe exit of food from the stomach is regulated by a sphincter muscle\nwhich releases it in small amounts into the small intestine. From the\nstomach, the food now enters the small intestine. This is the longest part\nof the alimentary canal which is fitted into a compact space because of\nextensive coiling. The length of the small intestine differs in various\nanimals depending on the food they eat. Herbivores eating grass need a\nlonger small intestine to allow the cellulose to be digested. Meat is easier\nto digest, hence carnivores like tigers have a shorter small intestine.\nThe small intestine is the site of the complete digestion of\ncarbohydrates, proteins and fats. It receives the secretions of the liver\nand pancreas for this purpose. The food coming from the stomach is\nacidic and has to be made alkaline for the pancreatic enzymes to act.\nBile juice from the liver accomplishes this in addition to acting on fats.\nFats are present in the intestine in the form of large globules which makes\nit difficult for enzymes to act on them. Bile salts break them down into\nsmaller globules increasing the efficiency of enzyme action. This is similar\nto the emulsifying action of soaps on dirt that we have learnt about in\nChapter 4. The pancreas secretes pancreatic juice which contains\nenzymes like trypsin for digesting proteins and lipase for breaking down\nemulsified fats. The walls of the small intestine contain glands which\nsecrete intestinal juice. The enzymes present in it finally convert the\nproteins to amino acids, complex carbohydrates into glucose and fats\ninto fatty acids and glycerol.\nDigested food is taken up by the walls of the intestine. The inner\nlining of the small intestine has numerous finger-like projections called\nvilli which increase the surface area for absorption. The villi are richly\nsupplied with blood vessels which take the absorbed food to each and\nevery cell of the body, where it is utilised for obtaining energy, building\nup new tissues and the repair of old tissues.\nThe unabsorbed food is sent into the large intestine where its wall\nabsorb more water from this material. The rest of the material is removed\nfrom the body via the anus. The exit of this waste material is regulated\nby the anal sphincter.\nMore to Know!\nDental caries\nDental caries or tooth decay causes gradual softening of enamel and dentine. It begins\nwhen bacteria acting on sugars produce acids that softens or demineralises the enamel.\nMasses of bacterial cells together with food particles stick to the teeth to form dental\nplaque. Saliva cannot reach the tooth surface to neutralise the acid as plaque covers\nthe teeth. Brushing the teeth after eating removes the plaque before the bacteria\nproduce acids. If untreated, microorganisms may invade the pulp, causing\ninflammation and infection.\n2024-25",
      "content_type": "text",
      "token_count": 737,
      "page_number": 3
    },
    {
      "id": "c76417aa-40ef-4143-ade1-54bd7b508aa8",
      "chapter_id": "6f54de56-f0d2-4dbf-a6f1-dc75cb59b985",
      "chunk_index": 6,
      "content": "--- Page 9 ---\nLife Processes 87\n5.3 RESPIR5.3 RESPIR5.3 RESPIR5.3 RESPIR5.3 RESPIR AAA AATION TIONTION TIONTION\nActivity 5.4Activity 5.4Activity 5.4Activity 5.4Activity 5.4\n/square6Take some freshly prepared lime\nwater in a test tube.\n/square6Blow air through this lime water .\n/square6Note how long it takes for the lime\nwater to turn milky.\n/square6Use a syringe or pichkari  to pass air\nthrough some fresh lime water\ntaken in another test tube (Fig. 5.7).\n/square6Note how long it takes for this lime\nwater to turn milky.\n/square6What does this tell us about the\namount of carbon dioxide in the air\nthat we breathe out?",
      "content_type": "text",
      "token_count": 155,
      "page_number": 9
    },
    {
      "id": "16f8fcd5-220d-4a96-bdf4-cf3faed86979",
      "chapter_id": "f2ea6bd3-061a-4e08-ab49-f35453b3ad11",
      "chunk_index": 0,
      "content": "nutrition?",
      "content_type": "text",
      "token_count": 2,
      "page_number": 9
    },
    {
      "id": "f8e6fad4-e9df-41b5-b08a-3fa140ef32d1",
      "chapter_id": "57a298fc-f7d7-4193-968b-c94dc06e9c9f",
      "chunk_index": 0,
      "content": "Tube\nTest tube containing\nlime waterLime\nwater\nRubber\ntube\n(a) (b)\nPichkari\nQUESTIONS\n?\nActivity 5.5Activity 5.5Activity 5.5Activity 5.5Activity 5.5\n/square6Take some fruit juice or sugar solution and add some yeast to\nthis. Take this mixture in a test tube fitted with a one-holed cork.\n/square6Fit the cork with a bent glass tube. Dip the free end of the glass\ntube into a test tube containing fr eshly prepared lime water .\n/square6What change is observed in the lime water and how long does it\ntake for this change to occur?\n/square6What does this tell us about the products of fermentation?\nWe have discussed nutrition in or\nganisms in the last section. The\nfood material taken in during the process of nutrition is used in cells to\nprovide energy for various life processes. Diverse organisms do this in\ndifferent ways – some use oxygen to break-down glucose completely\ninto carbon dioxide and water, some use other pathways that do not\ninvolve oxygen (Fig. 5.8). In all cases, the first step is the break-down of\nglucose, a six-carbon molecule, into a three-carbon molecule called\npyruvate. This pr ocess takes place in the cytoplasm. Further , the\npyruvate may be converted into ethanol and carbon dioxide. This process\ntakes place in yeast during fermentation. Since this process takes place\nin the absence of air (oxygen), it is called anaerobic respiration. Break-\ndown of pyruvate using oxygen takes place in the mitochondria. This\nFigure 5.7Figure 5.7Figure 5.7Figure 5.7Figure 5.7\n(a) Air being passed into lime water with a pichkari/\nsyringe, (b) air being exhaled into lime water\n2024-25",
      "content_type": "exercise",
      "token_count": 400,
      "page_number": 9
    },
    {
      "id": "06cbf6ce-3026-475e-8370-62cb49585c93",
      "chapter_id": "57a298fc-f7d7-4193-968b-c94dc06e9c9f",
      "chunk_index": 1,
      "content": "--- Page 10 ---\nScience88\nprocess breaks up the three-carbon pyruvate molecule to give three\nmolecules of carbon dioxide. The other pr oduct is water . Since this\nprocess takes place in the presence of air (oxygen), it is called aerobic\nrespiration. The release of energy in this aerobic process is a lot greater\nthan in the anaerobic process. Sometimes, when there is a lack of oxygen\nin our muscle cells, another pathway for the break-down of pyruvate is\ntaken. Here the pyruvate is converted into lactic acid which is also a\nthree-carbon molecule. This build-up of lactic acid in our muscles during\nsudden activity causes cramps.\nFigure 5.8Figure 5.8Figure 5.8Figure 5.8Figure 5.8  Break-down of glucose by various pathways\nThe energy released during cellular respiration is immediately used\nto synthesise a molecule called ATP which is used to fuel all other\nactivities in the cell. In these processes, ATP is broken down giving rise\nto a fixed amount of energy which can drive the endothermic reactions\ntaking place in the cell.\nATP\nATP is the energy currency for most cellular processes. The energy released during\nthe process of respiration is used to make an ATP molecule from ADP and inorganic\nphosphate.\nEndothermic processes in the cell then use this ATP to drive the reactions. When the\nterminal phosphate linkage in A\nTP is broken using water, the energy equivalent to\n30.5 kJ/mol is released.\nThink of how a battery can provide energy for many different kinds of uses. It can be\nused to obtain mechanical energy, light energy, electrical energy and so on. Similarly,\nATP can be used in the cells for the contraction of muscles, protein synthesis,\nconduction of nervous impulses and many other activities.\nSince the aerobic respiration pathway depends on oxygen, aerobic\norganisms need to ensure that there is sufficient intake of oxygen. We\nhave seen that plants exchange gases through stomata, and the large\ninter-cellular spaces ensure that all cells are in contact with air. Carbon\ndioxide and oxygen are exchanged by diffusion here. They can go into\nMore to Know!\n2024-25",
      "content_type": "text",
      "token_count": 522,
      "page_number": 9
    },
    {
      "id": "5c588977-070d-48f1-ac09-aca60f062d1a",
      "chapter_id": "57a298fc-f7d7-4193-968b-c94dc06e9c9f",
      "chunk_index": 2,
      "content": "--- Page 11 ---\nLife Processes 89\ncells, or away from them and out into the air. The direction of diffusion\ndepends upon the environmental conditions and the requirements of\nthe plant. At night, when there is no photosynthesis occurring, CO 2\nelimination is the major exchange activity going on. During the day,\nCO2 generated during respiration is used up for photosynthesis, hence\nthere is no CO2 release. Instead, oxygen release is the major event at\nthis time.\nAnimals have evolved different organs for the uptake of oxygen\nfrom the environment and for getting rid of the carbon dioxide\nproduced. Terrestrial animals can breathe the oxygen in the\natmosphere, but animals that live in water need to use the oxygen\ndissolved in water.\nActivity 5.6Activity 5.6Activity 5.6Activity 5.6Activity 5.6\n/square6Observe fish in an aquarium. They open and close their mouths\nand the gill-slits (or the operculum which covers the gill-slits)\nbehind their eyes also open and close. Are the timings of the\nopening and closing of the mouth and gill-slits coordinated in some\nmanner?\n/square6Count the number of times the fish opens and closes its mouth in\na minute.\n/square6Compare this to the number of times you breathe in and out in a\nminute.\nSince the amount of dissolved oxygen is fairly low compared\nto the amount of oxygen in the air, the rate of br\neathing in aquatic\norganisms is much faster than that seen in terrestrial organisms.\nFishes take in water through their mouths and force it past the\ngills where the dissolved oxygen is taken up by blood.\nTerrestrial organisms use the oxygen in the atmosphere for\nrespiration. This oxygen is absorbed by different organs in\ndifferent animals. All these organs have a structure that increases\nthe surface area which is in contact with the oxygen-rich\natmosphere. Since the exchange of oxygen and carbon dioxide\nhas to take place across this surface, this surface is very fine\nand delicate. In order to protect this surface, it is usually placed\nwithin the body, so there have to be passages that will take air\nto this area. In addition, there is a mechanism for moving the air\nin and out of this area where the oxygen is absorbed.\nIn human beings (Fig. 5.9), air is taken into the body through\nthe nostrils. The air passing through the nostrils is filtered by\nfine hairs that line the passage. The passage is also lined with\nmucus which helps in this process. From here, the air passes\nthrough the throat and into the lungs. Rings of cartilage are\npresent in the throat. These ensure that the air-passage does\nnot collapse.\nUsing tobacco directly or\nany product of tobacco in\nthe form of cigar, cigarettes,\nbidis, hookah, gutkha\n, etc.,\nis harmful. Use of tobacco\nmost commonly affects the\ntongue, lungs, heart and\nliver. Smokeless tobacco is\nalso a major risk factor for\nheart attacks, strokes,\npulmonary diseases and\nseveral forms of cancers.\nThere is a high incidence of\noral cancer in India due to\nthe chewing of tobacco in\nthe form of gutkha. Stay\nhealthy; just say NO to\ntobacco and its products!\nMore to Know!\n2024-25",
      "content_type": "exercise",
      "token_count": 766,
      "page_number": 9
    },
    {
      "id": "76a523c3-0a22-4117-aaef-32504f5430d2",
      "chapter_id": "57a298fc-f7d7-4193-968b-c94dc06e9c9f",
      "chunk_index": 3,
      "content": "--- Page 12 ---\nScience90\nWithin the lungs, the passage divides into smaller and smaller\ntubes which finally terminate in balloon-like structures which\nare called alveoli (singular–alveolus). The alveoli provide a surface\nwhere the exchange of gases can take place. The walls of the alveoli\ncontain an extensive network of blood-vessels. As we have seen\nin earlier years, when we breathe in, we lift our ribs and flatten\nour diaphragm, and the chest cavity becomes larger as a result.\nBecause of this, air is sucked into the lungs and fills the expanded\nalveoli. The blood brings carbon dioxide from the rest of the body\nfor release into the alveoli, and the oxygen in the alveolar air is\ntaken up by blood in the alveolar blood vessels to be transported\nto all the cells in the body. During the breathing cycle, when air is\ntaken in and let out, the lungs always contain a residual volume\nof air so that there is sufficient time for oxygen to be absorbed\nand for the carbon dioxide to be released.\nWhen the body size of animals is large,  the diffusion pressure\nalone cannot take care of oxygen delivery to all parts of the body.\nInstead, respiratory pigments take up oxygen from the air in the\nlungs and carry it to tissues which are deficient in oxygen before\nreleasing it. In human beings, the respiratory pigment is\nhaemoglobin which has a very high affinity for oxygen. This pigment\nis present in the red blood corpuscles. Carbon dioxide is more\nsoluble in water than oxygen is and hence is mostly transported in\nthe dissolved form in our blood.\nFigure 5.9Figure 5.9Figure 5.9Figure 5.9Figure 5.9  Human respiratory system\nDo You Know?\nSmoking is injurious to\nhealth.\nLung cancer is one of\ncommon causes of\ndeaths in the world. The\nupper part of respiratory\ntract is provided with\nsmall hair -like\nstructures called cilia.\nThese cilia help to\nremove germs, dust and\nother harmful  particles\nfrom inhaled air .\nSmoking destroys these\nhair due to which germs,\ndust, smoke and other\nharmful chemicals enter\nlungs and cause\ninfection, cough and\neven lung cancer.\n2024-25\n\n--- Page 13 ---\nLife Processes 91\n5.4 TR\n5.4 TR5.4 TR 5.4 TR5.4 TR ANSPORT ANSPORTANSPORT ANSPORTANSPORT AAA AATION TIONTION TIONTION\n5.4.1 Transportation in Human Beings\nDo You Know?\n/square6If the alveolar surface were spread out, it would cover about 80 m2. How much\ndo you think the surface area of your body is? Consider how efficient exchange\nof gases becomes because of the large surface available for the exchange to take\nplace.\n/square6If diffusion were to move oxygen in our body, it is estimated that it would take 3\nyears for a molecule of oxygen to get to our toes from our lungs. Aren’t you glad\nthat we have haemoglobin?\nQUESTIONS\n?",
      "content_type": "exercise",
      "token_count": 680,
      "page_number": 13
    },
    {
      "id": "2e2c81b0-f207-43ac-8e6c-75496d701ec2",
      "chapter_id": "d987cd18-1701-4099-b65c-73be87eda05f",
      "chunk_index": 0,
      "content": "have with regard to obtaining oxygen for respiration?",
      "content_type": "text",
      "token_count": 13,
      "page_number": 13
    },
    {
      "id": "94526355-07a6-4004-bf47-a6128d36de66",
      "chapter_id": "978de283-9bbd-4158-8637-04235c6d6d96",
      "chunk_index": 0,
      "content": "energy in various organisms?",
      "content_type": "text",
      "token_count": 7,
      "page_number": 13
    },
    {
      "id": "682729dd-4321-46d5-bbd6-e9d412e57746",
      "chapter_id": "1b49c04f-8ed6-4ab5-863a-39190106e24a",
      "chunk_index": 0,
      "content": "exchange of gases?\nActivity 5.7Activity 5.7Activity 5.7Activity 5.7Activity 5.7\n/square6Visit a health centre in your locality and find out what is the\nnormal range of haemoglobin content in human beings.\n/square6Is it the same for children and adults?\n/square6Is there any difference in the haemoglobin levels for men and\nwomen?\n/square6Visit a veterinary clinic in your locality. Find out what is the normal\nrange of haemoglobin content in an animal like the buffalo\nor cow.\n/square6Is this content different in calves, male and female animals?\n/square6Compare the difference seen in male and female human beings\nand animals.\n/square6How would the difference, if any, be explained?\nWe have seen in previous sections that blood transports food, oxygen\nand waste materials in our bodies. In Class IX, we learnt about blood\nbeing a fluid connective tissue. Blood consists of a fluid medium called\nplasma in which the cells are suspended. Plasma transports food, carbon\ndioxide and nitrogenous wastes in dissolved form. Oxygen is carried by\nthe red blood corpuscles. Many other substances like salts, are also\ntransported by the blood. We thus need a pumping organ to push blood\naround the body, a network of tubes to reach all the tissues and a system\nin place to ensure that this network can be repaired if damaged.\n2024-25",
      "content_type": "exercise",
      "token_count": 330,
      "page_number": 13
    },
    {
      "id": "f73c76d8-9849-4b66-854a-bf1c35737a4d",
      "chapter_id": "1b49c04f-8ed6-4ab5-863a-39190106e24a",
      "chunk_index": 1,
      "content": "--- Page 14 ---\nScience92\nThe heart is a muscular organ which is\nas big as our fist (Fig. 5.10). Because\nboth oxygen and carbon dioxide have to\nbe transported by the blood, the heart\nhas different chambers to prevent the\noxygen-rich blood from mixing with the\nblood containing carbon dioxide. The\ncarbon dioxide-rich blood has to reach\nthe lungs for the carbon dioxide to be\nremoved, and the oxygenated blood from\nthe lungs has to be brought back to the\nheart. This oxygen-rich blood is then\npumped to the rest of the body.\nWe can follow this pr ocess step by\nstep (Fig. 5.11). Oxygen-rich blood from\nthe lungs comes to the thin-walled upper\nchamber of the heart on the left, the left atrium. The left atrium relaxes\nwhen it is collecting this blood. It then contracts, while the next chamber,\nthe left ventricle, relaxes, so that the blood is transferred to it. When the\nmuscular left ventricle contracts in its turn, the blood is pumped out to\nthe body. De-oxygenated blood comes from the body to the upper\nchamber on the right, the right atrium, as it relaxes. As the right atrium\ncontracts, the corresponding lower chamber, the right ventricle, dilates.\nThis transfers blood to the right ventricle, which in turn pumps it to the\nlungs for oxygenation. Since ventricles have to pump blood into various\norgans, they have thicker muscular walls than the atria do. Valves ensure\nthat blood does not flow backwards when the atria or ventricles contract.\nOxygen enters the blood in the lungs\nThe separation of the right side and the left side of\nthe heart is useful to keep oxygenated and de-\noxygenated blood from mixing. Such separation\nallows a highly efficient supply of oxygen to the\nbody. This is useful in animals that have high\nenergy needs, such as birds and mammals, which\nconstantly use energy to maintain their body\ntemperature. In animals that do not use energy\nfor this purpose, the body temperature depends\non the temperature in the environment. Such\nanimals, like amphibians or  many reptiles have\nthree-chambered hearts, and tolerate some mixing\nof the oxygenated and de-oxygenated blood\nstreams. Fishes, on the other hand, have only two\nchambers to their hearts, and the blood is pumped\nto the gills, is oxygenated there, and passes directly\nto the rest of the body. Thus, blood goes only once\nthrough the heart in the fish during one cycle of\npassage through the body. On the other hand, it goes through the heart\ntwice during each cycle in other vertebrates. This is known as double\ncirculation.\nOur pump — the heart\nFigure 5.10Figure 5.10Figure 5.10Figure 5.10Figure 5.10\nSchematic sectional\nview of the human heart\nFigure 5.11Figure 5.11Figure 5.11Figure 5.11Figure 5.11\nSchematic representation of transport and exchange\nof oxygen and carbon dioxide\n2024-25",
      "content_type": "text",
      "token_count": 694,
      "page_number": 13
    },
    {
      "id": "4b4c01fc-25ad-43ff-b746-e6addf73307e",
      "chapter_id": "1b49c04f-8ed6-4ab5-863a-39190106e24a",
      "chunk_index": 2,
      "content": "--- Page 15 ---\nLife Processes 93\nMore to Know!\nBlood pressure is measured with an instrument called sphygmomanometer. High\nblood pressure is also called hypertension and is caused by the constriction of\narterioles, which results in increased resistance to blood flow. It can lead to the rupture\nof an artery and internal bleeding.\nBlood pressure\nThe force that blood exerts against the wall of a vessel is called blood pressure. This\npressure is much greater in arteries than in veins. The pressure of blood inside the\nartery during ventricular systole (contraction) is called systolic pressure and pressure\nin artery during ventricular diastole (relaxation) is called diastolic pressure. The normal\nsystolic pressure is about 120 mm of Hg and diastolic pressure is 80 mm of Hg.\nThe tubes – blood vessels\nArteries are the vessels which carry blood away from the heart to various\norgans of the body. Since the blood emerges from the heart under high\npressure, the arteries have thick, elastic walls. Veins collect the blood\nfrom different organs and bring it back to the heart. They do not need\nthick walls because the blood is no longer under pressure, instead they\nhave valves that ensure that the blood flows only in one direction.\nOn reaching an organ or tissue, the artery divides into smaller and\nsmaller vessels to bring the blood in contact with all the individual cells.\nThe smallest vessels have walls which are one-cell thick and are called\ncapillaries. Exchange of material between the blood and surrounding\ncells takes place across this thin wall. The capillaries then join together\nto form veins that convey the blood away from the organ or tissue.\nMaintenance by platelets\nWhat happens if this system of tubes develops a leak? Think about\nsituations when we are injured and start bleeding. Naturally the loss of\nblood from the system has to be minimised. In addition, leakage would\nlead to a loss of pressure which would reduce the efficiency of the\n2024-25",
      "content_type": "text",
      "token_count": 493,
      "page_number": 13
    },
    {
      "id": "69c8eb82-b3cf-4c0b-9ea0-9cfcaf852f8a",
      "chapter_id": "1b49c04f-8ed6-4ab5-863a-39190106e24a",
      "chunk_index": 3,
      "content": "--- Page 16 ---\nScience94\npumping system. To avoid this, the blood has platelet cells which circulate\naround the body and plug these leaks by helping to clot the blood at\nthese points of injury.\nLymph\nThere is another type of fluid also involved in transportation. This is\ncalled lymph or tissue fluid. Through the pores present in the walls of\ncapillaries some amount of plasma, proteins and blood cells escape into\nintercellular spaces in the tissues to form the tissue fluid or lymph. It is\nsimilar to the plasma of blood but colourless and contains less protein.\nLymph drains into lymphatic capillaries fr\nom the intercellular spaces,\nwhich join to form large lymph vessels that finally open into larger veins.\nLymph carries digested and absorbed fat from intestine and drains excess\nfluid from extra cellular space back into the blood.\n5.4.2 Transportation in Plants\nWe have discussed earlier how plants take in simple compounds such\nas CO2 and photosynthesise energy stored in their chlorophyll-containing\norgans, namely leaves. The other kinds of raw materials needed for\nbuilding plant bodies will also have to be taken up separately. For plants,\nthe soil is the nearest and richest source of raw materials like nitrogen,\nphosphorus and other minerals. The absorption of these substances\ntherefore occurs through the part in contact with the soil, namely roots.\nIf the distances between soil-contacting organs and chlorophyll-\ncontaining organs are small, energy and raw materials can easily diffuse\nto all parts of the plant body. But if these distances become large because\nof changes in plant body design, diffusion processes will not be sufficient\nto provide raw material in leaves and energy in roots. A proper system of\ntransportation is therefore essential in such situations.\nEnergy needs differ between different body designs. Plants do not\nmove, and plant bodies have a large proportion of dead cells in many\ntissues. As a result, plants have low energy needs, and can use relatively\nslow transport systems. The distances over which transport systems\nhave to operate, however, can be very large in plants such as very tall\ntrees.\nPlant transport systems will move energy stores from leaves and raw\nmaterials from roots. These two pathways are constructed as\nindependently organised conducting tubes. One, the xylem  moves water\nand minerals obtained from the soil. The other , phloem transports\nproducts of photosynthesis from the leaves where they are synthesised\nto other parts of the plant. We have studied the structure of these tissues\nin detail in Class IX.\nTransport of water\nIn xylem tissue, vessels and tracheids of the roots, stems and leaves are\ninterconnected to for m a continuous system of water -conducting\nchannels reaching all parts of the plant. At the roots, cells in contact\nwith the soil actively take up ions. This creates a difference in the\nconcentration of these ions between the root and the soil. Water, therefore,\n2024-25",
      "content_type": "text",
      "token_count": 741,
      "page_number": 13
    },
    {
      "id": "058936e7-ea6d-44da-a115-b319e4bc4b39",
      "chapter_id": "1b49c04f-8ed6-4ab5-863a-39190106e24a",
      "chunk_index": 4,
      "content": "--- Page 17 ---\nLife Processes 95\nmoves into the root from the soil to eliminate this difference. This means\nthat there is steady movement of water into root xylem, creating a column\nof water that is steadily pushed upwards.\nHowever, this pressure by itself is unlikely to be enough to move\nwater over the heights that we commonly see in plants. Plants use another\nstrategy to move water in the xylem upwards to the highest points of the\nplant body.\nActivity 5.8Activity 5.8Activity 5.8Activity 5.8Activity 5.8\n/square6Take two small pots of approximately the same size and having\nthe same amount of soil. One should have a plant in it. Place a\nstick of the same height as the plant in the other pot.\n/square6Cover the soil in both pots with a plastic sheet so that moisture\ncannot escape by evaporation.\n/square6Cover both sets, one with the plant and the other with the stick,\nwith plastic sheets and place in bright sunlight for half an hour .\n/square6Do you observe any difference in the two cases?\nProvided that the plant has an adequate\nsupply of water, the water which is lost thr\nough the\nstomata is replaced by water from the xylem vessels\nin the leaf. In fact, evaporation of water molecules from\nthe cells of a leaf creates a suction which pulls water\nfrom the xylem cells of roots. The loss of water in the\nform of vapour from the aerial parts of the plant is\nknown as transpiration.\nThus, transpiration helps in the absorption and\nupward movement of water and minerals dissolved\nin it from roots to the leaves. It also helps in\ntemperature regulation. The effect of root pressure in\ntransport of water is more important at night. During\nthe day when the stomata are open, the transpiration\npull becomes the major driving force in the movement\nof water in the xylem.\nTransport of food and other substances\nSo far we have discussed the transport of water and minerals in plants.\nNow let us consider how the products of metabolic processes, particularly\nphotosynthesis, are moved from leaves, where they are formed, to other\nparts of the plant. This transport of soluble products of photosynthesis\nis called translocation and it occurs in the part of the vascular tissue\nknown as phloem. Besides the products of photosynthesis, the phloem\ntransports amino acids and other substances. These substances are\nespecially delivered to the storage organs of roots, fruits and seeds and\nto growing organs. The translocation of food and other substances takes\nplace in the sieve tubes with the help of adjacent companion cells both\nin upward and downward directions.\nUnlike transport in xylem which can be largely explained by simple\nphysical forces, the translocation in phloem is achieved by utilising\nFigure 5.12Figure 5.12Figure 5.12Figure 5.12Figure 5.12\nMovement of water during transpiration in a tree\n2024-25",
      "content_type": "exercise",
      "token_count": 704,
      "page_number": 13
    },
    {
      "id": "50c046c2-cdb8-488a-be4b-b858e7fa3c10",
      "chapter_id": "1b49c04f-8ed6-4ab5-863a-39190106e24a",
      "chunk_index": 5,
      "content": "--- Page 18 ---\nScience96\nenergy. Material like sucrose is transferred into phloem tissue using\nenergy from ATP. This incr eases the osmotic pr essure of the tissue\ncausing water to move into it. This pressure moves the material in the\nphloem to tissues which have less pressure. This allows the phloem to\nmove material according to the plant’s needs. For example, in the spring,\nsugar stored in root or stem tissue would be transported to the buds\nwhich need energy to grow.\nQUESTIONS\n?",
      "content_type": "example",
      "token_count": 121,
      "page_number": 18
    },
    {
      "id": "a99e46e0-2d2e-4d05-8cb8-de5881352650",
      "chapter_id": "1e4018c3-584f-432e-a40a-35f1bb8adb3c",
      "chunk_index": 0,
      "content": "What are the functions of these components?",
      "content_type": "text",
      "token_count": 10,
      "page_number": 18
    },
    {
      "id": "b8d4ef85-8400-422f-951f-5d3169248749",
      "chapter_id": "524a303b-6d22-41a1-8e17-e753e8d2d9ec",
      "chunk_index": 0,
      "content": "mammals and birds?",
      "content_type": "text",
      "token_count": 4,
      "page_number": 18
    },
    {
      "id": "041e01cb-f87c-4b69-9d4a-9c47be019f50",
      "chapter_id": "59f4dd2b-e052-4849-a66e-552da18aeb13",
      "chunk_index": 0,
      "content": "plants?",
      "content_type": "text",
      "token_count": 1,
      "page_number": 18
    },
    {
      "id": "1879817b-390a-4ec1-a83e-7cc47e9b7359",
      "chapter_id": "e917aaa9-02ec-466c-9980-e8a7379b5b61",
      "chunk_index": 0,
      "content": "5.5 EX\n5.5 EX5.5 EX 5.5 EX5.5 EX CRETION CRETIONCRETION CRETIONCRETION\nWe have already discussed how organisms get rid of gaseous wastes\ngenerated during photosynthesis or respiration. Other metabolic activities\ngenerate nitrogenous materials which need to be removed. The biological\nprocess involved in the removal of these harmful metabolic wastes from\nthe body is called excretion. Different organisms use varied strategies to\ndo this. Many unicellular organisms remove these wastes by simple\ndiffusion from the body surface into the surrounding\nwater. As we have seen in other processes, complex\nmulti-cellular organisms use specialised organs to\nperform the same function.\n5.5.1 Excretion in Human Beings\nThe excretory system of human beings (Fig. 5.13)\nincludes a pair of kidneys, a pair of ureters, a urinary\nbladder and a urethra. Kidneys are located in the\nabdomen, one on either side of the backbone. Urine\nproduced in the kidneys passes through the ureters\ninto the urinary bladder where it is stored until it is\nreleased through the urethra.\nHow is urine produced? The purpose of making\nurine is to filter out waste products from the blood.\nJust as CO2 is removed from the blood in the lungs,\nnitrogenous waste such as urea or uric acid are\nremoved from blood in the kidneys. It is then no\nsurprise that the basic filtration unit in the kidneys,\nFigure 5.13\nExcretory system in human beings\n2024-25",
      "content_type": "text",
      "token_count": 352,
      "page_number": 18
    },
    {
      "id": "6b93a577-d47d-431b-86b0-b8b87c2c9d23",
      "chapter_id": "e917aaa9-02ec-466c-9980-e8a7379b5b61",
      "chunk_index": 1,
      "content": "--- Page 19 ---\nLife Processes 97\nlike in the lungs, is a cluster of very thin-walled blood\ncapillaries. Each capillary cluster in the kidney is\nassociated with the cup-shaped end of a coiled tube\ncalled Bowman’s capsule that collects the filtrate\n (Fig. 5.14). Each kidney has large numbers of these\nfiltration units called nephrons packed close together.\nSome substances in the initial filtrate, such as glucose,\namino acids, salts and a major amount of water, are\nselectively re-absorbed as the urine flows along the tube.\nThe amount of water re-absorbed depends on how much\nexcess water there is in the body, and on how much of\ndissolved waste there is to be excreted. The urine forming\nin each kidney eventually enters a long tube, the ureter,\nwhich connects the kidneys with the urinary bladder.\nUrine is stored in the urinary bladder until the pressure\nof the expanded bladder leads to the urge to pass it out\nthrough the urethra. The bladder is muscular, so it is\nunder nervous control, as we have discussed elsewhere.\nAs a result, we can usually control the urge to urinate.\nMore to Know!\nArtificial kidney (Hemodialysis)\nKidneys are vital organs for survival. Several factors like infections, injury or restricted\nblood flow to kidneys reduce the activity of kidneys. This leads to accumulation of\npoisonous wastes in the body, which can even lead to death. In case of kidney\nfailure, an artificial kidney can be used. An artificial kidney is a device to remove\nnitrogenous waste products from the blood through dialysis.\nArtificial kidneys contain a number of tubes with a semi-permeable lining, suspended\nin a tank filled with dialysing fluid.\nThis fluid has the same osmotic\npressure as blood, except that it is\ndevoid of nitrogenous wastes. The\npatient’s blood is passed through\nthese tubes. During this passage,\nthe waste products from the blood\npass into dialysing fluid by diffusion.\nThe purified blood is pumped back\ninto the patient. This is similar to the\nfunction of the kidney, but it is\ndifferent since there is no re-\nabsorption involved. Normally, in a\nhealthy adult, the initial filtrate in the\nkidneys is about 180 L daily.\nHowever , the volume actually\nexcreted is only a litre or two a day,\nbecause the remaining filtrate is re-\nabsorbed in the kidney tubules.\nFigure 5.14Figure 5.14Figure 5.14Figure 5.14Figure 5.14\nStructure of a nephron\n2024-25",
      "content_type": "exercise",
      "token_count": 594,
      "page_number": 18
    },
    {
      "id": "1b5ddca2-a0ff-49dc-9adb-619d72759eed",
      "chapter_id": "e917aaa9-02ec-466c-9980-e8a7379b5b61",
      "chunk_index": 2,
      "content": "--- Page 20 ---\nScience98\n5.5.2 Excretion in Plants\nPlants use completely different\nstrategies for excretion than those\nof animals. Oxygen itself can be\nthought of as a waste product\ngenerated during photosynthesis!\nWe have discussed earlier how\nplants deal with oxygen as well as\nCO2. They can get rid of excess water\nby transpiration. For other wastes,\nplants use the fact that many of\ntheir tissues consist of dead cells,\nand that they can even lose some\nparts such as leaves. Many plant\nwaste products are stored in\ncellular vacuoles. Waste pr\noducts\nmay be stored in leaves that fall off.\nOther waste products are stored as\nresins and gums, especially in old\nxylem. Plants also excrete some\nwaste substances into the soil\naround them.\nWhat you have learnt\n/square6Movement of various types can be taken as an indication of life.\n/square6Maintenance of life requires processes like nutrition, respiration, transport of\nmaterials within the body and excretion of waste products.\n/square6Autotrophic nutrition involves the intake of simple inorganic materials from the\nenvironment and using an external energy source like the Sun to synthesise complex\nhigh-energy organic material.\n/square6Heterotrophic nutrition involves the intake of complex material prepared by other\norganisms.\n/square6In human beings, the food eaten is broken down by various steps along the\nalimentary canal and the digested food is absorbed in the small intestine to be sent\nto all cells in the body.\nThink it over!\nOrgan donation\nOrgan donation is a generous act of donating an\norgan to a person who suffers from non-function of\norgan(s). Donation of an organ may be done by the\nconsent of the donor and his/her family. Anyone\nregardless of age or gender can become an organ\nand tissue donor. Organ transplants can save or\ntransform the life of a person. Transplantation is\nrequired because recipient’s organ has been\ndamaged or has failed by disease or injury. In organ\ntransplantation the organ is surgically removed\nfrom one person (organ donor) and transplanted to\nanother person (the recipient). Common\ntransplantations include corneas, kidneys, heart,\nliver, pancreas, lungs, intestines and bone marrow.\nMost organ and tissue donations occur just after\nthe donor has died or when the doctor declares a\nperson brain dead. But some organs such as\nkidney, part of a liver, lung, etc., and tissues can be\ndonated while the donor is alive.\n?\nQUESTIONS",
      "content_type": "exercise",
      "token_count": 607,
      "page_number": 21
    },
    {
      "id": "cbdc29fd-6ff7-43a0-9e42-7f1918e27f6a",
      "chapter_id": "a7781876-e961-41dd-8feb-d1427ac8f47a",
      "chunk_index": 0,
      "content": "2024-25\n\n--- Page 21 ---\nLife Processes 99\n/square6During the process of respiration, organic compounds such as glucose are broken\ndown to provide energy in the form of ATP. ATP is used to pr\novide energy for other\nreactions in the cell.\n/square6Respiration may be aerobic or anaerobic. Aerobic respiration makes more energy\navailable to the organism.\n/square6In human beings, the transport of materials such as oxygen, carbon dioxide, food\nand excretory products is a function of the circulatory system. The circulatory\nsystem consists of the heart, blood and blood vessels.\n/square6In highly differentiated plants, transport of water, minerals, food and other materials\nis a function of the vascular tissue which consists of xylem and phloem.\n/square6In human beings, excretory products in the form of soluble nitrogen compounds\nare removed by the nephrons in the kidneys.\n/square6Plants use a variety of techniques to get rid of waste material. For example, waste\nmaterial may be stored in the cell-vacuoles or as gum and resin, removed in the\nfalling leaves, or excreted into the surrounding soil.\nEXERCISES",
      "content_type": "example",
      "token_count": 277,
      "page_number": 21
    },
    {
      "id": "c34914f9-6b13-4d54-a554-53973a7c1bfc",
      "chapter_id": "4a317b79-0b1b-4980-9481-f5c1e8aaf1c2",
      "chunk_index": 0,
      "content": "(a) nutrition. (c) excretion.\n(b) respiration. (d) transportation.",
      "content_type": "text",
      "token_count": 16,
      "page_number": 21
    },
    {
      "id": "aaea6a8b-d93a-4255-9983-3b347ccaa45e",
      "chapter_id": "a5be143d-b5c7-4308-9c76-482c249d6795",
      "chunk_index": 0,
      "content": "(a) transport of water. (c) transport of amino acids.\n(b) transport of food. (d) transport of oxygen.",
      "content_type": "text",
      "token_count": 25,
      "page_number": 21
    },
    {
      "id": "9e394893-5069-4394-bd7a-dca555782b95",
      "chapter_id": "a351496d-e74f-416f-a7e8-548e5f2343e6",
      "chunk_index": 0,
      "content": "(a) carbon dioxide and water. (c) sunlight.\n(b) chlorophyll. (d) all of the above.",
      "content_type": "text",
      "token_count": 20,
      "page_number": 22
    },
    {
      "id": "60cbada5-00b8-4649-9fab-f88c8eef03d5",
      "chapter_id": "4e9f7aed-e910-4e80-9106-7f8c414b7aaa",
      "chunk_index": 0,
      "content": "(a) cytoplasm. (c) chloroplast.\n(b) mitochondria. (d) nucleus.",
      "content_type": "text",
      "token_count": 15,
      "page_number": 22
    },
    {
      "id": "399e070e-3be4-466a-b6bd-02d8302fcc2f",
      "chapter_id": "4500e8b9-604a-4491-ad8b-0c2452c5a65c",
      "chunk_index": 0,
      "content": "products?",
      "content_type": "text",
      "token_count": 2,
      "page_number": 22
    },
    {
      "id": "cfae379c-d85a-42ea-9a5e-225df3443033",
      "chapter_id": "c1bba211-2257-4f09-bd05-c9a33748d0e5",
      "chunk_index": 0,
      "content": "organisms that use the anaerobic mode of respiration.",
      "content_type": "text",
      "token_count": 13,
      "page_number": 22
    },
    {
      "id": "9a56c46d-4b77-4b2f-b425-27057f30747e",
      "chapter_id": "a8c49372-5364-4308-93de-df59c6a878d4",
      "chunk_index": 0,
      "content": "respect to their structure and functioning.\n2024-25",
      "content_type": "text",
      "token_count": 12,
      "page_number": 22
    }
  ]
}