{
  "textbook": {
    "id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
    "file_name": "Class X Health and PE - Ch 00 - like Football, Hockey, Basketball, Cricket and Volleyball..pdf",
    "title": "like Football, Hockey, Basketball, Cricket and Volleyball.",
    "grade": 10,
    "subject": "Class X Health and PE",
    "total_pages": 22,
    "file_size_mb": 2.8932313919067383,
    "status": "ready",
    "processed_at": "2025-09-28T10:55:20.862107",
    "original_path": "/Users/umasankrudhya/Projects/pinglearn/text-books/Class X Health and PE/Class X Health and PE - Ch 00 - like Football, Hockey, Basketball, Cricket and Volleyball..pdf"
  },
  "chapters": [
    {
      "id": "0e779f40-1903-4fb7-8170-affa66bc6d1e",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 1,
      "title": "1. Giving kho to side: To chase a defender",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": " (i) Two steps kho (proximity and distal step)\n (ii) Advance kho: Running ahead of defender and \ndropping kho.\n (iii) Deceptive kho: To deceive defender by different \nbody movements."
    },
    {
      "id": "4180f06b-252a-4c5d-ba7d-2b4f50b28b3f",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 2,
      "title": "2. Pole turning: To turn the pole in continuation of",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "attack \n (i) Pole turning from 8th square (from sitting position).\n (ii) 4 up turn: Turning pole by taking four steps.\n (iii) 5 up turn: Turning pole by taking five steps.\n (iv) Running pole turning: Pole turning without giving \nKho."
    },
    {
      "id": "feef1dd7-43ff-4484-b0a9-f6f2ef42b5ff",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 3,
      "title": "3. Covering on cross lane: To cover the defender on cross",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "lane.\n (i) Quadruped\n (ii) Biped\n (iii) Rush Through\n (iv) Combination\nChap-7.indd   120 8/24/2020   11:41:03 AM\n2024-25\n\n--- Page 11 ---\nTeam Games and sporTs II\n121"
    },
    {
      "id": "9813a9f3-efba-4700-9660-8e77b61b0888",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 4,
      "title": "4. Pole dive: Taking support of pole and touching the",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "defender.\n (i) Running pole dive\n (ii) Pole dive from 8th square (Sitting)\n (iii) Judgment kho and pole dive\n (iv) Running flat dive\n (v) Steady dive\n (vi) Side dive"
    },
    {
      "id": "6ec78f5b-ce95-4eb1-afbc-a26c949fd15c",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 5,
      "title": "5. Tapping",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": " (i) Shoulder tap: Touching the shoulder of defender.\n (ii) Heel tap: Touching the heel of defender.\nDefensive skills"
    },
    {
      "id": "1493b904-ebdd-4d70-9de4-f893636df007",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 6,
      "title": "1. Chain game: Defender takes entry behind the sitting",
      "topics": [],
      "start_page": 11,
      "end_page": 11,
      "content": "chaser and runs in a zig-zag path by making the \nattacker give kho from behind.\n (i) Six Single up\n (ii) Two five six up\n (iii) Two three six up\n (iv) Three four five six up\n (v) One four five six up\n (vi) One four seven one"
    },
    {
      "id": "0c65a97e-0f1e-44de-b736-1997d8e64ca2",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 7,
      "title": "2. Ring game: Defender runs in the shape of a ring (oval",
      "topics": [],
      "start_page": 11,
      "end_page": 12,
      "content": "shape) by making use of four squares. In front ring \ndefender faces the attacker. In back ring defender \nshows his back and plays ring game.\n (i) Short ring - Defender stands close to the centre \nlane.\n (ii) Medium ring - Defender stands almost half the \nway from the centre lane.\n (iii) Long ring - Defender stands away from the central \nlane but."
    },
    {
      "id": "c9ec6eae-0f06-4071-99b0-17952bcc071e",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 9,
      "title": "4. Dodging: To deceive the attacker, different body dodge",
      "topics": [],
      "start_page": 12,
      "end_page": 12,
      "content": "is used. Shoulder dodge, Foot dodge, combining both \nskills of defence, 3-ring defence."
    },
    {
      "id": "8d454610-f61b-45ac-962b-5755df7f7a42",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 10,
      "title": "5. Avoiding the pole: The defender stands between last",
      "topics": [],
      "start_page": 12,
      "end_page": 17,
      "content": "square and pole without reaching pole.\nPalti\nBy showing his back, the defender deceives the attacker and \nturns in the opposite direction to the direction in which he was  \nrunning.\nChap-7.indd   121 8/24/2020   11:41:03 AM\n2024-25\n\n--- Page 12 ---\nHealtH and PHysical education - class X\n122\nJudo\nJudo is a popular martial art, combative and \nOlympic sport. In the term judo, ‘ju’ means \n‘gentle’ and ‘do’ means ‘the way or path’.  \nJudo was developed in Japan in the late 19th \ncentury by using the principles of balance and \nleverage adapted from jujutsu. Its most prominent \nfeature is its competitive element, where the \nobjective is to either throw or putdown one’s \nopponent to the ground, immobilise or otherwise \nsubdue one’s opponent with a grappling maneuver, \nor force an opponent to submit by joint locking or \nby executing a stranglehold or choke. Strikes and \nthrusts by hands and feet as well as self-defense \nare a part of judo. Many are trained in Judo either \nfor participation in competition or self-defense.\nHistory\nThe history of judo starts with Japanese jujutsu. It was \ncreated by Professor Jigoro Kano and he believed that the \ntechniques could be practiced as a competitive sport if the \nmore dangerous techniques were omitted. By 1910 Judo was \na recognised sport that could be safely engaged in and in \n1911 it was adopted as a part of Japan’s educational system. \nIn the same year, the Kodokan Judo Instructors’ Training \nDepartment, Kodokan Black Belt Association and Japan \nAthletic Association were formed. World War II saw a different \ndevelopment of Judo. Instead of being used for sport, Judo was \nbeing taught as a combat skill. Those selected for commando \nand special services training often achieved a high standard \nof expertise. When Japan hosted the 1964 Olympics, Judo \nwas given its first opportunity as an event. Of the 16 medals \nawarded for Judo, Japan won three gold medals, and one \nsilver medal. Judo was no longer a Japanese sport but had \ndeveloped to become an international sport. \nThere have been two main developments in Judo over the \nyears. The first was the introduction of weight categories. \nEarlier everyone fought everyone else, with the result that, \nif two players were equally matched in skill, the bigger man \nusually won. Initially there were three categories, and later \nthis was made into five. Inclusion of the sport in the Olympic \nGames in 1964 helped to hasten this important reform.  \nThere are different styles of Judo. With its inclusion in the \nOlympics, there has been a shift towards a contest style \npractice. In clubs where this style is taught, the practice \nbecomes largely a continuous contest. Other schools stress \non skills. They favour repetitive movements to make them \ninstinctive and the development of speed through practice \nwith little resistance. \nFig. 7.5: Player playing Judo\nChap-7.indd   122 8/24/2020   11:41:04 AM\n2024-25\n\n--- Page 13 ---\nTeam Games and sporTs II\n123\nRules\nOfficials\nThere are three officials who preside over a judo match. There \nis one referee who walks around inside the contest area and \nconducts the match. There are two judges who sit diagonally \nacross the mat from one another, each in a corner. The two \njudges assist the referee and indicate when the contestant \ngoes outside of the contest area. The referee is in charge \nof awarding points and accessing penalties and uses hand \ngestures to signal his decision. However, if a judge disagrees \nwith a call, then the three officials take a vote and the decision \nis decided by a majority vote. In addition to the Judge and \nReferees there are also scorekeepers and timers. There is \nusually a scoreboard, which displays points and penalties \nand it can either be electronic or manual. Medical personnel \nare also on hand in the event of injury to a contestant. \nContestants\nThe two contestants, who are known as Judokas, compete for \n5 minutes for men and 4 minutes for women. One contestant \nwears white uniform and the other a blue uniform. \nUniforms\nThe judokas wear loose-fitting judo uniforms called judogi, \nconsisting of pants, a jacket and a belt. Judogi is made up \nof loose-fitting pants, a jacket and a belt that is tied around \nthe waist. The jacket and pants are made of cotton. They \nare either blue or white and they are made so a rival should \nbe able to get a grip on either one of them so as to be able \nto make a judo throw. One judoka will wear white the other \nblue. The belt is three meters long and it is wrapped around \nthe waist twice. The color of the belt signifies the rank the \ncombatant has reached. \nCompetition area\nThe entire competition area in judo is 46 to 53 feet square  \n(14 to 16 meters). This area is made up of foam mats \ncommonly referred to as tatami mats and the individual \nmats are 6.5 feet by 3.281 feet wide (2 meters long, a 1-meter \nwide). Inside the competition area is a contest area, which \nis 8-10 meters square. This contest area (shiaijo) is green in \ncolor, that would be 29.5 feet square (9-meters) and it will \nhave a 3.281 foot (1-meter) red boundary around it. This is \nthe danger zone and it alerts the competitor(s) (judoka) that \nthey are about to go out of bounds. The area outside the \ndanger zone is the safety zone. This zone is three meters wide \nand it is the out-of-bounds area.\nChap-7.indd   123 8/24/2020   11:41:04 AM\n2024-25\n\n--- Page 14 ---\nHealtH and PHysical education - class X\n124\nIn the middle of the contest area are two pieces of tape, \none blue and one white 13.1 feet apart (4-meters). These two \npieces of tape mark the place where the judoka will stand \nwhen they begin and end each bout.\nContest\nA random draw, in the same weight category, is used to \ndetermine which contestants will be fighting each other. In \nthe Olympic Games there are two pools, and each pool has \nits own single-elimination tournament. The two pool winners \nwill compete for the gold medal, with the loser of this contest \nwinning the silver medal. In each pool, the competitors who \nlose to a pool winner are then entered into a repechage round \nwhich is also a single-elimination tournament. The winners of \nthe repechage pools will be the winners of the bronze medals.\nTo win the contest a Judoka must score an Ippon a score \nthat equals 10 points by using successful Judo techniques. \nIf neither of the Judokas is able to score an Ippon or 10 \npoints by the end of the match, the winner will be the Judoka \nwho has scored the most points. In the event of a tie, for the \nfirst time at the 2004 Olympic Games, the “Golden Score” \nrule was used. If there is no winner after the five-minute \nperiod has ended, the referee announces the beginning of \n“Golden Score”. This will extend the match for an extra five-\nminute period and the contestant who scores the first point \nis declared the winner of the match.\nJudo penalties\nTwo types of penalties may be awarded. One is shido and \nanother is hansoku. After two shido are given, the third \nshido becomes hansoku-make and the victory is given to the \nopponent. This is an indirect hansoku-make and does not \nresult in expulsion from the tournament. \nWrestling\nConsidered as one of the most ancient and oldest sport in the \nworld, wrestling has also been equally popular in India. It is \na form of combat sport involving grappling type techniques \nsuch as clinch, fighting, throws, take downs, joint locks \nand other grappling holds. A wrestling bout is a physical \ncompetition, between two (occasionally more) competitors \nor partners, who attempt to gain and maintain a superior \nposition. There are a wide range of styles with varying rules, \nsuch as, traditional, historic and modern styles. Wrestling \ntechniques have been incorporated into other martial arts as \nwell as military hand-to-hand combat systems.\nActivity 7.1\nWhat is the proficiency \ngiven in India? Make a \nlist.\ne.g.: Yellow belt or Black \nbelt. \nChap-7.indd   124 8/24/2020   11:41:04 AM\n2024-25\n\n--- Page 15 ---\nTeam Games and sporTs II\n125\nFig. 7.6: Bout in wrestling\nHistory\nWrestling has been a part of human society since ancient \ntimes. In India also it received regular patronage from the \nEmperors and Kings. Wrestling in India then was popularly \nknown as Malla Yuddha. In famous Indian epic, Mahabharata, \nBhima was considered to be a great wrestler of that time \nand some of the other great wrestlers included Jarasandha, \nDuryodhana, and Karna. Another Indian epic, Ramayana \nalso mentions about wrestling and Hanuman is described \nas one of the great wrestlers of that time. Wrestling in India \ncontinued to increase its popularity during modern days. Even \nduring the British rule, wrestling in India got encouraging \nsupport, as the British rulers included the game into the \nmilitary practice. In fact, India was considered among the \ntop 10 countries in wrestling till the 1960s. India also hosted \nthe World Wrestling Championship at New Delhi in 1967.\nThe term Kushti, which means wrestling, denotes both a \nlocal form of the art as well as a more global combat. Kushti \nis composed of three primary dimensions: dao, pench, and \npaintra (moves, counter-moves, and stance). There may \nbe similarities between the daos known as multani, dhobi \npat, and kalajangh and the corresponding freestyle moves \nknown as arm drag, front hip throw, and fireman carry. But \nwhat is significantly different about wrestling in India is \nthat wrestlers mostly wrestle in mud pits, engage in bouts \nthat last for half an hour or more. At other times and under \nother circumstances Indian wrestlers follow clearly defined \ninternational guidelines, rules, and regulations.\nDo You Know?\nIn 2008, Sushil Kumar \nbrought 2nd Bronze \nMedal for India at Beijing \nOlympic Games. This feat \nwas repeated at 2012 \nOlympics games by Sushil \nKumar (Silver Medal) and \nYogeshwar Dutt Bronze \nMedal. The first medal was \nwon by K.D. Jadhav in \n1952 at Helsinki Games. \nGeeta Phogat became \nthe first Indian woman \nwrestler to represent \nthe country at 2012 \nLondon Olympic Games.\nChap-7.indd   125 8/24/2020   11:41:05 AM\n2024-25\n\n--- Page 16 ---\nHealtH and PHysical education - class X\n126\nWorldwide wrestling entered a new era with the \nacknowledgement of Female Wrestling as an Olympic \ndiscipline in the Athens Games in 2004. \nMeasurement of the wrestling mat\nTerms Dimensions\nDimensions of the mat 9 meters in a circle\nEmpty space on the border of the mat 1 metre\nHeight of the platform 1.10 metre\nColour of marks on the mat Red of Blue\nThickness of the mat 10 cm\nProtection area 1.2 to 1.5 m width\n1.5 m\n7 m\nCentral\nwrestling\narea\n1 m\n1 m\n12 m\n12 m\nProtection area\nPassivity\nzone\nFig. 7.7: Specifications of wrestling play area\nRules and regulations"
    },
    {
      "id": "0f28d4e3-daa6-4dff-9088-c60d7723eae4",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 11,
      "title": "1. There are two  Olympic styles of wrestling, Freestyle",
      "topics": [],
      "start_page": 17,
      "end_page": 17,
      "content": "and Greco-Roman. With one key exception, the rules \nof the two styles are identical:\n • In Greco-Roman, a wrestler may not attack \nhis opponent’s legs, nor use his own legs to \ntrip, lift or execute other moves.\n • In freestyle, both the arms and legs may be \nused to execute holds or to defend against \nattack."
    },
    {
      "id": "e5f19df1-1af1-4b96-81df-aeef621396ae",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 12,
      "title": "2. The wrestler must be at least 17 years old, and must",
      "topics": [],
      "start_page": 17,
      "end_page": 17,
      "content": "be sponsored by the national federation, to compete \nat the World Championships or Olympic Games.\nChap-7.indd   126 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 17 ---\nTeam Games and sporTs II\n127"
    },
    {
      "id": "7c1953f7-a736-419a-a310-e0087ca55f6c",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 13,
      "title": "3. The weight divisions: There are eight weight divisions",
      "topics": [],
      "start_page": 17,
      "end_page": 17,
      "content": "in men’s international wrestling and six for women. \nAthletes are weighed-in prior to the competition, \nand must be at the weight level or below in order to \nparticipate in the competition."
    },
    {
      "id": "99624aa7-dfaa-44f5-a3cf-68a7351d62e4",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 14,
      "title": "4. New weight categories for wrestling (for 2018-19) —",
      "topics": [],
      "start_page": 17,
      "end_page": 18,
      "content": "Under-14 Boys and Girls\nFreestyle (Boys) Freestyle (Girls)\n35 kg 30 kg\n38 kg 33 kg\n41 kg 36 kg\n44 kg 39 kg\n48 kg 42 kg\n52 kg 46 kg\n57 kg 50 kg\n62 kg 54 kg\n68 kg 58 kg\n75 kg 62 kg\nUnder-17 Boys and Girls\nFreestyle and Greco-Roman (Boys) Freestyle (Girls)\n41-45 kg 36-40 kg\n48 kg 43 kg\n51 kg 46 kg\n55 kg 49 kg\n60 kg 53 kg\n65 kg 57 kg\n71 kg 61 kg\n80 kg 65 kg\n92 kg 69 kg\n110 kg 73 kg\nUnder-19 Boys and Girls\nFreestyle Freestyle (Girls)  Greco-Roman (Boys)\n57 kg 50 kg 55 kg\n61 kg 53 kg 60 kg\n65 kg 55 kg 63 kg\n70 kg 57 kg 67 kg\n74 kg 59 kg 72 kg\n79 kg 62 kg 77 kg\n86 kg 65 kg 82 kg\nChap-7.indd   127 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 18 ---\nHealtH and PHysical education - class X\n128\n92 kg 68 kg 87 kg\n97 kg 72 kg 97 kg\n125 kg 76 kg 130 kg"
    },
    {
      "id": "9c896ab0-54be-4568-991b-38df70fae628",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 15,
      "title": "5. The officials: There are three officials for every",
      "topics": [],
      "start_page": 18,
      "end_page": 18,
      "content": "international wrestling match, a referee (on the mat) \nplus a chairperson and a judge. There cannot be two \nofficials from the same nation officiating the same \nmatch, nor may an official officiate a match where \nan athlete from his/her nation is participating. The \nofficials award points on a majority vote. At least two \nof the three officials must agree on technical points \nand falls. "
    },
    {
      "id": "f714eb56-4634-46f8-a28b-cad1203ca24d",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 16,
      "title": "6. The coach: The coach may remain at the foot of the",
      "topics": [],
      "start_page": 18,
      "end_page": 18,
      "content": "platform or at least two meters from the edge of the \nmat during the competition."
    },
    {
      "id": "65ee07d6-cc3f-460a-8f44-3bbd423d867d",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 17,
      "title": "7. The uniform: Wrestlers must wear a one-piece singlet,",
      "topics": [],
      "start_page": 18,
      "end_page": 20,
      "content": "in the color assigned to them (red or blue), wrestling \nshoes and carry a handkerchief. The wrestling singlet \nmust be of a type approved by the international \nwrestling federation. Referees must wear a white shirt \nor pullover, pants and shoes.\n o The competition rules: You have already gone \nthrough these rules in Class IX, Chapter 10 Team \nGames.\nScoring rules and terms\n • Takedown occurs when a man takes opponent to the \nmat from a standing position. This is worth one point, \nbut can be worth more if the opponent is brought down \nonto his back.\n • Exposure is turning an opponent’s shoulders to the \nmat. Once the line of the back area breaks a 90-degree \nangle, points are scored. This can occur both from the \nfeet and on the mat. A wrestler who holds his opponent \nin a danger position for five seconds will receive one \nextra point.\n • Reversal is, when the man underneath completely re-\nverses his position and comes to the top position in \ncontrol, he has scored a reversal, worth one point.\n • Escape is when an athlete works to come out from the \nbottom position (after being under dominant control) \nand gets to their feet, facing the rival. The athlete has  \nthen scored an escape, worth one point.\n • Duration of the bout U-15 cadets and veterans — The \nduration of a bout will be of two periods of 02 minutes \nwith a 30 second break.\nChap-7.indd   128 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 19 ---\nTeam Games and sporTs II\n129\n • Junior and seniors — The duration of a bout will be two \nperiods of 3 minutes each with a 30 second break. \nFor all the competitions, the timing displayed on the \nscoreboards will start from 6 to 1 minute (from 4 to 0 minute \nfor U-15, cadets and veterans).\nScoring\nPoints Terms\n1 point Holding of opponent on the ground\n2 points Placing the opponent in danger\n3 points Bringing the opponent into immediate danger \nposition\n4 points Exceeding a throw of great height losing contact of \nthe other opponent from the ground.\n5 points\nAll grand amplitude throws executed in a standing \nposition which bring the defending wrestler to a \ndirect and immediate danger position.\nThe hold executed by a wrestler in the Parterre \nposition who completely lifts his opponent off the \nground with the execution of a high amplitude \nthrow which project the opponent into a direct and \nimmediate danger position.\nFall Bring two shoulders of the opponent on the ground. \nTypes of Victories\nA bout may be won\nby fall\nby injury\nby a disqualification\nby points (by having at least 1 \npoint more after addition of the \ntwo periods)\nIn case of tie by points, \nthe winner will be \ndeclared by successively \nconsidering\nThe highest value of holds.\nThe least amount of cautions.\nThe last technical point/points \nscored.\nChap-7.indd   129 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 20 ---\nHealtH and PHysical education - class X\n130\nassessment\nKabaddi\n I. Answer the following Questions"
    },
    {
      "id": "53e2b5ed-5bc6-43aa-af60-73585ee44a50",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 22,
      "title": "5. What is the Golden Raid rule?",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": " II. Fill in the Blanks"
    },
    {
      "id": "79c4a46b-4002-403f-8f2c-ffe10ea2aff5",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 23,
      "title": "1. The Kabaddi court measures _____________ meters with a dividing",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "line in between making it into identical halves."
    },
    {
      "id": "16172e1a-c249-4d88-9eee-384d518051bb",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 24,
      "title": "2. Each team consists of minimum _____________ and maximum",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "_____________ players, but only _____________ players take the \nground at a time."
    },
    {
      "id": "7e13c91b-f814-4b09-8657-fa29e7e4d2e7",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 25,
      "title": "3. The duration of the match is two halves of _____________ minutes",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "with _____________ minutes interval in case of men and junior \nboys and of _____________ minutes with _____________ minutes \ninterval in the case of women and junior girls."
    },
    {
      "id": "df3fe84d-5972-4ce9-8909-c09aae64af3f",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 26,
      "title": "4. Each team shall be allowed to take _____________ “time outs” of",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "_____________ seconds each in each half.\nKho-Kho\n I. Fill in the Blanks"
    },
    {
      "id": "bdd12da6-2a57-42a2-988f-e7ece4f09843",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 27,
      "title": "1. In Kho-Kho, one team becomes the _____________ and the other",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "the _____________ or runners."
    },
    {
      "id": "d8f1c69f-9cf7-474b-884f-914ba1cf626c",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 28,
      "title": "2. Many historians say that Kho-Kho is actually a modified form of",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "‘ _____________ ’."
    },
    {
      "id": "f64d17e7-9b37-4687-ab57-392bd2970c51",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 29,
      "title": "3. The first ever book of Kho-Kho rules was published from",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "Gymkhana Baroda, in _____________ ."
    },
    {
      "id": "88e77a26-88b6-4f3b-ada9-24a5f3f07f24",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 30,
      "title": "4. The year 1936 got the golden opportunity for the game of Kho-",
      "topics": [],
      "start_page": 20,
      "end_page": 20,
      "content": "Kho when _____________ featured an exhibition of Kho-Kho in the \nmain stadium. "
    },
    {
      "id": "d515aad3-4ab8-42b5-8aa2-6abbad9c9a80",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 31,
      "title": "5. The first ever All India Kho-Kho Championships were organised",
      "topics": [],
      "start_page": 20,
      "end_page": 21,
      "content": "at  _____________ in 1959-60 under the auspices of  _____________ \nof India."
    },
    {
      "id": "702685fd-e286-409f-9ab4-0035128fb474",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 32,
      "title": "6. The Indian Olympic Association has included kho-kho as a",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "discipline in the next _____________ Games to be held in New \nDelhi in _____________ .Chap-7.indd   130 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 21 ---\nTeam Games and sporTs II\n131\n II. State whether True or False"
    },
    {
      "id": "6e2a12c2-c241-4ce3-be74-180e885bcb44",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 33,
      "title": "1. In Kho-Kho, each team consists of 15 players, but only 12 players",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "take the field for a contest"
    },
    {
      "id": "681c924e-d38e-4e0a-a633-8f3b94ac4afc",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 34,
      "title": "2. A match consists of 4 innings. An innings consists of chasing and",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "running turns of 9 minutes each."
    },
    {
      "id": "f790d463-9040-4196-9ba5-eb8686486185",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 35,
      "title": "3. The chasers can only run in one direction and cannot cut across",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "the sitters unlike the dodgers who can run randomly and in \nbetween the sitters."
    },
    {
      "id": "c6332ccd-467b-430c-ab14-7817fafcaeb2",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 36,
      "title": "4. The equipment used in Kho-Kho are posts, two watches, and",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "score board."
    },
    {
      "id": "c1cebf1d-3455-4c3e-8308-b5d3ababfde7",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 37,
      "title": "5. A Kho-Kho playground (or pitch) is rectangular. It is 29 meters in",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "length and 16 meters in width."
    },
    {
      "id": "6ea8c457-5c91-44cd-ac45-4ce08c3802d7",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 38,
      "title": "6. One side of the rectangle is 20 meter and the other side is 9",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "meters."
    },
    {
      "id": "85017107-38bd-46b8-9cd6-3d47bb31e344",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 39,
      "title": "7. At the end of the innings there is an interval of 5 minutes and an",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "interval of 2 minutes, in between the turns.\nJudo\n I. Answer the following Questions"
    },
    {
      "id": "8240746c-3ffe-4900-a9f8-ba10ac68d7a8",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 42,
      "title": "3. How has Judo developed in India?",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": " II. Fill in the Blanks"
    },
    {
      "id": "108dc1fd-3a7c-43a2-afd1-a7d289471164",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 43,
      "title": "1. There is one _____________ who walks around inside the contest",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "area and conducts the match and there are _____________ \njudges who sit diagonally across the mat from one another, \neach in a corner. "
    },
    {
      "id": "7065b2c4-0668-40f7-9e56-85ef0f83ce43",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 44,
      "title": "2. Contestants, who are known as _____________, compete for",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "_____________ minutes for men and _____________ minutes for \nwomen. "
    },
    {
      "id": "8e19e3da-d561-4b94-b780-74265019badb",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 45,
      "title": "3. The judoka wears loose-fitting judo uniforms called",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "_____________ because _____________ ."
    },
    {
      "id": "11b5de74-42db-45f6-b62a-5dd5710536eb",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 46,
      "title": "4. The entire competition area in judo is _____________ to",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "_____________ square feet (14 to 16 meters)."
    },
    {
      "id": "c3adcda5-f846-4e53-9e9f-e1765812fe34",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 47,
      "title": "5. In the middle of the contest area are two pieces of tape, one",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "_____________ and one _____________ ."
    },
    {
      "id": "9192f94c-be40-4ec7-94b8-bfb4ad7ce7ee",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 48,
      "title": "6. To win the contest a Judoka must score an _____________",
      "topics": [],
      "start_page": 21,
      "end_page": 21,
      "content": "a score that equals 10 points by using successful Judo \ntechniques."
    },
    {
      "id": "24e68b7b-81c2-41cf-a6fc-1cc850c96f79",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 49,
      "title": "7. Penalty points can also be awarded against a Judoka. These",
      "topics": [],
      "start_page": 21,
      "end_page": 22,
      "content": "penalties are: _____________, _____________ and _____________ .\nChap-7.indd   131 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 22 ---\nHealtH and PHysical education - class X\n132\nWrestling\n I. Answer the following Questions"
    },
    {
      "id": "c5260e29-884f-4296-b3e6-1405bf5b98ae",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 51,
      "title": "2. List and describe the scoring rules and terms of wrestling.",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": " II. Fill in the Blanks"
    },
    {
      "id": "625e0aa8-f79c-4823-9930-d3e91f53433b",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 52,
      "title": "1. It is a form of combat sports involving grappling type techniques",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "such as _____________, _____________, _____________, _____________,  \n_____________ and other grappling holds."
    },
    {
      "id": "fb65c4b0-479e-4936-9b58-39401e7d4b70",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 53,
      "title": "2. In Greco-Roman, a wrestler may not attack his/her opponent’s",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "_____________, nor use his/her own _____________ to trip, lift or \nexecute other moves."
    },
    {
      "id": "aa9065b3-eee2-4392-a393-b3503615ccf2",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 54,
      "title": "3. In freestyle, both the _____________ and _____________ may be",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "used to execute holds or to defend against attack. "
    },
    {
      "id": "e974a55f-1dd8-4108-82b3-fa55c2ae0690",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 55,
      "title": "4. International wrestling is contested on a mat, with a _____________",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "meter circular competition area."
    },
    {
      "id": "e3e2000d-a56d-4c9a-87a6-0812bbfff944",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 56,
      "title": "5. There are three officials for every international wrestling match, a",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "_____________ (on the mat) plus a _____________ and a _____________ "
    },
    {
      "id": "dbf36a1a-742c-4aa4-8f40-cfd7f7134e15",
      "textbook_id": "17eb06a0-f724-4ecb-adb1-dcaad9e297e8",
      "chapter_number": 57,
      "title": "6. If a wrestler scores _____________ points more than his opponent",
      "topics": [],
      "start_page": 22,
      "end_page": 22,
      "content": "at any time, the round is stopped.\nChap-7.indd   132 8/24/2020   11:41:06 AM\n2024-25\n"
    }
  ],
  "chunks": [
    {
      "id": "9d45ac46-cefc-4fef-9d95-881e5b171ea8",
      "chapter_id": "0e779f40-1903-4fb7-8170-affa66bc6d1e",
      "chunk_index": 0,
      "content": "(i) Two steps kho (proximity and distal step)\n (ii) Advance kho: Running ahead of defender and \ndropping kho.\n (iii) Deceptive kho: To deceive defender by different \nbody movements.",
      "content_type": "text",
      "token_count": 45,
      "page_number": 11
    },
    {
      "id": "05e429a8-854f-4a7a-8f26-42efa89d154b",
      "chapter_id": "4180f06b-252a-4c5d-ba7d-2b4f50b28b3f",
      "chunk_index": 0,
      "content": "attack \n (i) Pole turning from 8th square (from sitting position).\n (ii) 4 up turn: Turning pole by taking four steps.\n (iii) 5 up turn: Turning pole by taking five steps.\n (iv) Running pole turning: Pole turning without giving \nKho.",
      "content_type": "text",
      "token_count": 58,
      "page_number": 11
    },
    {
      "id": "9745317c-649e-4255-85a8-4596f5115e96",
      "chapter_id": "feef1dd7-43ff-4484-b0a9-f6f2ef42b5ff",
      "chunk_index": 0,
      "content": "lane.\n (i) Quadruped\n (ii) Biped\n (iii) Rush Through\n (iv) Combination\nChap-7.indd   120 8/24/2020   11:41:03 AM\n2024-25\n\n--- Page 11 ---\nTeam Games and sporTs II\n121",
      "content_type": "text",
      "token_count": 41,
      "page_number": 11
    },
    {
      "id": "9d6b6d8f-14d4-4e31-a7b0-8a72b2dc95d2",
      "chapter_id": "9813a9f3-efba-4700-9660-8e77b61b0888",
      "chunk_index": 0,
      "content": "defender.\n (i) Running pole dive\n (ii) Pole dive from 8th square (Sitting)\n (iii) Judgment kho and pole dive\n (iv) Running flat dive\n (v) Steady dive\n (vi) Side dive",
      "content_type": "text",
      "token_count": 41,
      "page_number": 11
    },
    {
      "id": "fd1d5ee8-127e-49ac-860a-7ee1d9394587",
      "chapter_id": "6ec78f5b-ce95-4eb1-afbc-a26c949fd15c",
      "chunk_index": 0,
      "content": "(i) Shoulder tap: Touching the shoulder of defender.\n (ii) Heel tap: Touching the heel of defender.\nDefensive skills",
      "content_type": "text",
      "token_count": 29,
      "page_number": 11
    },
    {
      "id": "72bdbcf2-b804-44dc-bb94-23c6b1f08406",
      "chapter_id": "1493b904-ebdd-4d70-9de4-f893636df007",
      "chunk_index": 0,
      "content": "chaser and runs in a zig-zag path by making the \nattacker give kho from behind.\n (i) Six Single up\n (ii) Two five six up\n (iii) Two three six up\n (iv) Three four five six up\n (v) One four five six up\n (vi) One four seven one",
      "content_type": "text",
      "token_count": 56,
      "page_number": 11
    },
    {
      "id": "b1f070c6-9ccd-4488-a163-3f14465d5258",
      "chapter_id": "0c65a97e-0f1e-44de-b736-1997d8e64ca2",
      "chunk_index": 0,
      "content": "shape) by making use of four squares. In front ring \ndefender faces the attacker. In back ring defender \nshows his back and plays ring game.\n (i) Short ring - Defender stands close to the centre \nlane.\n (ii) Medium ring - Defender stands almost half the \nway from the centre lane.\n (iii) Long ring - Defender stands away from the central \nlane but.",
      "content_type": "text",
      "token_count": 87,
      "page_number": 12
    },
    {
      "id": "dce5d22a-1183-4272-8671-2a3de012bde0",
      "chapter_id": "c9ec6eae-0f06-4071-99b0-17952bcc071e",
      "chunk_index": 0,
      "content": "is used. Shoulder dodge, Foot dodge, combining both \nskills of defence, 3-ring defence.",
      "content_type": "text",
      "token_count": 21,
      "page_number": 12
    },
    {
      "id": "19ad91da-b887-4f2f-a184-3ab1dff7dafa",
      "chapter_id": "8d454610-f61b-45ac-962b-5755df7f7a42",
      "chunk_index": 0,
      "content": "square and pole without reaching pole.\nPalti\nBy showing his back, the defender deceives the attacker and \nturns in the opposite direction to the direction in which he was  \nrunning.\nChap-7.indd   121 8/24/2020   11:41:03 AM\n2024-25\n\n--- Page 12 ---\nHealtH and PHysical education - class X\n122\nJudo\nJudo is a popular martial art, combative and \nOlympic sport. In the term judo, ‘ju’ means \n‘gentle’ and ‘do’ means ‘the way or path’.  \nJudo was developed in Japan in the late 19th \ncentury by using the principles of balance and \nleverage adapted from jujutsu. Its most prominent \nfeature is its competitive element, where the \nobjective is to either throw or putdown one’s \nopponent to the ground, immobilise or otherwise \nsubdue one’s opponent with a grappling maneuver, \nor force an opponent to submit by joint locking or \nby executing a stranglehold or choke. Strikes and \nthrusts by hands and feet as well as self-defense \nare a part of judo. Many are trained in Judo either \nfor participation in competition or self-defense.\nHistory\nThe history of judo starts with Japanese jujutsu. It was \ncreated by Professor Jigoro Kano and he believed that the \ntechniques could be practiced as a competitive sport if the \nmore dangerous techniques were omitted. By 1910 Judo was \na recognised sport that could be safely engaged in and in \n1911 it was adopted as a part of Japan’s educational system. \nIn the same year, the Kodokan Judo Instructors’ Training \nDepartment, Kodokan Black Belt Association and Japan \nAthletic Association were formed. World War II saw a different \ndevelopment of Judo. Instead of being used for sport, Judo was \nbeing taught as a combat skill. Those selected for commando \nand special services training often achieved a high standard \nof expertise. When Japan hosted the 1964 Olympics, Judo \nwas given its first opportunity as an event. Of the 16 medals \nawarded for Judo, Japan won three gold medals, and one \nsilver medal. Judo was no longer a Japanese sport but had \ndeveloped to become an international sport. \nThere have been two main developments in Judo over the \nyears. The first was the introduction of weight categories. \nEarlier everyone fought everyone else, with the result that, \nif two players were equally matched in skill, the bigger man \nusually won. Initially there were three categories, and later \nthis was made into five. Inclusion of the sport in the Olympic \nGames in 1964 helped to hasten this important reform.  \nThere are different styles of Judo. With its inclusion in the \nOlympics, there has been a shift towards a contest style \npractice. In clubs where this style is taught, the practice \nbecomes largely a continuous contest. Other schools stress \non skills. They favour repetitive movements to make them \ninstinctive and the development of speed through practice \nwith little resistance. \nFig. 7.5: Player playing Judo\nChap-7.indd   122 8/24/2020   11:41:04 AM\n2024-25",
      "content_type": "text",
      "token_count": 731,
      "page_number": 12
    },
    {
      "id": "9a541485-225b-4d54-86a8-48b8e41692cf",
      "chapter_id": "8d454610-f61b-45ac-962b-5755df7f7a42",
      "chunk_index": 1,
      "content": "--- Page 13 ---\nTeam Games and sporTs II\n123\nRules\nOfficials\nThere are three officials who preside over a judo match. There \nis one referee who walks around inside the contest area and \nconducts the match. There are two judges who sit diagonally \nacross the mat from one another, each in a corner. The two \njudges assist the referee and indicate when the contestant \ngoes outside of the contest area. The referee is in charge \nof awarding points and accessing penalties and uses hand \ngestures to signal his decision. However, if a judge disagrees \nwith a call, then the three officials take a vote and the decision \nis decided by a majority vote. In addition to the Judge and \nReferees there are also scorekeepers and timers. There is \nusually a scoreboard, which displays points and penalties \nand it can either be electronic or manual. Medical personnel \nare also on hand in the event of injury to a contestant. \nContestants\nThe two contestants, who are known as Judokas, compete for \n5 minutes for men and 4 minutes for women. One contestant \nwears white uniform and the other a blue uniform. \nUniforms\nThe judokas wear loose-fitting judo uniforms called judogi, \nconsisting of pants, a jacket and a belt. Judogi is made up \nof loose-fitting pants, a jacket and a belt that is tied around \nthe waist. The jacket and pants are made of cotton. They \nare either blue or white and they are made so a rival should \nbe able to get a grip on either one of them so as to be able \nto make a judo throw. One judoka will wear white the other \nblue. The belt is three meters long and it is wrapped around \nthe waist twice. The color of the belt signifies the rank the \ncombatant has reached. \nCompetition area\nThe entire competition area in judo is 46 to 53 feet square  \n(14 to 16 meters). This area is made up of foam mats \ncommonly referred to as tatami mats and the individual \nmats are 6.5 feet by 3.281 feet wide (2 meters long, a 1-meter \nwide). Inside the competition area is a contest area, which \nis 8-10 meters square. This contest area (shiaijo) is green in \ncolor, that would be 29.5 feet square (9-meters) and it will \nhave a 3.281 foot (1-meter) red boundary around it. This is \nthe danger zone and it alerts the competitor(s) (judoka) that \nthey are about to go out of bounds. The area outside the \ndanger zone is the safety zone. This zone is three meters wide \nand it is the out-of-bounds area.\nChap-7.indd   123 8/24/2020   11:41:04 AM\n2024-25",
      "content_type": "text",
      "token_count": 613,
      "page_number": 12
    },
    {
      "id": "5892baed-609c-4254-9edf-b89ae5ae3be1",
      "chapter_id": "8d454610-f61b-45ac-962b-5755df7f7a42",
      "chunk_index": 2,
      "content": "--- Page 14 ---\nHealtH and PHysical education - class X\n124\nIn the middle of the contest area are two pieces of tape, \none blue and one white 13.1 feet apart (4-meters). These two \npieces of tape mark the place where the judoka will stand \nwhen they begin and end each bout.\nContest\nA random draw, in the same weight category, is used to \ndetermine which contestants will be fighting each other. In \nthe Olympic Games there are two pools, and each pool has \nits own single-elimination tournament. The two pool winners \nwill compete for the gold medal, with the loser of this contest \nwinning the silver medal. In each pool, the competitors who \nlose to a pool winner are then entered into a repechage round \nwhich is also a single-elimination tournament. The winners of \nthe repechage pools will be the winners of the bronze medals.\nTo win the contest a Judoka must score an Ippon a score \nthat equals 10 points by using successful Judo techniques. \nIf neither of the Judokas is able to score an Ippon or 10 \npoints by the end of the match, the winner will be the Judoka \nwho has scored the most points. In the event of a tie, for the \nfirst time at the 2004 Olympic Games, the “Golden Score” \nrule was used. If there is no winner after the five-minute \nperiod has ended, the referee announces the beginning of \n“Golden Score”. This will extend the match for an extra five-\nminute period and the contestant who scores the first point \nis declared the winner of the match.\nJudo penalties\nTwo types of penalties may be awarded. One is shido and \nanother is hansoku. After two shido are given, the third \nshido becomes hansoku-make and the victory is given to the \nopponent. This is an indirect hansoku-make and does not \nresult in expulsion from the tournament. \nWrestling\nConsidered as one of the most ancient and oldest sport in the \nworld, wrestling has also been equally popular in India. It is \na form of combat sport involving grappling type techniques \nsuch as clinch, fighting, throws, take downs, joint locks \nand other grappling holds. A wrestling bout is a physical \ncompetition, between two (occasionally more) competitors \nor partners, who attempt to gain and maintain a superior \nposition. There are a wide range of styles with varying rules, \nsuch as, traditional, historic and modern styles. Wrestling \ntechniques have been incorporated into other martial arts as \nwell as military hand-to-hand combat systems.\nActivity 7.1\nWhat is the proficiency \ngiven in India? Make a \nlist.\ne.g.: Yellow belt or Black \nbelt. \nChap-7.indd   124 8/24/2020   11:41:04 AM\n2024-25",
      "content_type": "example",
      "token_count": 644,
      "page_number": 12
    },
    {
      "id": "c61246b2-a390-47f4-b718-ecf50e446737",
      "chapter_id": "8d454610-f61b-45ac-962b-5755df7f7a42",
      "chunk_index": 3,
      "content": "--- Page 15 ---\nTeam Games and sporTs II\n125\nFig. 7.6: Bout in wrestling\nHistory\nWrestling has been a part of human society since ancient \ntimes. In India also it received regular patronage from the \nEmperors and Kings. Wrestling in India then was popularly \nknown as Malla Yuddha. In famous Indian epic, Mahabharata, \nBhima was considered to be a great wrestler of that time \nand some of the other great wrestlers included Jarasandha, \nDuryodhana, and Karna. Another Indian epic, Ramayana \nalso mentions about wrestling and Hanuman is described \nas one of the great wrestlers of that time. Wrestling in India \ncontinued to increase its popularity during modern days. Even \nduring the British rule, wrestling in India got encouraging \nsupport, as the British rulers included the game into the \nmilitary practice. In fact, India was considered among the \ntop 10 countries in wrestling till the 1960s. India also hosted \nthe World Wrestling Championship at New Delhi in 1967.\nThe term Kushti, which means wrestling, denotes both a \nlocal form of the art as well as a more global combat. Kushti \nis composed of three primary dimensions: dao, pench, and \npaintra (moves, counter-moves, and stance). There may \nbe similarities between the daos known as multani, dhobi \npat, and kalajangh and the corresponding freestyle moves \nknown as arm drag, front hip throw, and fireman carry. But \nwhat is significantly different about wrestling in India is \nthat wrestlers mostly wrestle in mud pits, engage in bouts \nthat last for half an hour or more. At other times and under \nother circumstances Indian wrestlers follow clearly defined \ninternational guidelines, rules, and regulations.\nDo You Know?\nIn 2008, Sushil Kumar \nbrought 2nd Bronze \nMedal for India at Beijing \nOlympic Games. This feat \nwas repeated at 2012 \nOlympics games by Sushil \nKumar (Silver Medal) and \nYogeshwar Dutt Bronze \nMedal. The first medal was \nwon by K.D. Jadhav in \n1952 at Helsinki Games. \nGeeta Phogat became \nthe first Indian woman \nwrestler to represent \nthe country at 2012 \nLondon Olympic Games.\nChap-7.indd   125 8/24/2020   11:41:05 AM\n2024-25\n\n--- Page 16 ---\nHealtH and PHysical education - class X\n126\nWorldwide wrestling entered a new era with the \nacknowledgement of Female Wrestling as an Olympic \ndiscipline in the Athens Games in 2004. \nMeasurement of the wrestling mat\nTerms Dimensions\nDimensions of the mat 9 meters in a circle\nEmpty space on the border of the mat 1 metre\nHeight of the platform 1.10 metre\nColour of marks on the mat Red of Blue\nThickness of the mat 10 cm\nProtection area 1.2 to 1.5 m width\n1.5 m\n7 m\nCentral\nwrestling\narea\n1 m\n1 m\n12 m\n12 m\nProtection area\nPassivity\nzone\nFig. 7.7: Specifications of wrestling play area\nRules and regulations",
      "content_type": "text",
      "token_count": 686,
      "page_number": 17
    },
    {
      "id": "b04c057d-a675-444a-92c1-04c69ae8d2d1",
      "chapter_id": "0f28d4e3-daa6-4dff-9088-c60d7723eae4",
      "chunk_index": 0,
      "content": "and Greco-Roman. With one key exception, the rules \nof the two styles are identical:\n • In Greco-Roman, a wrestler may not attack \nhis opponent’s legs, nor use his own legs to \ntrip, lift or execute other moves.\n • In freestyle, both the arms and legs may be \nused to execute holds or to defend against \nattack.",
      "content_type": "text",
      "token_count": 77,
      "page_number": 17
    },
    {
      "id": "983c3786-788f-42f2-9571-73827f792787",
      "chapter_id": "e5f19df1-1af1-4b96-81df-aeef621396ae",
      "chunk_index": 0,
      "content": "be sponsored by the national federation, to compete \nat the World Championships or Olympic Games.\nChap-7.indd   126 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 17 ---\nTeam Games and sporTs II\n127",
      "content_type": "text",
      "token_count": 48,
      "page_number": 17
    },
    {
      "id": "c6a93fcd-0b76-4831-84f0-679aa8053fb9",
      "chapter_id": "7c1953f7-a736-419a-a310-e0087ca55f6c",
      "chunk_index": 0,
      "content": "in men’s international wrestling and six for women. \nAthletes are weighed-in prior to the competition, \nand must be at the weight level or below in order to \nparticipate in the competition.",
      "content_type": "text",
      "token_count": 47,
      "page_number": 17
    },
    {
      "id": "3d1d74c2-3c84-4ec3-8650-02a61d9e77cf",
      "chapter_id": "99624aa7-dfaa-44f5-a3cf-68a7351d62e4",
      "chunk_index": 0,
      "content": "Under-14 Boys and Girls\nFreestyle (Boys) Freestyle (Girls)\n35 kg 30 kg\n38 kg 33 kg\n41 kg 36 kg\n44 kg 39 kg\n48 kg 42 kg\n52 kg 46 kg\n57 kg 50 kg\n62 kg 54 kg\n68 kg 58 kg\n75 kg 62 kg\nUnder-17 Boys and Girls\nFreestyle and Greco-Roman (Boys) Freestyle (Girls)\n41-45 kg 36-40 kg\n48 kg 43 kg\n51 kg 46 kg\n55 kg 49 kg\n60 kg 53 kg\n65 kg 57 kg\n71 kg 61 kg\n80 kg 65 kg\n92 kg 69 kg\n110 kg 73 kg\nUnder-19 Boys and Girls\nFreestyle Freestyle (Girls)  Greco-Roman (Boys)\n57 kg 50 kg 55 kg\n61 kg 53 kg 60 kg\n65 kg 55 kg 63 kg\n70 kg 57 kg 67 kg\n74 kg 59 kg 72 kg\n79 kg 62 kg 77 kg\n86 kg 65 kg 82 kg\nChap-7.indd   127 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 18 ---\nHealtH and PHysical education - class X\n128\n92 kg 68 kg 87 kg\n97 kg 72 kg 97 kg\n125 kg 76 kg 130 kg",
      "content_type": "text",
      "token_count": 186,
      "page_number": 18
    },
    {
      "id": "5479cb75-0e01-470c-b178-13bc024af238",
      "chapter_id": "9c896ab0-54be-4568-991b-38df70fae628",
      "chunk_index": 0,
      "content": "international wrestling match, a referee (on the mat) \nplus a chairperson and a judge. There cannot be two \nofficials from the same nation officiating the same \nmatch, nor may an official officiate a match where \nan athlete from his/her nation is participating. The \nofficials award points on a majority vote. At least two \nof the three officials must agree on technical points \nand falls.",
      "content_type": "text",
      "token_count": 97,
      "page_number": 18
    },
    {
      "id": "ba500646-7757-457b-887b-3972ec16ea65",
      "chapter_id": "f714eb56-4634-46f8-a28b-cad1203ca24d",
      "chunk_index": 0,
      "content": "platform or at least two meters from the edge of the \nmat during the competition.",
      "content_type": "text",
      "token_count": 20,
      "page_number": 18
    },
    {
      "id": "9d336519-845e-4d2a-8ed0-f315c77a0d5a",
      "chapter_id": "65ee07d6-cc3f-460a-8f44-3bbd423d867d",
      "chunk_index": 0,
      "content": "in the color assigned to them (red or blue), wrestling \nshoes and carry a handkerchief. The wrestling singlet \nmust be of a type approved by the international \nwrestling federation. Referees must wear a white shirt \nor pullover, pants and shoes.\n o The competition rules: You have already gone \nthrough these rules in Class IX, Chapter 10 Team \nGames.\nScoring rules and terms\n • Takedown occurs when a man takes opponent to the \nmat from a standing position. This is worth one point, \nbut can be worth more if the opponent is brought down \nonto his back.\n • Exposure is turning an opponent’s shoulders to the \nmat. Once the line of the back area breaks a 90-degree \nangle, points are scored. This can occur both from the \nfeet and on the mat. A wrestler who holds his opponent \nin a danger position for five seconds will receive one \nextra point.\n • Reversal is, when the man underneath completely re-\nverses his position and comes to the top position in \ncontrol, he has scored a reversal, worth one point.\n • Escape is when an athlete works to come out from the \nbottom position (after being under dominant control) \nand gets to their feet, facing the rival. The athlete has  \nthen scored an escape, worth one point.\n • Duration of the bout U-15 cadets and veterans — The \nduration of a bout will be of two periods of 02 minutes \nwith a 30 second break.\nChap-7.indd   128 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 19 ---\nTeam Games and sporTs II\n129\n • Junior and seniors — The duration of a bout will be two \nperiods of 3 minutes each with a 30 second break. \nFor all the competitions, the timing displayed on the \nscoreboards will start from 6 to 1 minute (from 4 to 0 minute \nfor U-15, cadets and veterans).\nScoring\nPoints Terms\n1 point Holding of opponent on the ground\n2 points Placing the opponent in danger\n3 points Bringing the opponent into immediate danger \nposition\n4 points Exceeding a throw of great height losing contact of \nthe other opponent from the ground.\n5 points\nAll grand amplitude throws executed in a standing \nposition which bring the defending wrestler to a \ndirect and immediate danger position.\nThe hold executed by a wrestler in the Parterre \nposition who completely lifts his opponent off the \nground with the execution of a high amplitude \nthrow which project the opponent into a direct and \nimmediate danger position.\nFall Bring two shoulders of the opponent on the ground. \nTypes of Victories\nA bout may be won\nby fall\nby injury\nby a disqualification\nby points (by having at least 1 \npoint more after addition of the \ntwo periods)\nIn case of tie by points, \nthe winner will be \ndeclared by successively \nconsidering\nThe highest value of holds.\nThe least amount of cautions.\nThe last technical point/points \nscored.\nChap-7.indd   129 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 20 ---\nHealtH and PHysical education - class X\n130\nassessment\nKabaddi\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 728,
      "page_number": 20
    },
    {
      "id": "8952ab03-429e-42e4-9346-34de5f402dad",
      "chapter_id": "53e2b5ed-5bc6-43aa-af60-73585ee44a50",
      "chunk_index": 0,
      "content": "II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 5,
      "page_number": 20
    },
    {
      "id": "87e72733-c98c-40ec-b047-67f50acd03d9",
      "chapter_id": "79c4a46b-4002-403f-8f2c-ffe10ea2aff5",
      "chunk_index": 0,
      "content": "line in between making it into identical halves.",
      "content_type": "text",
      "token_count": 12,
      "page_number": 20
    },
    {
      "id": "5d6ddcd2-eb17-4ea1-923a-313cdd8447f5",
      "chapter_id": "16172e1a-c249-4d88-9eee-384d518051bb",
      "chunk_index": 0,
      "content": "_____________ players, but only _____________ players take the \nground at a time.",
      "content_type": "text",
      "token_count": 20,
      "page_number": 20
    },
    {
      "id": "9dc4b4d1-afcd-4a61-b843-dc73ae05fea1",
      "chapter_id": "7e13c91b-f814-4b09-8657-fa29e7e4d2e7",
      "chunk_index": 0,
      "content": "with _____________ minutes interval in case of men and junior \nboys and of _____________ minutes with _____________ minutes \ninterval in the case of women and junior girls.",
      "content_type": "text",
      "token_count": 43,
      "page_number": 20
    },
    {
      "id": "a47bae09-0808-453d-a2b8-94f3d27a96cd",
      "chapter_id": "df3fe84d-5972-4ce9-8909-c09aae64af3f",
      "chunk_index": 0,
      "content": "_____________ seconds each in each half.\nKho-Kho\n I. Fill in the Blanks",
      "content_type": "text",
      "token_count": 17,
      "page_number": 20
    },
    {
      "id": "5236736d-70ff-4c50-95a3-f14f2704b239",
      "chapter_id": "bdd12da6-2a57-42a2-988f-e7ece4f09843",
      "chunk_index": 0,
      "content": "the _____________ or runners.",
      "content_type": "text",
      "token_count": 7,
      "page_number": 20
    },
    {
      "id": "5fb314f8-62db-4bed-ae14-06d2c73f4696",
      "chapter_id": "d8f1c69f-9cf7-474b-884f-914ba1cf626c",
      "chunk_index": 0,
      "content": "‘ _____________ ’.",
      "content_type": "text",
      "token_count": 4,
      "page_number": 20
    },
    {
      "id": "6700c1b2-2964-4431-b088-2aa8b4828c27",
      "chapter_id": "f64d17e7-9b37-4687-ab57-392bd2970c51",
      "chunk_index": 0,
      "content": "Gymkhana Baroda, in _____________ .",
      "content_type": "text",
      "token_count": 8,
      "page_number": 20
    },
    {
      "id": "8b0273cf-4e21-4dab-b560-f51e40df4db6",
      "chapter_id": "88e77a26-88b6-4f3b-ada9-24a5f3f07f24",
      "chunk_index": 0,
      "content": "Kho when _____________ featured an exhibition of Kho-Kho in the \nmain stadium.",
      "content_type": "text",
      "token_count": 19,
      "page_number": 20
    },
    {
      "id": "18afa178-0ac5-4dc6-bc7a-2b690f039f0d",
      "chapter_id": "d515aad3-4ab8-42b5-8aa2-6abbad9c9a80",
      "chunk_index": 0,
      "content": "at  _____________ in 1959-60 under the auspices of  _____________ \nof India.",
      "content_type": "text",
      "token_count": 19,
      "page_number": 21
    },
    {
      "id": "d6200ca3-4306-4335-9fc7-df1a01fb2dff",
      "chapter_id": "702685fd-e286-409f-9ab4-0035128fb474",
      "chunk_index": 0,
      "content": "discipline in the next _____________ Games to be held in New \nDelhi in _____________ .Chap-7.indd   130 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 21 ---\nTeam Games and sporTs II\n131\n II. State whether True or False",
      "content_type": "text",
      "token_count": 53,
      "page_number": 21
    },
    {
      "id": "7c716a42-a4eb-414c-9a05-daf08d6705ed",
      "chapter_id": "6e2a12c2-c241-4ce3-be74-180e885bcb44",
      "chunk_index": 0,
      "content": "take the field for a contest",
      "content_type": "text",
      "token_count": 7,
      "page_number": 21
    },
    {
      "id": "c5ff64e9-32af-44fe-a712-cfd8e3346433",
      "chapter_id": "681c924e-d38e-4e0a-a633-8f3b94ac4afc",
      "chunk_index": 0,
      "content": "running turns of 9 minutes each.",
      "content_type": "text",
      "token_count": 8,
      "page_number": 21
    },
    {
      "id": "f69c0225-a64c-412d-b1c8-78ed77c766de",
      "chapter_id": "f790d463-9040-4196-9ba5-eb8686486185",
      "chunk_index": 0,
      "content": "the sitters unlike the dodgers who can run randomly and in \nbetween the sitters.",
      "content_type": "text",
      "token_count": 20,
      "page_number": 21
    },
    {
      "id": "97386752-7882-45f5-97b9-815b3a4b0be5",
      "chapter_id": "c6332ccd-467b-430c-ab14-7817fafcaeb2",
      "chunk_index": 0,
      "content": "score board.",
      "content_type": "text",
      "token_count": 3,
      "page_number": 21
    },
    {
      "id": "1594bdf2-c9dd-4e7e-91ea-fa67a8278f7b",
      "chapter_id": "c1cebf1d-3455-4c3e-8308-b5d3ababfde7",
      "chunk_index": 0,
      "content": "length and 16 meters in width.",
      "content_type": "text",
      "token_count": 7,
      "page_number": 21
    },
    {
      "id": "bb3131ae-5288-4060-b24a-8cbb5780775c",
      "chapter_id": "6ea8c457-5c91-44cd-ac45-4ce08c3802d7",
      "chunk_index": 0,
      "content": "meters.",
      "content_type": "text",
      "token_count": 1,
      "page_number": 21
    },
    {
      "id": "152bedf2-31fc-4428-9ee6-0d6b6681aff0",
      "chapter_id": "85017107-38bd-46b8-9cd6-3d47bb31e344",
      "chunk_index": 0,
      "content": "interval of 2 minutes, in between the turns.\nJudo\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 21,
      "page_number": 21
    },
    {
      "id": "62b8be14-eeb5-42f9-abdd-76bf895bed05",
      "chapter_id": "8240746c-3ffe-4900-a9f8-ba10ac68d7a8",
      "chunk_index": 0,
      "content": "II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 5,
      "page_number": 21
    },
    {
      "id": "42902d7b-e45e-4a58-b5de-6a1ecff73742",
      "chapter_id": "108dc1fd-3a7c-43a2-afd1-a7d289471164",
      "chunk_index": 0,
      "content": "area and conducts the match and there are _____________ \njudges who sit diagonally across the mat from one another, \neach in a corner.",
      "content_type": "text",
      "token_count": 33,
      "page_number": 21
    },
    {
      "id": "a2ff3784-6f30-48a7-8a66-697cd3438b64",
      "chapter_id": "7065b2c4-0668-40f7-9e56-85ef0f83ce43",
      "chunk_index": 0,
      "content": "_____________ minutes for men and _____________ minutes for \nwomen.",
      "content_type": "text",
      "token_count": 16,
      "page_number": 21
    },
    {
      "id": "43a2b652-aa59-4e91-9101-b130755d12dc",
      "chapter_id": "8e19e3da-d561-4b94-b780-74265019badb",
      "chunk_index": 0,
      "content": "_____________ because _____________ .",
      "content_type": "text",
      "token_count": 9,
      "page_number": 21
    },
    {
      "id": "329f6962-1799-46ea-a294-e2b5b36b8a3e",
      "chapter_id": "11b5de74-42db-45f6-b62a-5dd5710536eb",
      "chunk_index": 0,
      "content": "_____________ square feet (14 to 16 meters).",
      "content_type": "text",
      "token_count": 11,
      "page_number": 21
    },
    {
      "id": "265e8c02-3ecb-4b68-a49e-84bb7897ab0c",
      "chapter_id": "c3adcda5-f846-4e53-9e9f-e1765812fe34",
      "chunk_index": 0,
      "content": "_____________ and one _____________ .",
      "content_type": "text",
      "token_count": 9,
      "page_number": 21
    },
    {
      "id": "dc74e8dc-c9af-45f6-a111-a6464460756b",
      "chapter_id": "9192f94c-be40-4ec7-94b8-bfb4ad7ce7ee",
      "chunk_index": 0,
      "content": "a score that equals 10 points by using successful Judo \ntechniques.",
      "content_type": "text",
      "token_count": 16,
      "page_number": 21
    },
    {
      "id": "a4b33b68-e400-48f8-add3-93c4e1c3c820",
      "chapter_id": "24e68b7b-81c2-41cf-a6fc-1cc850c96f79",
      "chunk_index": 0,
      "content": "penalties are: _____________, _____________ and _____________ .\nChap-7.indd   131 8/24/2020   11:41:06 AM\n2024-25\n\n--- Page 22 ---\nHealtH and PHysical education - class X\n132\nWrestling\n I. Answer the following Questions",
      "content_type": "exercise",
      "token_count": 54,
      "page_number": 22
    },
    {
      "id": "84e6a775-9e3d-4177-ada3-b33969deddab",
      "chapter_id": "c5260e29-884f-4296-b3e6-1405bf5b98ae",
      "chunk_index": 0,
      "content": "II. Fill in the Blanks",
      "content_type": "text",
      "token_count": 5,
      "page_number": 22
    },
    {
      "id": "65826976-c1b1-4597-b0ff-39b412de4621",
      "chapter_id": "625e0aa8-f79c-4823-9930-d3e91f53433b",
      "chunk_index": 0,
      "content": "such as _____________, _____________, _____________, _____________,  \n_____________ and other grappling holds.",
      "content_type": "text",
      "token_count": 27,
      "page_number": 22
    },
    {
      "id": "7f725eb0-602f-4b72-9321-51ac563e1c74",
      "chapter_id": "fb65c4b0-479e-4936-9b58-39401e7d4b70",
      "chunk_index": 0,
      "content": "_____________, nor use his/her own _____________ to trip, lift or \nexecute other moves.",
      "content_type": "text",
      "token_count": 21,
      "page_number": 22
    },
    {
      "id": "0b934ee6-446b-4699-953e-6e3f1f833eb2",
      "chapter_id": "aa9065b3-eee2-4392-a393-b3503615ccf2",
      "chunk_index": 0,
      "content": "used to execute holds or to defend against attack.",
      "content_type": "text",
      "token_count": 12,
      "page_number": 22
    },
    {
      "id": "6fda8919-f114-4265-9c82-4760c5cca3c2",
      "chapter_id": "e974a55f-1dd8-4108-82b3-fa55c2ae0690",
      "chunk_index": 0,
      "content": "meter circular competition area.",
      "content_type": "text",
      "token_count": 8,
      "page_number": 22
    },
    {
      "id": "8664a052-f4d8-422f-a866-86cd8ed78c2e",
      "chapter_id": "e3e2000d-a56d-4c9a-87a6-0812bbfff944",
      "chunk_index": 0,
      "content": "_____________ (on the mat) plus a _____________ and a _____________",
      "content_type": "text",
      "token_count": 16,
      "page_number": 22
    },
    {
      "id": "53df6114-4048-4c36-8b0b-6d03b9a2adc6",
      "chapter_id": "dbf36a1a-742c-4aa4-8f40-cfd7f7134e15",
      "chunk_index": 0,
      "content": "at any time, the round is stopped.\nChap-7.indd   132 8/24/2020   11:41:06 AM\n2024-25",
      "content_type": "text",
      "token_count": 21,
      "page_number": 22
    }
  ]
}